#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccoladesUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetCount
// 0x0004 (0x0004 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccoladeListEntryWidget_SetCount) == 0x000004, "Wrong alignment on AthenaAccoladeListEntryWidget_SetCount");
static_assert(sizeof(AthenaAccoladeListEntryWidget_SetCount) == 0x000004, "Wrong size on AthenaAccoladeListEntryWidget_SetCount");
static_assert(offsetof(AthenaAccoladeListEntryWidget_SetCount, Count) == 0x000000, "Member 'AthenaAccoladeListEntryWidget_SetCount::Count' has a wrong offset!");

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetIcon
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetIcon final
{
public:
	const class UFortAccoladeItemDefinition*      ItemDef;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccoladeListEntryWidget_SetIcon) == 0x000008, "Wrong alignment on AthenaAccoladeListEntryWidget_SetIcon");
static_assert(sizeof(AthenaAccoladeListEntryWidget_SetIcon) == 0x000008, "Wrong size on AthenaAccoladeListEntryWidget_SetIcon");
static_assert(offsetof(AthenaAccoladeListEntryWidget_SetIcon, ItemDef) == 0x000000, "Member 'AthenaAccoladeListEntryWidget_SetIcon::ItemDef' has a wrong offset!");

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetIconImage
// 0x0028 (0x0028 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetIconImage final
{
public:
	TSoftObjectPtr<class UTexture2D>              IconImage;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortAccoladeType                             AccoladeType;                                      // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AthenaAccoladeListEntryWidget_SetIconImage) == 0x000008, "Wrong alignment on AthenaAccoladeListEntryWidget_SetIconImage");
static_assert(sizeof(AthenaAccoladeListEntryWidget_SetIconImage) == 0x000028, "Wrong size on AthenaAccoladeListEntryWidget_SetIconImage");
static_assert(offsetof(AthenaAccoladeListEntryWidget_SetIconImage, IconImage) == 0x000000, "Member 'AthenaAccoladeListEntryWidget_SetIconImage::IconImage' has a wrong offset!");
static_assert(offsetof(AthenaAccoladeListEntryWidget_SetIconImage, AccoladeType) == 0x000020, "Member 'AthenaAccoladeListEntryWidget_SetIconImage::AccoladeType' has a wrong offset!");

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetJustCompleted
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetJustCompleted final
{
public:
	bool                                          bJustCompleted;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccoladeListEntryWidget_SetJustCompleted) == 0x000001, "Wrong alignment on AthenaAccoladeListEntryWidget_SetJustCompleted");
static_assert(sizeof(AthenaAccoladeListEntryWidget_SetJustCompleted) == 0x000001, "Wrong size on AthenaAccoladeListEntryWidget_SetJustCompleted");
static_assert(offsetof(AthenaAccoladeListEntryWidget_SetJustCompleted, bJustCompleted) == 0x000000, "Member 'AthenaAccoladeListEntryWidget_SetJustCompleted::bJustCompleted' has a wrong offset!");

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetSource
// 0x0018 (0x0018 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetSource final
{
public:
	class FText                                   SourceText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccoladeListEntryWidget_SetSource) == 0x000008, "Wrong alignment on AthenaAccoladeListEntryWidget_SetSource");
static_assert(sizeof(AthenaAccoladeListEntryWidget_SetSource) == 0x000018, "Wrong size on AthenaAccoladeListEntryWidget_SetSource");
static_assert(offsetof(AthenaAccoladeListEntryWidget_SetSource, SourceText) == 0x000000, "Member 'AthenaAccoladeListEntryWidget_SetSource::SourceText' has a wrong offset!");

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetTitle final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccoladeListEntryWidget_SetTitle) == 0x000008, "Wrong alignment on AthenaAccoladeListEntryWidget_SetTitle");
static_assert(sizeof(AthenaAccoladeListEntryWidget_SetTitle) == 0x000018, "Wrong size on AthenaAccoladeListEntryWidget_SetTitle");
static_assert(offsetof(AthenaAccoladeListEntryWidget_SetTitle, TitleText) == 0x000000, "Member 'AthenaAccoladeListEntryWidget_SetTitle::TitleText' has a wrong offset!");

}

