#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccoladesRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AccoladesRuntime.FortCheatManager_Accolades.TriggerAccolade
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_Accolades_TriggerAccolade final
{
public:
	class FString                                 AccoladeName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCheatManager_Accolades_TriggerAccolade) == 0x000008, "Wrong alignment on FortCheatManager_Accolades_TriggerAccolade");
static_assert(sizeof(FortCheatManager_Accolades_TriggerAccolade) == 0x000010, "Wrong size on FortCheatManager_Accolades_TriggerAccolade");
static_assert(offsetof(FortCheatManager_Accolades_TriggerAccolade, AccoladeName) == 0x000000, "Member 'FortCheatManager_Accolades_TriggerAccolade::AccoladeName' has a wrong offset!");

// Function AccoladesRuntime.FortControllerComponent_AccoladeCollection.HandlePinnedQuestChanged
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_AccoladeCollection_HandlePinnedQuestChanged final
{
public:
	struct FAthenaPinnedQuestData                 PinnedQuestData;                                   // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_AccoladeCollection_HandlePinnedQuestChanged) == 0x000008, "Wrong alignment on FortControllerComponent_AccoladeCollection_HandlePinnedQuestChanged");
static_assert(sizeof(FortControllerComponent_AccoladeCollection_HandlePinnedQuestChanged) == 0x000008, "Wrong size on FortControllerComponent_AccoladeCollection_HandlePinnedQuestChanged");
static_assert(offsetof(FortControllerComponent_AccoladeCollection_HandlePinnedQuestChanged, PinnedQuestData) == 0x000000, "Member 'FortControllerComponent_AccoladeCollection_HandlePinnedQuestChanged::PinnedQuestData' has a wrong offset!");

// Function AccoladesRuntime.FortControllerComponent_AccoladeCollection.ServerMarkAccoladesAsSeen
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_AccoladeCollection_ServerMarkAccoladesAsSeen final
{
public:
	TArray<class FName>                           AccoladeNames;                                     // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_AccoladeCollection_ServerMarkAccoladesAsSeen) == 0x000008, "Wrong alignment on FortControllerComponent_AccoladeCollection_ServerMarkAccoladesAsSeen");
static_assert(sizeof(FortControllerComponent_AccoladeCollection_ServerMarkAccoladesAsSeen) == 0x000010, "Wrong size on FortControllerComponent_AccoladeCollection_ServerMarkAccoladesAsSeen");
static_assert(offsetof(FortControllerComponent_AccoladeCollection_ServerMarkAccoladesAsSeen, AccoladeNames) == 0x000000, "Member 'FortControllerComponent_AccoladeCollection_ServerMarkAccoladesAsSeen::AccoladeNames' has a wrong offset!");

// Function AccoladesRuntime.FortControllerComponent_AccoladeCollection.ServerPinAccolade
// 0x0004 (0x0004 - 0x0000)
struct FortControllerComponent_AccoladeCollection_ServerPinAccolade final
{
public:
	class FName                                   AccoladeName;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortControllerComponent_AccoladeCollection_ServerPinAccolade) == 0x000004, "Wrong alignment on FortControllerComponent_AccoladeCollection_ServerPinAccolade");
static_assert(sizeof(FortControllerComponent_AccoladeCollection_ServerPinAccolade) == 0x000004, "Wrong size on FortControllerComponent_AccoladeCollection_ServerPinAccolade");
static_assert(offsetof(FortControllerComponent_AccoladeCollection_ServerPinAccolade, AccoladeName) == 0x000000, "Member 'FortControllerComponent_AccoladeCollection_ServerPinAccolade::AccoladeName' has a wrong offset!");

}

