#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccoladesUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "AccoladesRuntime_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class AccoladesUI.AthenaAccoladeWrapper
// 0x0010 (0x0038 - 0x0028)
class UAthenaAccoladeWrapper final : public UObject
{
public:
	class FName                                   AccoladeRowName;                                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAccoladeSessionData               AccoladeData;                                      // 0x002C(0x000C)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccoladeWrapper">();
	}
	static class UAthenaAccoladeWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccoladeWrapper>();
	}
};
static_assert(alignof(UAthenaAccoladeWrapper) == 0x000008, "Wrong alignment on UAthenaAccoladeWrapper");
static_assert(sizeof(UAthenaAccoladeWrapper) == 0x000038, "Wrong size on UAthenaAccoladeWrapper");
static_assert(offsetof(UAthenaAccoladeWrapper, AccoladeRowName) == 0x000028, "Member 'UAthenaAccoladeWrapper::AccoladeRowName' has a wrong offset!");
static_assert(offsetof(UAthenaAccoladeWrapper, AccoladeData) == 0x00002C, "Member 'UAthenaAccoladeWrapper::AccoladeData' has a wrong offset!");

// Class AccoladesUI.AthenaAccoladeListEntryWidget
// 0x0008 (0x02F0 - 0x02E8)
class UAthenaAccoladeListEntryWidget final : public UCommonUserWidget
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCount(int32 Count);
	void SetIcon(const class UFortAccoladeItemDefinition* ItemDef);
	void SetIconImage(const TSoftObjectPtr<class UTexture2D>& IconImage, const EFortAccoladeType AccoladeType);
	void SetJustCompleted(const bool bJustCompleted);
	void SetSource(const class FText& SourceText);
	void SetTitle(const class FText& TitleText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccoladeListEntryWidget">();
	}
	static class UAthenaAccoladeListEntryWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccoladeListEntryWidget>();
	}
};
static_assert(alignof(UAthenaAccoladeListEntryWidget) == 0x000008, "Wrong alignment on UAthenaAccoladeListEntryWidget");
static_assert(sizeof(UAthenaAccoladeListEntryWidget) == 0x0002F0, "Wrong size on UAthenaAccoladeListEntryWidget");

// Class AccoladesUI.AthenaAccoladeListWidget
// 0x0000 (0x0BD0 - 0x0BD0)
class UAthenaAccoladeListWidget final : public UCommonListView
{
public:
	void PopulateWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccoladeListWidget">();
	}
	static class UAthenaAccoladeListWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccoladeListWidget>();
	}
};
static_assert(alignof(UAthenaAccoladeListWidget) == 0x000010, "Wrong alignment on UAthenaAccoladeListWidget");
static_assert(sizeof(UAthenaAccoladeListWidget) == 0x000BD0, "Wrong size on UAthenaAccoladeListWidget");

}

