#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorBridgeComponent

#include "Basic.hpp"

#include "ActorBridgeComponent_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function ActorBridgeComponent.ActorBridgeComponent_actor_bridge_component.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct ActorBridgeComponent_actor_bridge_component__InitCDO final
{
public:
	TOptional<class ULevelSaveRecord*, true>      _ExprResult_0;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0008(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class ULevelSaveRecord*, true>      _ExprResult_3;                                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActorBridgeComponent_actor_bridge_component__InitCDO) == 0x000008, "Wrong alignment on ActorBridgeComponent_actor_bridge_component__InitCDO");
static_assert(sizeof(ActorBridgeComponent_actor_bridge_component__InitCDO) == 0x000020, "Wrong size on ActorBridgeComponent_actor_bridge_component__InitCDO");
static_assert(offsetof(ActorBridgeComponent_actor_bridge_component__InitCDO, _ExprResult_0) == 0x000000, "Member 'ActorBridgeComponent_actor_bridge_component__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(ActorBridgeComponent_actor_bridge_component__InitCDO, __verse_0x00000000__1) == 0x000008, "Member 'ActorBridgeComponent_actor_bridge_component__InitCDO::__verse_0x00000000__1' has a wrong offset!");
static_assert(offsetof(ActorBridgeComponent_actor_bridge_component__InitCDO, _ExprResultStack_2) == 0x00000B, "Member 'ActorBridgeComponent_actor_bridge_component__InitCDO::_ExprResultStack_2' has a wrong offset!");
static_assert(offsetof(ActorBridgeComponent_actor_bridge_component__InitCDO, _ExprResult_3) == 0x000010, "Member 'ActorBridgeComponent_actor_bridge_component__InitCDO::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(ActorBridgeComponent_actor_bridge_component__InitCDO, __verse_0x00000000__3) == 0x000018, "Member 'ActorBridgeComponent_actor_bridge_component__InitCDO::__verse_0x00000000__3' has a wrong offset!");
static_assert(offsetof(ActorBridgeComponent_actor_bridge_component__InitCDO, _ExprResultStack_5) == 0x00001B, "Member 'ActorBridgeComponent_actor_bridge_component__InitCDO::_ExprResultStack_5' has a wrong offset!");

// Function ActorBridgeComponent.ActorBridgeComponent_actor_bridge_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct ActorBridgeComponent_actor_bridge_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct ActorBridgeComponent::FTuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(ActorBridgeComponent_actor_bridge_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient) == 0x000001, "Wrong alignment on ActorBridgeComponent_actor_bridge_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient");
static_assert(sizeof(ActorBridgeComponent_actor_bridge_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient) == 0x000002, "Wrong size on ActorBridgeComponent_actor_bridge_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient");
static_assert(offsetof(ActorBridgeComponent_actor_bridge_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'ActorBridgeComponent_actor_bridge_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient::__verse_0xB2CDDD72_Argument' has a wrong offset!");

}

