#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorEntity

#include "Basic.hpp"

#include "ActorEntity_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ActorEntity.ActorEntityComponent
// 0x01A0 (0x0240 - 0x00A0)
class UActorEntityComponent final : public UActorComponent
{
public:
	struct FActorEntityMappingArray               EntityMappingArray;                                // 0x00A0(0x0130)(Net, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D0[0x70];                                     // 0x01D0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorEntityComponent">();
	}
	static class UActorEntityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorEntityComponent>();
	}
};
static_assert(alignof(UActorEntityComponent) == 0x000008, "Wrong alignment on UActorEntityComponent");
static_assert(sizeof(UActorEntityComponent) == 0x000240, "Wrong size on UActorEntityComponent");
static_assert(offsetof(UActorEntityComponent, EntityMappingArray) == 0x0000A0, "Member 'UActorEntityComponent::EntityMappingArray' has a wrong offset!");

// Class ActorEntity.ActorEntitySubsystem
// 0x0068 (0x0098 - 0x0030)
class UActorEntitySubsystem : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x68];                                      // 0x0030(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorEntitySubsystem">();
	}
	static class UActorEntitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorEntitySubsystem>();
	}
};
static_assert(alignof(UActorEntitySubsystem) == 0x000008, "Wrong alignment on UActorEntitySubsystem");
static_assert(sizeof(UActorEntitySubsystem) == 0x000098, "Wrong size on UActorEntitySubsystem");

// Class ActorEntity.PhysicsComponentBridgeHelper
// 0x0010 (0x0038 - 0x0028)
class UPhysicsComponentBridgeHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActorComponentHit(class UPrimitiveComponent* PrimitiveComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsComponentBridgeHelper">();
	}
	static class UPhysicsComponentBridgeHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsComponentBridgeHelper>();
	}
};
static_assert(alignof(UPhysicsComponentBridgeHelper) == 0x000008, "Wrong alignment on UPhysicsComponentBridgeHelper");
static_assert(sizeof(UPhysicsComponentBridgeHelper) == 0x000038, "Wrong size on UPhysicsComponentBridgeHelper");

}

