#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ActorEntity.PhysicsComponentBridgeHelper.HandleActorComponentHit
// 0x0118 (0x0118 - 0x0000)
struct PhysicsComponentBridgeHelper_HandleActorComponentHit final
{
public:
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComponent;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(PhysicsComponentBridgeHelper_HandleActorComponentHit) == 0x000008, "Wrong alignment on PhysicsComponentBridgeHelper_HandleActorComponentHit");
static_assert(sizeof(PhysicsComponentBridgeHelper_HandleActorComponentHit) == 0x000118, "Wrong size on PhysicsComponentBridgeHelper_HandleActorComponentHit");
static_assert(offsetof(PhysicsComponentBridgeHelper_HandleActorComponentHit, PrimitiveComponent) == 0x000000, "Member 'PhysicsComponentBridgeHelper_HandleActorComponentHit::PrimitiveComponent' has a wrong offset!");
static_assert(offsetof(PhysicsComponentBridgeHelper_HandleActorComponentHit, OtherActor) == 0x000008, "Member 'PhysicsComponentBridgeHelper_HandleActorComponentHit::OtherActor' has a wrong offset!");
static_assert(offsetof(PhysicsComponentBridgeHelper_HandleActorComponentHit, OtherComponent) == 0x000010, "Member 'PhysicsComponentBridgeHelper_HandleActorComponentHit::OtherComponent' has a wrong offset!");
static_assert(offsetof(PhysicsComponentBridgeHelper_HandleActorComponentHit, NormalImpulse) == 0x000018, "Member 'PhysicsComponentBridgeHelper_HandleActorComponentHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(PhysicsComponentBridgeHelper_HandleActorComponentHit, Hit) == 0x000030, "Member 'PhysicsComponentBridgeHelper_HandleActorComponentHit::Hit' has a wrong offset!");

}

