#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimPresetsRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimPresetsRuntime.AnimPreset.GetPresetClass
// 0x0020 (0x0020 - 0x0000)
struct AnimPreset_GetPresetClass final
{
public:
	TSoftClassPtr<class UClass>                   ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimPreset_GetPresetClass) == 0x000008, "Wrong alignment on AnimPreset_GetPresetClass");
static_assert(sizeof(AnimPreset_GetPresetClass) == 0x000020, "Wrong size on AnimPreset_GetPresetClass");
static_assert(offsetof(AnimPreset_GetPresetClass, ReturnValue) == 0x000000, "Member 'AnimPreset_GetPresetClass::ReturnValue' has a wrong offset!");

// Function AnimPresetsRuntime.AnimPreset.HandleAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct AnimPreset_HandleAnimInstance final
{
public:
	class UAnimInstance*                          Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimPreset_HandleAnimInstance) == 0x000008, "Wrong alignment on AnimPreset_HandleAnimInstance");
static_assert(sizeof(AnimPreset_HandleAnimInstance) == 0x000008, "Wrong size on AnimPreset_HandleAnimInstance");
static_assert(offsetof(AnimPreset_HandleAnimInstance, Instance) == 0x000000, "Member 'AnimPreset_HandleAnimInstance::Instance' has a wrong offset!");

}

