#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengeRewardItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaChallengeRewardItem.AthenaChallengeRewardItem_C.BP_OnSetSelected
// 0x0001 (0x0001 - 0x0000)
struct AthenaChallengeRewardItem_C_BP_OnSetSelected final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaChallengeRewardItem_C_BP_OnSetSelected) == 0x000001, "Wrong alignment on AthenaChallengeRewardItem_C_BP_OnSetSelected");
static_assert(sizeof(AthenaChallengeRewardItem_C_BP_OnSetSelected) == 0x000001, "Wrong size on AthenaChallengeRewardItem_C_BP_OnSetSelected");
static_assert(offsetof(AthenaChallengeRewardItem_C_BP_OnSetSelected, bIsSelected) == 0x000000, "Member 'AthenaChallengeRewardItem_C_BP_OnSetSelected::bIsSelected' has a wrong offset!");

// Function AthenaChallengeRewardItem.AthenaChallengeRewardItem_C.ExecuteUbergraph_AthenaChallengeRewardItem
// 0x002C (0x002C - 0x0000)
struct AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
};
static_assert(alignof(AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem) == 0x000004, "Wrong alignment on AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem");
static_assert(sizeof(AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem) == 0x00002C, "Wrong size on AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem");
static_assert(offsetof(AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem, EntryPoint) == 0x000000, "Member 'AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem, K2Node_Event_bIsSelected) == 0x000004, "Member 'AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem, CallFunc_SelectColor_ReturnValue) == 0x000008, "Member 'AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'AthenaChallengeRewardItem_C_ExecuteUbergraph_AthenaChallengeRewardItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

