#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaFullScreenQuestMapContent

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaFullScreenQuestMapContent.AthenaFullScreenQuestMapContent_C.ExecuteUbergraph_AthenaFullScreenQuestMapContent
// 0x0088 (0x0088 - 0x0000)
struct AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetClipping                               Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetClipping                               Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowing;                             // 0x000F(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBacchusTabNavOnTop_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetClipping                               K2Node_Select_Default;                             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent) == 0x000008, "Wrong alignment on AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent");
static_assert(sizeof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent) == 0x000088, "Wrong size on AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, EntryPoint) == 0x000000, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_IsMobileGame_ReturnValue) == 0x000004, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, Temp_real_Variable) == 0x000008, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, Temp_bool_Variable) == 0x00000C, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, Temp_byte_Variable) == 0x00000D, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, Temp_byte_Variable_1) == 0x00000E, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, K2Node_Event_bShowing) == 0x00000F, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::K2Node_Event_bShowing' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000028, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000030, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000038, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000040, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, Temp_real_Variable_1) == 0x000048, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, Temp_bool_Variable_1) == 0x00004C, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000058, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000060, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_GetIsBacchusTabNavOnTop_ReturnValue) == 0x000068, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_GetIsBacchusTabNavOnTop_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_IsInZone_ReturnValue) == 0x000069, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_Not_PreBool_ReturnValue) == 0x00006A, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, CallFunc_BooleanAND_ReturnValue) == 0x00006B, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, K2Node_Select_Default) == 0x00006C, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, K2Node_Select_Default_1) == 0x000070, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent, K2Node_MakeStruct_Margin) == 0x000074, "Member 'AthenaFullScreenQuestMapContent_C_ExecuteUbergraph_AthenaFullScreenQuestMapContent::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function AthenaFullScreenQuestMapContent.AthenaFullScreenQuestMapContent_C.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct AthenaFullScreenQuestMapContent_C_SetEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFullScreenQuestMapContent_C_SetEnabled) == 0x000001, "Wrong alignment on AthenaFullScreenQuestMapContent_C_SetEnabled");
static_assert(sizeof(AthenaFullScreenQuestMapContent_C_SetEnabled) == 0x000001, "Wrong size on AthenaFullScreenQuestMapContent_C_SetEnabled");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_SetEnabled, Enabled) == 0x000000, "Member 'AthenaFullScreenQuestMapContent_C_SetEnabled::Enabled' has a wrong offset!");

// Function AthenaFullScreenQuestMapContent.AthenaFullScreenQuestMapContent_C.ShowMapLayerContainer
// 0x0001 (0x0001 - 0x0000)
struct AthenaFullScreenQuestMapContent_C_ShowMapLayerContainer final
{
public:
	bool                                          bShowing;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaFullScreenQuestMapContent_C_ShowMapLayerContainer) == 0x000001, "Wrong alignment on AthenaFullScreenQuestMapContent_C_ShowMapLayerContainer");
static_assert(sizeof(AthenaFullScreenQuestMapContent_C_ShowMapLayerContainer) == 0x000001, "Wrong size on AthenaFullScreenQuestMapContent_C_ShowMapLayerContainer");
static_assert(offsetof(AthenaFullScreenQuestMapContent_C_ShowMapLayerContainer, bShowing) == 0x000000, "Member 'AthenaFullScreenQuestMapContent_C_ShowMapLayerContainer::bShowing' has a wrong offset!");

}

