#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Pickups_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Pickups_Default.B_Pickups_Default_C
// 0x0038 (0x05E0 - 0x05A8)
class AB_Pickups_Default_C final : public AB_Pickups_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Pickups_Default_C;                // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   BG_Dark;                                           // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BG;                                                // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RarePickupFXMesh;                                  // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLightComp;                                     // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RareAmbientEmitter;                                // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Pickup_Sound;                                      // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddRareFX();
	void DrawDark();
	void ExecuteUbergraph_B_Pickups_Default(int32 EntryPoint);
	void HideBackgroundAndSpotlight();
	void InitializeSpotlightComponent();
	void OnPickedUp(class AFortPawn* PickupTarget);
	void OnTossed();
	void ReceiveBeginPlay();
	void Set_Initial_BKGD_Param(class UMaterialInstanceDynamic* Mid);
	void SetDrawDistances(double BG_0, double bgdark, double Gun);
	void SetMaxDraw_BG(double BG_0);
	void SetMaxDraw_BGDark(double BG_0);
	void SetMaxDraw_Gun(double BG_0);
	void SetMaxDraw_RareFX(double BG_0);
	void SetMaxDraw_RareMesh(double BG_0);
	void Setup_View_Distances(int32* ViewDistanceQuality);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pickups_Default_C">();
	}
	static class AB_Pickups_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pickups_Default_C>();
	}
};
static_assert(alignof(AB_Pickups_Default_C) == 0x000008, "Wrong alignment on AB_Pickups_Default_C");
static_assert(sizeof(AB_Pickups_Default_C) == 0x0005E0, "Wrong size on AB_Pickups_Default_C");
static_assert(offsetof(AB_Pickups_Default_C, UberGraphFrame_B_Pickups_Default_C) == 0x0005A8, "Member 'AB_Pickups_Default_C::UberGraphFrame_B_Pickups_Default_C' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, BG_Dark) == 0x0005B0, "Member 'AB_Pickups_Default_C::BG_Dark' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, BG) == 0x0005B8, "Member 'AB_Pickups_Default_C::BG' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, RarePickupFXMesh) == 0x0005C0, "Member 'AB_Pickups_Default_C::RarePickupFXMesh' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, SpotLightComp) == 0x0005C8, "Member 'AB_Pickups_Default_C::SpotLightComp' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, RareAmbientEmitter) == 0x0005D0, "Member 'AB_Pickups_Default_C::RareAmbientEmitter' has a wrong offset!");
static_assert(offsetof(AB_Pickups_Default_C, Pickup_Sound) == 0x0005D8, "Member 'AB_Pickups_Default_C::Pickup_Sound' has a wrong offset!");

}

