#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusLobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EUI_Lobby_PlayButton_State_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function BacchusLobby.BacchusLobby_C.SetPlayCancelAndBackButtonsVisible
// 0x0004 (0x0004 - 0x0000)
struct BacchusLobby_C_SetPlayCancelAndBackButtonsVisible final
{
public:
	bool                                          ShouldPlayCancelButtonBeVisible;                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewMMFlow_IsNewMMFlow;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCancelCurrentAction_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_SetPlayCancelAndBackButtonsVisible) == 0x000001, "Wrong alignment on BacchusLobby_C_SetPlayCancelAndBackButtonsVisible");
static_assert(sizeof(BacchusLobby_C_SetPlayCancelAndBackButtonsVisible) == 0x000004, "Wrong size on BacchusLobby_C_SetPlayCancelAndBackButtonsVisible");
static_assert(offsetof(BacchusLobby_C_SetPlayCancelAndBackButtonsVisible, ShouldPlayCancelButtonBeVisible) == 0x000000, "Member 'BacchusLobby_C_SetPlayCancelAndBackButtonsVisible::ShouldPlayCancelButtonBeVisible' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_SetPlayCancelAndBackButtonsVisible, CallFunc_IsNewMMFlow_IsNewMMFlow) == 0x000001, "Member 'BacchusLobby_C_SetPlayCancelAndBackButtonsVisible::CallFunc_IsNewMMFlow_IsNewMMFlow' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_SetPlayCancelAndBackButtonsVisible, CallFunc_IsCancelCurrentAction_ReturnValue) == 0x000002, "Member 'BacchusLobby_C_SetPlayCancelAndBackButtonsVisible::CallFunc_IsCancelCurrentAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_SetPlayCancelAndBackButtonsVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BacchusLobby_C_SetPlayCancelAndBackButtonsVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnActivityShouldShowIARCRatingChanged
// 0x0003 (0x0003 - 0x0000)
struct BacchusLobby_C_OnActivityShouldShowIARCRatingChanged final
{
public:
	bool                                          bShouldShowIARCRating;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAgeRating_ReturnValue;                 // 0x0001(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_OnActivityShouldShowIARCRatingChanged) == 0x000001, "Wrong alignment on BacchusLobby_C_OnActivityShouldShowIARCRatingChanged");
static_assert(sizeof(BacchusLobby_C_OnActivityShouldShowIARCRatingChanged) == 0x000003, "Wrong size on BacchusLobby_C_OnActivityShouldShowIARCRatingChanged");
static_assert(offsetof(BacchusLobby_C_OnActivityShouldShowIARCRatingChanged, bShouldShowIARCRating) == 0x000000, "Member 'BacchusLobby_C_OnActivityShouldShowIARCRatingChanged::bShouldShowIARCRating' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnActivityShouldShowIARCRatingChanged, CallFunc_HasAgeRating_ReturnValue) == 0x000001, "Member 'BacchusLobby_C_OnActivityShouldShowIARCRatingChanged::CallFunc_HasAgeRating_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnActivityShouldShowIARCRatingChanged, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'BacchusLobby_C_OnActivityShouldShowIARCRatingChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.ShowAgeRating
// 0x0001 (0x0001 - 0x0000)
struct BacchusLobby_C_ShowAgeRating final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_ShowAgeRating) == 0x000001, "Wrong alignment on BacchusLobby_C_ShowAgeRating");
static_assert(sizeof(BacchusLobby_C_ShowAgeRating) == 0x000001, "Wrong size on BacchusLobby_C_ShowAgeRating");
static_assert(offsetof(BacchusLobby_C_ShowAgeRating, bShouldShow) == 0x000000, "Member 'BacchusLobby_C_ShowAgeRating::bShouldShow' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnNavigateToRightContent
// 0x0058 (0x0058 - 0x0000)
struct BacchusLobby_C_OnNavigateToRightContent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_OnNavigateToRightContent) == 0x000008, "Wrong alignment on BacchusLobby_C_OnNavigateToRightContent");
static_assert(sizeof(BacchusLobby_C_OnNavigateToRightContent) == 0x000058, "Wrong size on BacchusLobby_C_OnNavigateToRightContent");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, ReturnValue) == 0x000000, "Member 'BacchusLobby_C_OnNavigateToRightContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, Temp_bool_True_if_break_was_hit_Variable) == 0x000001, "Member 'BacchusLobby_C_OnNavigateToRightContent::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BacchusLobby_C_OnNavigateToRightContent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BacchusLobby_C_OnNavigateToRightContent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_Array_Get_Item) == 0x000028, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_GetActiveWidget_ReturnValue) == 0x000030, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_IsVisible_ReturnValue) == 0x000039, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, K2Node_DynamicCast_AsUser_Widget) == 0x000040, "Member 'BacchusLobby_C_OnNavigateToRightContent::K2Node_DynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BacchusLobby_C_OnNavigateToRightContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToRightContent, CallFunc_BooleanAND_ReturnValue_1) == 0x000052, "Member 'BacchusLobby_C_OnNavigateToRightContent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnNavigateToLeftContent
// 0x0018 (0x0018 - 0x0000)
struct BacchusLobby_C_OnNavigateToLeftContent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewMMFlow_IsNewMMFlow;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_OnNavigateToLeftContent) == 0x000008, "Wrong alignment on BacchusLobby_C_OnNavigateToLeftContent");
static_assert(sizeof(BacchusLobby_C_OnNavigateToLeftContent) == 0x000018, "Wrong size on BacchusLobby_C_OnNavigateToLeftContent");
static_assert(offsetof(BacchusLobby_C_OnNavigateToLeftContent, ReturnValue) == 0x000000, "Member 'BacchusLobby_C_OnNavigateToLeftContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToLeftContent, K2Node_DynamicCast_AsCommon_Activatable_Widget) == 0x000008, "Member 'BacchusLobby_C_OnNavigateToLeftContent::K2Node_DynamicCast_AsCommon_Activatable_Widget' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToLeftContent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BacchusLobby_C_OnNavigateToLeftContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnNavigateToLeftContent, CallFunc_IsNewMMFlow_IsNewMMFlow) == 0x000011, "Member 'BacchusLobby_C_OnNavigateToLeftContent::CallFunc_IsNewMMFlow_IsNewMMFlow' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.HandleNavigateDownToDiscover
// 0x0028 (0x0028 - 0x0000)
struct BacchusLobby_C_HandleNavigateDownToDiscover final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewMMFlow_IsNewMMFlow;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateToDiscover_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_HandleNavigateDownToDiscover) == 0x000008, "Wrong alignment on BacchusLobby_C_HandleNavigateDownToDiscover");
static_assert(sizeof(BacchusLobby_C_HandleNavigateDownToDiscover) == 0x000028, "Wrong size on BacchusLobby_C_HandleNavigateDownToDiscover");
static_assert(offsetof(BacchusLobby_C_HandleNavigateDownToDiscover, Navigation_0) == 0x000000, "Member 'BacchusLobby_C_HandleNavigateDownToDiscover::Navigation_0' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateDownToDiscover, ReturnValue) == 0x000008, "Member 'BacchusLobby_C_HandleNavigateDownToDiscover::ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateDownToDiscover, CallFunc_IsNewMMFlow_IsNewMMFlow) == 0x000010, "Member 'BacchusLobby_C_HandleNavigateDownToDiscover::CallFunc_IsNewMMFlow_IsNewMMFlow' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateDownToDiscover, K2Node_DynamicCast_AsCommon_Activatable_Widget) == 0x000018, "Member 'BacchusLobby_C_HandleNavigateDownToDiscover::K2Node_DynamicCast_AsCommon_Activatable_Widget' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateDownToDiscover, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BacchusLobby_C_HandleNavigateDownToDiscover::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateDownToDiscover, CallFunc_NavigateToDiscover_ReturnValue) == 0x000021, "Member 'BacchusLobby_C_HandleNavigateDownToDiscover::CallFunc_NavigateToDiscover_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateDownToDiscover, CallFunc_IsActivated_ReturnValue) == 0x000022, "Member 'BacchusLobby_C_HandleNavigateDownToDiscover::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateDownToDiscover, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'BacchusLobby_C_HandleNavigateDownToDiscover::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.HandleNavigateRightFromLeftContent
// 0x0020 (0x0020 - 0x0000)
struct BacchusLobby_C_HandleNavigateRightFromLeftContent final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_HandleNavigateRightFromLeftContent) == 0x000008, "Wrong alignment on BacchusLobby_C_HandleNavigateRightFromLeftContent");
static_assert(sizeof(BacchusLobby_C_HandleNavigateRightFromLeftContent) == 0x000020, "Wrong size on BacchusLobby_C_HandleNavigateRightFromLeftContent");
static_assert(offsetof(BacchusLobby_C_HandleNavigateRightFromLeftContent, Navigation_0) == 0x000000, "Member 'BacchusLobby_C_HandleNavigateRightFromLeftContent::Navigation_0' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateRightFromLeftContent, ReturnValue) == 0x000008, "Member 'BacchusLobby_C_HandleNavigateRightFromLeftContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateRightFromLeftContent, K2Node_DynamicCast_AsCommon_Activatable_Widget) == 0x000010, "Member 'BacchusLobby_C_HandleNavigateRightFromLeftContent::K2Node_DynamicCast_AsCommon_Activatable_Widget' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateRightFromLeftContent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BacchusLobby_C_HandleNavigateRightFromLeftContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.HandleNavigateLeftFromRightContent
// 0x0010 (0x0010 - 0x0000)
struct BacchusLobby_C_HandleNavigateLeftFromRightContent final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_HandleNavigateLeftFromRightContent) == 0x000008, "Wrong alignment on BacchusLobby_C_HandleNavigateLeftFromRightContent");
static_assert(sizeof(BacchusLobby_C_HandleNavigateLeftFromRightContent) == 0x000010, "Wrong size on BacchusLobby_C_HandleNavigateLeftFromRightContent");
static_assert(offsetof(BacchusLobby_C_HandleNavigateLeftFromRightContent, Navigation_0) == 0x000000, "Member 'BacchusLobby_C_HandleNavigateLeftFromRightContent::Navigation_0' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleNavigateLeftFromRightContent, ReturnValue) == 0x000008, "Member 'BacchusLobby_C_HandleNavigateLeftFromRightContent::ReturnValue' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnActivityAgeRatingChanged
// 0x0002 (0x0002 - 0x0000)
struct BacchusLobby_C_OnActivityAgeRatingChanged final
{
public:
	bool                                          HasAgeRating;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_OnActivityAgeRatingChanged) == 0x000001, "Wrong alignment on BacchusLobby_C_OnActivityAgeRatingChanged");
static_assert(sizeof(BacchusLobby_C_OnActivityAgeRatingChanged) == 0x000002, "Wrong size on BacchusLobby_C_OnActivityAgeRatingChanged");
static_assert(offsetof(BacchusLobby_C_OnActivityAgeRatingChanged, HasAgeRating) == 0x000000, "Member 'BacchusLobby_C_OnActivityAgeRatingChanged::HasAgeRating' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnActivityAgeRatingChanged, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'BacchusLobby_C_OnActivityAgeRatingChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.HandleLobbyColorSchemeChange
// 0x0050 (0x0050 - 0x0000)
struct BacchusLobby_C_HandleLobbyColorSchemeChange final
{
public:
	struct FLinearColor                           NewColorScheme;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDefaultScheme;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaLobbyMatchmakingPlay_C*          K2Node_DynamicCast_AsAthena_Lobby_Matchmaking_Play; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_HandleLobbyColorSchemeChange) == 0x000008, "Wrong alignment on BacchusLobby_C_HandleLobbyColorSchemeChange");
static_assert(sizeof(BacchusLobby_C_HandleLobbyColorSchemeChange) == 0x000050, "Wrong size on BacchusLobby_C_HandleLobbyColorSchemeChange");
static_assert(offsetof(BacchusLobby_C_HandleLobbyColorSchemeChange, NewColorScheme) == 0x000000, "Member 'BacchusLobby_C_HandleLobbyColorSchemeChange::NewColorScheme' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleLobbyColorSchemeChange, UseDefaultScheme) == 0x000010, "Member 'BacchusLobby_C_HandleLobbyColorSchemeChange::UseDefaultScheme' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleLobbyColorSchemeChange, Temp_struct_Variable) == 0x000014, "Member 'BacchusLobby_C_HandleLobbyColorSchemeChange::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleLobbyColorSchemeChange, K2Node_DynamicCast_AsAthena_Lobby_Matchmaking_Play) == 0x000028, "Member 'BacchusLobby_C_HandleLobbyColorSchemeChange::K2Node_DynamicCast_AsAthena_Lobby_Matchmaking_Play' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleLobbyColorSchemeChange, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BacchusLobby_C_HandleLobbyColorSchemeChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleLobbyColorSchemeChange, Temp_bool_Variable) == 0x000031, "Member 'BacchusLobby_C_HandleLobbyColorSchemeChange::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleLobbyColorSchemeChange, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'BacchusLobby_C_HandleLobbyColorSchemeChange::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_HandleLobbyColorSchemeChange, K2Node_Select_Default) == 0x000040, "Member 'BacchusLobby_C_HandleLobbyColorSchemeChange::K2Node_Select_Default' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.ConfigureGenericLinkButton
// 0x0078 (0x0078 - 0x0000)
struct BacchusLobby_C_ConfigureGenericLinkButton final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	TScriptInterface<class IFortClientAnnouncement_TutorialInterface> K2Node_DynamicCast_AsFort_Client_Announcement_Tutorial_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLobbyGenericLinkButtonOverrideText_ReturnValue; // 0x0040(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
};
static_assert(alignof(BacchusLobby_C_ConfigureGenericLinkButton) == 0x000008, "Wrong alignment on BacchusLobby_C_ConfigureGenericLinkButton");
static_assert(sizeof(BacchusLobby_C_ConfigureGenericLinkButton) == 0x000078, "Wrong size on BacchusLobby_C_ConfigureGenericLinkButton");
static_assert(offsetof(BacchusLobby_C_ConfigureGenericLinkButton, Temp_bool_Variable) == 0x000000, "Member 'BacchusLobby_C_ConfigureGenericLinkButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_ConfigureGenericLinkButton, Temp_text_Variable) == 0x000008, "Member 'BacchusLobby_C_ConfigureGenericLinkButton::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_ConfigureGenericLinkButton, K2Node_DynamicCast_AsFort_Client_Announcement_Tutorial_Interface) == 0x000020, "Member 'BacchusLobby_C_ConfigureGenericLinkButton::K2Node_DynamicCast_AsFort_Client_Announcement_Tutorial_Interface' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_ConfigureGenericLinkButton, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BacchusLobby_C_ConfigureGenericLinkButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_ConfigureGenericLinkButton, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000038, "Member 'BacchusLobby_C_ConfigureGenericLinkButton::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_ConfigureGenericLinkButton, CallFunc_GetLobbyGenericLinkButtonOverrideText_ReturnValue) == 0x000040, "Member 'BacchusLobby_C_ConfigureGenericLinkButton::CallFunc_GetLobbyGenericLinkButtonOverrideText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_ConfigureGenericLinkButton, CallFunc_TextIsEmpty_ReturnValue) == 0x000058, "Member 'BacchusLobby_C_ConfigureGenericLinkButton::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_ConfigureGenericLinkButton, K2Node_Select_Default) == 0x000060, "Member 'BacchusLobby_C_ConfigureGenericLinkButton::K2Node_Select_Default' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.ShowPicker
// 0x000C (0x000C - 0x0000)
struct BacchusLobby_C_ShowPicker final
{
public:
	EFortPickerMode                               Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InitialOption;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreFirstAccept;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_ShowPicker) == 0x000004, "Wrong alignment on BacchusLobby_C_ShowPicker");
static_assert(sizeof(BacchusLobby_C_ShowPicker) == 0x00000C, "Wrong size on BacchusLobby_C_ShowPicker");
static_assert(offsetof(BacchusLobby_C_ShowPicker, Mode) == 0x000000, "Member 'BacchusLobby_C_ShowPicker::Mode' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_ShowPicker, InitialOption) == 0x000004, "Member 'BacchusLobby_C_ShowPicker::InitialOption' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_ShowPicker, IgnoreFirstAccept) == 0x000008, "Member 'BacchusLobby_C_ShowPicker::IgnoreFirstAccept' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.StartAthenaLobbyMusic
// 0x0020 (0x0020 - 0x0000)
struct BacchusLobby_C_StartAthenaLobbyMusic final
{
public:
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_StartAthenaLobbyMusic) == 0x000008, "Wrong alignment on BacchusLobby_C_StartAthenaLobbyMusic");
static_assert(sizeof(BacchusLobby_C_StartAthenaLobbyMusic) == 0x000020, "Wrong size on BacchusLobby_C_StartAthenaLobbyMusic");
static_assert(offsetof(BacchusLobby_C_StartAthenaLobbyMusic, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'BacchusLobby_C_StartAthenaLobbyMusic::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_StartAthenaLobbyMusic, CallFunc_Array_Get_Item) == 0x000010, "Member 'BacchusLobby_C_StartAthenaLobbyMusic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_StartAthenaLobbyMusic, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BacchusLobby_C_StartAthenaLobbyMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnComplete_BAD0F388436F1E67B83EC3AFC8BAC291
// 0x0008 (0x0008 - 0x0000)
struct BacchusLobby_C_OnComplete_BAD0F388436F1E67B83EC3AFC8BAC291 final
{
public:
	class UUserWidget*                            UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_OnComplete_BAD0F388436F1E67B83EC3AFC8BAC291) == 0x000008, "Wrong alignment on BacchusLobby_C_OnComplete_BAD0F388436F1E67B83EC3AFC8BAC291");
static_assert(sizeof(BacchusLobby_C_OnComplete_BAD0F388436F1E67B83EC3AFC8BAC291) == 0x000008, "Wrong size on BacchusLobby_C_OnComplete_BAD0F388436F1E67B83EC3AFC8BAC291");
static_assert(offsetof(BacchusLobby_C_OnComplete_BAD0F388436F1E67B83EC3AFC8BAC291, UserWidget) == 0x000000, "Member 'BacchusLobby_C_OnComplete_BAD0F388436F1E67B83EC3AFC8BAC291::UserWidget' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.DisplayStoreUpdated
// 0x0008 (0x0008 - 0x0000)
struct BacchusLobby_C_DisplayStoreUpdated final
{
public:
	class UStoreToastRequest*                     StoreUpdatedRequest;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_DisplayStoreUpdated) == 0x000008, "Wrong alignment on BacchusLobby_C_DisplayStoreUpdated");
static_assert(sizeof(BacchusLobby_C_DisplayStoreUpdated) == 0x000008, "Wrong size on BacchusLobby_C_DisplayStoreUpdated");
static_assert(offsetof(BacchusLobby_C_DisplayStoreUpdated, StoreUpdatedRequest) == 0x000000, "Member 'BacchusLobby_C_DisplayStoreUpdated::StoreUpdatedRequest' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnPlaylistChanged
// 0x0010 (0x0010 - 0x0000)
struct BacchusLobby_C_OnPlaylistChanged final
{
public:
	EFortLobbyType                                LobbyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortPlaylistAthena*              PlaylistData;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_OnPlaylistChanged) == 0x000008, "Wrong alignment on BacchusLobby_C_OnPlaylistChanged");
static_assert(sizeof(BacchusLobby_C_OnPlaylistChanged) == 0x000010, "Wrong size on BacchusLobby_C_OnPlaylistChanged");
static_assert(offsetof(BacchusLobby_C_OnPlaylistChanged, LobbyType) == 0x000000, "Member 'BacchusLobby_C_OnPlaylistChanged::LobbyType' has a wrong offset!");
static_assert(offsetof(BacchusLobby_C_OnPlaylistChanged, PlaylistData) == 0x000008, "Member 'BacchusLobby_C_OnPlaylistChanged::PlaylistData' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.DisplayGlyphQuestUpdated
// 0x0004 (0x0004 - 0x0000)
struct BacchusLobby_C_DisplayGlyphQuestUpdated final
{
public:
	int32                                         NewGlyphs;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_DisplayGlyphQuestUpdated) == 0x000004, "Wrong alignment on BacchusLobby_C_DisplayGlyphQuestUpdated");
static_assert(sizeof(BacchusLobby_C_DisplayGlyphQuestUpdated) == 0x000004, "Wrong size on BacchusLobby_C_DisplayGlyphQuestUpdated");
static_assert(offsetof(BacchusLobby_C_DisplayGlyphQuestUpdated, NewGlyphs) == 0x000000, "Member 'BacchusLobby_C_DisplayGlyphQuestUpdated::NewGlyphs' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.HandleUnseenQuestsChanged
// 0x0001 (0x0001 - 0x0000)
struct BacchusLobby_C_HandleUnseenQuestsChanged final
{
public:
	bool                                          bHasUnseenQuests;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_HandleUnseenQuestsChanged) == 0x000001, "Wrong alignment on BacchusLobby_C_HandleUnseenQuestsChanged");
static_assert(sizeof(BacchusLobby_C_HandleUnseenQuestsChanged) == 0x000001, "Wrong size on BacchusLobby_C_HandleUnseenQuestsChanged");
static_assert(offsetof(BacchusLobby_C_HandleUnseenQuestsChanged, bHasUnseenQuests) == 0x000000, "Member 'BacchusLobby_C_HandleUnseenQuestsChanged::bHasUnseenQuests' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnQuestsButtonVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct BacchusLobby_C_OnQuestsButtonVisibilityChanged final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_OnQuestsButtonVisibilityChanged) == 0x000001, "Wrong alignment on BacchusLobby_C_OnQuestsButtonVisibilityChanged");
static_assert(sizeof(BacchusLobby_C_OnQuestsButtonVisibilityChanged) == 0x000001, "Wrong size on BacchusLobby_C_OnQuestsButtonVisibilityChanged");
static_assert(offsetof(BacchusLobby_C_OnQuestsButtonVisibilityChanged, NewVisibility) == 0x000000, "Member 'BacchusLobby_C_OnQuestsButtonVisibilityChanged::NewVisibility' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnRankedProgressDisplayUpdated
// 0x0001 (0x0001 - 0x0000)
struct BacchusLobby_C_OnRankedProgressDisplayUpdated final
{
public:
	bool                                          bPlayingRanked;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_OnRankedProgressDisplayUpdated) == 0x000001, "Wrong alignment on BacchusLobby_C_OnRankedProgressDisplayUpdated");
static_assert(sizeof(BacchusLobby_C_OnRankedProgressDisplayUpdated) == 0x000001, "Wrong size on BacchusLobby_C_OnRankedProgressDisplayUpdated");
static_assert(offsetof(BacchusLobby_C_OnRankedProgressDisplayUpdated, bPlayingRanked) == 0x000000, "Member 'BacchusLobby_C_OnRankedProgressDisplayUpdated::bPlayingRanked' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.BndEvt__AthenaLobby_WBP_BottomBarDecoyButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarDecoyButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarDecoyButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarDecoyButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarDecoyButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarDecoyButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarDecoyButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarDecoyButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnHomespaceTellLobbyToTransition
// 0x0001 (0x0001 - 0x0000)
struct BacchusLobby_C_OnHomespaceTellLobbyToTransition final
{
public:
	bool                                          PlayVisible;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_OnHomespaceTellLobbyToTransition) == 0x000001, "Wrong alignment on BacchusLobby_C_OnHomespaceTellLobbyToTransition");
static_assert(sizeof(BacchusLobby_C_OnHomespaceTellLobbyToTransition) == 0x000001, "Wrong size on BacchusLobby_C_OnHomespaceTellLobbyToTransition");
static_assert(offsetof(BacchusLobby_C_OnHomespaceTellLobbyToTransition, PlayVisible) == 0x000000, "Member 'BacchusLobby_C_OnHomespaceTellLobbyToTransition::PlayVisible' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.OnLobbyDataChanged
// 0x00A8 (0x00A8 - 0x0000)
struct BacchusLobby_C_OnLobbyDataChanged final
{
public:
	struct FFrontendLobbyData                     LobbyData;                                         // 0x0000(0x00A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BacchusLobby_C_OnLobbyDataChanged) == 0x000008, "Wrong alignment on BacchusLobby_C_OnLobbyDataChanged");
static_assert(sizeof(BacchusLobby_C_OnLobbyDataChanged) == 0x0000A8, "Wrong size on BacchusLobby_C_OnLobbyDataChanged");
static_assert(offsetof(BacchusLobby_C_OnLobbyDataChanged, LobbyData) == 0x000000, "Member 'BacchusLobby_C_OnLobbyDataChanged::LobbyData' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.BndEvt__AthenaLobby_WBP_BottomBarHack_MMPlayOrCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarHack_MMPlayOrCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarHack_MMPlayOrCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarHack_MMPlayOrCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarHack_MMPlayOrCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarHack_MMPlayOrCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarHack_MMPlayOrCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BacchusLobby_C_BndEvt__AthenaLobby_WBP_BottomBarHack_MMPlayOrCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.UpdateBottomBarPlayButtonText
// 0x0001 (0x0001 - 0x0000)
struct BacchusLobby_C_UpdateBottomBarPlayButtonText final
{
public:
	EUI_Lobby_PlayButton_State                    BottomBarPlayState;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_UpdateBottomBarPlayButtonText) == 0x000001, "Wrong alignment on BacchusLobby_C_UpdateBottomBarPlayButtonText");
static_assert(sizeof(BacchusLobby_C_UpdateBottomBarPlayButtonText) == 0x000001, "Wrong size on BacchusLobby_C_UpdateBottomBarPlayButtonText");
static_assert(offsetof(BacchusLobby_C_UpdateBottomBarPlayButtonText, BottomBarPlayState) == 0x000000, "Member 'BacchusLobby_C_UpdateBottomBarPlayButtonText::BottomBarPlayState' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.UpdateBottomBarPlayButtonVisibility
// 0x0001 (0x0001 - 0x0000)
struct BacchusLobby_C_UpdateBottomBarPlayButtonVisibility final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BacchusLobby_C_UpdateBottomBarPlayButtonVisibility) == 0x000001, "Wrong alignment on BacchusLobby_C_UpdateBottomBarPlayButtonVisibility");
static_assert(sizeof(BacchusLobby_C_UpdateBottomBarPlayButtonVisibility) == 0x000001, "Wrong size on BacchusLobby_C_UpdateBottomBarPlayButtonVisibility");
static_assert(offsetof(BacchusLobby_C_UpdateBottomBarPlayButtonVisibility, IsVisible_0) == 0x000000, "Member 'BacchusLobby_C_UpdateBottomBarPlayButtonVisibility::IsVisible_0' has a wrong offset!");

// Function BacchusLobby.BacchusLobby_C.ExecuteUbergraph_BacchusLobby
// 0x03D8 (0x03D8 - 0x0000)
struct BacchusLobby_C_ExecuteUbergraph_BacchusLobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortLobbyType                                Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_UserWidget;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_2;                 // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_EnsureClientQuestLogin* CallFunc_SendEnsureClientQuestLogin_ReturnValue;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMVVMSubsystem*                         CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStoreToastRequest*                     K2Node_Event_StoreUpdatedRequest;                  // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBeginRequest_ReturnValue;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStoreCallout                          CallFunc_GetToast_ReturnValue;                     // 0x00A0(0x00A0)()
	bool                                          CallFunc_IsRequestReady_ReturnValue;               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortLobbyType                                K2Node_Event_LobbyType;                            // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortPlaylistAthena*              K2Node_Event_PlaylistData;                         // 0x0148(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NewGlyphs;                            // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaLobbyMatchmakingPlay_C*          K2Node_DynamicCast_AsAthena_Lobby_Matchmaking_Play; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPickerContext*                     CallFunc_GetContext_ReturnValue_3;                 // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasUnseenQuests;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UIKit_ButtonCTA_Base_C*            K2Node_DynamicCast_AsWBP_UIKit_Button_CTA_Base;    // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0188(0x0018)()
	ESlateVisibility                              K2Node_Event_NewVisibility;                        // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
