#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BacchusLobby

#include "Basic.hpp"

#include "EUI_Lobby_PlayButton_State_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BacchusLobby.BacchusLobby_C
// 0x0130 (0x0B88 - 0x0A58)
class UBacchusLobby_C final : public UAthenaLobbyBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortActivityViewModel*                 FortActivityViewModel;                             // 0x0A60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowHideMatchmaking;                          // 0x0A68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               CenterInfo;                                        // 0x0A70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderMOTD;                                  // 0x0A78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFeaturedCreativeContent_C*             FeaturedCreativeContent;                           // 0x0A80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel_MatcmakingWidget;                        // 0x0A88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchmakingRegionAndPool_C*            MatchmakingRegion;                                 // 0x0A90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMinimalTeamDisplay_C*                  MinimalTeamDisplay;                                // 0x0A98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              MMColumnSafeZone;                                  // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Expandables;                              // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SeasonColumn;                                      // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USqueegeeInjectionSlot_C*               SqueegeeSlot_RatingCard;                           // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFancyToastWidget_C*                    StoreToastWidget;                                  // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_HeroLevelRank;                                  // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_MOTD;                                  // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BottomBarDecoyButton_C*            WBP_BottomBarHack_BackToDiscover;                  // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BottomBarDecoyButton_C*            WBP_BottomBarHack_MMPlayOrCancel;                  // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Expandable_Level_C*                WBP_Expandable_Level;                              // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Expandable_Rank_C*                 WBP_Expandable_Rank;                               // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Expandable_SurvivorTier_C*         WBP_Expandable_SurvivorTier;                       // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreToastRequest*                     StoreToastRequest;                                 // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TryShowToast;                                      // 0x0B08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputAction_InspectChallenges;                     // 0x0B10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	EFrontEndCamera                               LastSavedCameraState;                              // 0x0B20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B21[0x7];                                      // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBacchusFrontend_C*                     BacchusFrontend;                                   // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPlayCancelButtonBeVisible;                      // 0x0B30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B31[0x7];                                      // 0x0B31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EUI_Lobby_PlayButton_State, struct FDataTableRowHandle> LobbyPlayCancelInputActions;                       // 0x0B38(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetPlayCancelAndBackButtonsVisible(bool ShouldPlayCancelButtonBeVisible);
	void OnActivityShouldShowIARCRatingChanged(bool bShouldShowIARCRating);
	void ShowAgeRating(bool bShouldShow);
	bool OnNavigateToRightContent();
	bool OnNavigateToLeftContent();
	class UWidget* HandleNavigateDownToDiscover(EUINavigation Navigation_0);
	class UWidget* HandleNavigateRightFromLeftContent(EUINavigation Navigation_0);
	class UWidget* HandleNavigateLeftFromRightContent(EUINavigation Navigation_0);
	void OnActivityAgeRatingChanged(bool HasAgeRating);
	void HandleLobbyColorSchemeChange(const struct FLinearColor& NewColorScheme, bool UseDefaultScheme);
	void ConfigureGenericLinkButton();
	void ShowPicker(EFortPickerMode Mode, int32 InitialOption, bool IgnoreFirstAccept);
	void StartAthenaLobbyMusic();
	void OnFailure_0A35369B446C50D49A1EED85729E9CF3();
	void OnSuccess_0A35369B446C50D49A1EED85729E9CF3();
	void OnComplete_BAD0F388436F1E67B83EC3AFC8BAC291(class UUserWidget* UserWidget);
	void DisplayStoreUpdated(class UStoreToastRequest* StoreUpdatedRequest);
	void AttemptToShowToast();
	void TryToastAgainNextFrame();
	void BndEvt__StoreToastWidget_K2Node_ComponentBoundEvent_2_OnFinishedToast__DelegateSignature();
	void OnPlaylistChanged(EFortLobbyType LobbyType, const class UFortPlaylistAthena* PlaylistData);
	void DisplayGlyphQuestUpdated(int32 NewGlyphs);
	void BP_OnDeactivated();
	void OnMatchmakingWidgetChanged();
	void HandleUnseenQuestsChanged(bool bHasUnseenQuests);
	void OnQuestsButtonVisibilityChanged(ESlateVisibility NewVisibility);
	void OnInitialized();
	void OnRankedProgressDisplayUpdated(const bool bPlayingRanked);
	void BndEvt__AthenaLobby_WBP_BottomBarDecoyButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void OnHomespaceTellLobbyToTransition(bool PlayVisible);
	void Show_Matchmaking_Region();
	void OnLobbyDataChanged(const struct FFrontendLobbyData& LobbyData);
	void OnLobbyDataCleared();
	void Construct();
	void BP_OnActivated();
	void BndEvt__AthenaLobby_WBP_BottomBarHack_MMPlayOrCancel_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void UpdateBottomBarPlayButtonText(EUI_Lobby_PlayButton_State BottomBarPlayState);
	void UpdateBottomBarPlayButtonVisibility(bool IsVisible_0);
	void ExecuteUbergraph_BacchusLobby(int32 EntryPoint);

	bool IsCancelCurrentAction() const;
	void IsNewMMFlow(bool* IsNewMMFlow_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BacchusLobby_C">();
	}
	static class UBacchusLobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusLobby_C>();
	}
};
static_assert(alignof(UBacchusLobby_C) == 0x000008, "Wrong alignment on UBacchusLobby_C");
static_assert(sizeof(UBacchusLobby_C) == 0x000B88, "Wrong size on UBacchusLobby_C");
static_assert(offsetof(UBacchusLobby_C, UberGraphFrame) == 0x000A58, "Member 'UBacchusLobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, FortActivityViewModel) == 0x000A60, "Member 'UBacchusLobby_C::FortActivityViewModel' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, Anim_ShowHideMatchmaking) == 0x000A68, "Member 'UBacchusLobby_C::Anim_ShowHideMatchmaking' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, CenterInfo) == 0x000A70, "Member 'UBacchusLobby_C::CenterInfo' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, CommonBorderMOTD) == 0x000A78, "Member 'UBacchusLobby_C::CommonBorderMOTD' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, FeaturedCreativeContent) == 0x000A80, "Member 'UBacchusLobby_C::FeaturedCreativeContent' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, GridPanel_MatcmakingWidget) == 0x000A88, "Member 'UBacchusLobby_C::GridPanel_MatcmakingWidget' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, MatchmakingRegion) == 0x000A90, "Member 'UBacchusLobby_C::MatchmakingRegion' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, MinimalTeamDisplay) == 0x000A98, "Member 'UBacchusLobby_C::MinimalTeamDisplay' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, MMColumnSafeZone) == 0x000AA0, "Member 'UBacchusLobby_C::MMColumnSafeZone' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, SafeZone_Expandables) == 0x000AA8, "Member 'UBacchusLobby_C::SafeZone_Expandables' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, SeasonColumn) == 0x000AB0, "Member 'UBacchusLobby_C::SeasonColumn' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, SqueegeeSlot_RatingCard) == 0x000AB8, "Member 'UBacchusLobby_C::SqueegeeSlot_RatingCard' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, StoreToastWidget) == 0x000AC0, "Member 'UBacchusLobby_C::StoreToastWidget' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, VB_HeroLevelRank) == 0x000AC8, "Member 'UBacchusLobby_C::VB_HeroLevelRank' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, VerticalBox_MOTD) == 0x000AD0, "Member 'UBacchusLobby_C::VerticalBox_MOTD' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, WBP_BottomBarHack_BackToDiscover) == 0x000AD8, "Member 'UBacchusLobby_C::WBP_BottomBarHack_BackToDiscover' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, WBP_BottomBarHack_MMPlayOrCancel) == 0x000AE0, "Member 'UBacchusLobby_C::WBP_BottomBarHack_MMPlayOrCancel' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, WBP_Expandable_Level) == 0x000AE8, "Member 'UBacchusLobby_C::WBP_Expandable_Level' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, WBP_Expandable_Rank) == 0x000AF0, "Member 'UBacchusLobby_C::WBP_Expandable_Rank' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, WBP_Expandable_SurvivorTier) == 0x000AF8, "Member 'UBacchusLobby_C::WBP_Expandable_SurvivorTier' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, StoreToastRequest) == 0x000B00, "Member 'UBacchusLobby_C::StoreToastRequest' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, TryShowToast) == 0x000B08, "Member 'UBacchusLobby_C::TryShowToast' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, InputAction_InspectChallenges) == 0x000B10, "Member 'UBacchusLobby_C::InputAction_InspectChallenges' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, LastSavedCameraState) == 0x000B20, "Member 'UBacchusLobby_C::LastSavedCameraState' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, BacchusFrontend) == 0x000B28, "Member 'UBacchusLobby_C::BacchusFrontend' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, CanPlayCancelButtonBeVisible) == 0x000B30, "Member 'UBacchusLobby_C::CanPlayCancelButtonBeVisible' has a wrong offset!");
static_assert(offsetof(UBacchusLobby_C, LobbyPlayCancelInputActions) == 0x000B38, "Member 'UBacchusLobby_C::LobbyPlayCancelInputActions' has a wrong offset!");

}

