#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassS29UI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "BattlePassS29UI_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BattlePassS29UI.BattlePassScreenS29.HandleClaimRewardComplete
// 0x0018 (0x0018 - 0x0000)
struct BattlePassScreenS29_HandleClaimRewardComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         OfferTemplateIdList;                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_HandleClaimRewardComplete) == 0x000008, "Wrong alignment on BattlePassScreenS29_HandleClaimRewardComplete");
static_assert(sizeof(BattlePassScreenS29_HandleClaimRewardComplete) == 0x000018, "Wrong size on BattlePassScreenS29_HandleClaimRewardComplete");
static_assert(offsetof(BattlePassScreenS29_HandleClaimRewardComplete, bSuccess) == 0x000000, "Member 'BattlePassScreenS29_HandleClaimRewardComplete::bSuccess' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_HandleClaimRewardComplete, OfferTemplateIdList) == 0x000008, "Member 'BattlePassScreenS29_HandleClaimRewardComplete::OfferTemplateIdList' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.HandleFullScreenMapToggled
// 0x0001 (0x0001 - 0x0000)
struct BattlePassScreenS29_HandleFullScreenMapToggled final
{
public:
	bool                                          bMapVisible;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_HandleFullScreenMapToggled) == 0x000001, "Wrong alignment on BattlePassScreenS29_HandleFullScreenMapToggled");
static_assert(sizeof(BattlePassScreenS29_HandleFullScreenMapToggled) == 0x000001, "Wrong size on BattlePassScreenS29_HandleFullScreenMapToggled");
static_assert(offsetof(BattlePassScreenS29_HandleFullScreenMapToggled, bMapVisible) == 0x000000, "Member 'BattlePassScreenS29_HandleFullScreenMapToggled::bMapVisible' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.HandleItemVMCardClicked
// 0x0010 (0x0010 - 0x0000)
struct BattlePassScreenS29_HandleItemVMCardClicked final
{
public:
	const class UFortItemVM*                      ItemVM;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAthenaSeasonItemEntryBase*       EntrySelected;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_HandleItemVMCardClicked) == 0x000008, "Wrong alignment on BattlePassScreenS29_HandleItemVMCardClicked");
static_assert(sizeof(BattlePassScreenS29_HandleItemVMCardClicked) == 0x000010, "Wrong size on BattlePassScreenS29_HandleItemVMCardClicked");
static_assert(offsetof(BattlePassScreenS29_HandleItemVMCardClicked, ItemVM) == 0x000000, "Member 'BattlePassScreenS29_HandleItemVMCardClicked::ItemVM' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_HandleItemVMCardClicked, EntrySelected) == 0x000008, "Member 'BattlePassScreenS29_HandleItemVMCardClicked::EntrySelected' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnBattlePassGiftingAllowed
// 0x0001 (0x0001 - 0x0000)
struct BattlePassScreenS29_OnBattlePassGiftingAllowed final
{
public:
	bool                                          bGiftingAllowed;                                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnBattlePassGiftingAllowed) == 0x000001, "Wrong alignment on BattlePassScreenS29_OnBattlePassGiftingAllowed");
static_assert(sizeof(BattlePassScreenS29_OnBattlePassGiftingAllowed) == 0x000001, "Wrong size on BattlePassScreenS29_OnBattlePassGiftingAllowed");
static_assert(offsetof(BattlePassScreenS29_OnBattlePassGiftingAllowed, bGiftingAllowed) == 0x000000, "Member 'BattlePassScreenS29_OnBattlePassGiftingAllowed::bGiftingAllowed' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnGameModeCompatibilityTagUpdate
// 0x0008 (0x0008 - 0x0000)
struct BattlePassScreenS29_OnGameModeCompatibilityTagUpdate final
{
public:
	const class UFortItemVM*                      FortItem;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnGameModeCompatibilityTagUpdate) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnGameModeCompatibilityTagUpdate");
static_assert(sizeof(BattlePassScreenS29_OnGameModeCompatibilityTagUpdate) == 0x000008, "Wrong size on BattlePassScreenS29_OnGameModeCompatibilityTagUpdate");
static_assert(offsetof(BattlePassScreenS29_OnGameModeCompatibilityTagUpdate, FortItem) == 0x000000, "Member 'BattlePassScreenS29_OnGameModeCompatibilityTagUpdate::FortItem' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnInsufficientFunds
// 0x0001 (0x0001 - 0x0000)
struct BattlePassScreenS29_OnInsufficientFunds final
{
public:
	EBattlePassCurrencyType                       CurrencyType;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnInsufficientFunds) == 0x000001, "Wrong alignment on BattlePassScreenS29_OnInsufficientFunds");
static_assert(sizeof(BattlePassScreenS29_OnInsufficientFunds) == 0x000001, "Wrong size on BattlePassScreenS29_OnInsufficientFunds");
static_assert(offsetof(BattlePassScreenS29_OnInsufficientFunds, CurrencyType) == 0x000000, "Member 'BattlePassScreenS29_OnInsufficientFunds::CurrencyType' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnInsufficientResource
// 0x0008 (0x0008 - 0x0000)
struct BattlePassScreenS29_OnInsufficientResource final
{
public:
	const class UFortPersistentResourceItemDefinition* PersistentResource;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnInsufficientResource) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnInsufficientResource");
static_assert(sizeof(BattlePassScreenS29_OnInsufficientResource) == 0x000008, "Wrong size on BattlePassScreenS29_OnInsufficientResource");
static_assert(offsetof(BattlePassScreenS29_OnInsufficientResource, PersistentResource) == 0x000000, "Member 'BattlePassScreenS29_OnInsufficientResource::PersistentResource' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnItemDelayed
// 0x0008 (0x0008 - 0x0000)
struct BattlePassScreenS29_OnItemDelayed final
{
public:
	struct FTimespan                              Delay;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnItemDelayed) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnItemDelayed");
static_assert(sizeof(BattlePassScreenS29_OnItemDelayed) == 0x000008, "Wrong size on BattlePassScreenS29_OnItemDelayed");
static_assert(offsetof(BattlePassScreenS29_OnItemDelayed, Delay) == 0x000000, "Member 'BattlePassScreenS29_OnItemDelayed::Delay' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnItemVmCardUpdate
// 0x0018 (0x0018 - 0x0000)
struct BattlePassScreenS29_OnItemVmCardUpdate final
{
public:
	struct FExpandedItemVM                        ItemVMs;                                           // 0x0000(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	const class UAthenaSeasonItemEntryBase*       EntrySelected;                                     // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnItemVmCardUpdate) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnItemVmCardUpdate");
static_assert(sizeof(BattlePassScreenS29_OnItemVmCardUpdate) == 0x000018, "Wrong size on BattlePassScreenS29_OnItemVmCardUpdate");
static_assert(offsetof(BattlePassScreenS29_OnItemVmCardUpdate, ItemVMs) == 0x000000, "Member 'BattlePassScreenS29_OnItemVmCardUpdate::ItemVMs' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnItemVmCardUpdate, EntrySelected) == 0x000010, "Member 'BattlePassScreenS29_OnItemVmCardUpdate::EntrySelected' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetBaseRewardsInfo
// 0x0010 (0x0010 - 0x0000)
struct BattlePassScreenS29_OnSetBaseRewardsInfo final
{
public:
	int32                                         OwnedRewards;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalRewards;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompletedPages;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalPages;                                        // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnSetBaseRewardsInfo) == 0x000004, "Wrong alignment on BattlePassScreenS29_OnSetBaseRewardsInfo");
static_assert(sizeof(BattlePassScreenS29_OnSetBaseRewardsInfo) == 0x000010, "Wrong size on BattlePassScreenS29_OnSetBaseRewardsInfo");
static_assert(offsetof(BattlePassScreenS29_OnSetBaseRewardsInfo, OwnedRewards) == 0x000000, "Member 'BattlePassScreenS29_OnSetBaseRewardsInfo::OwnedRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetBaseRewardsInfo, TotalRewards) == 0x000004, "Member 'BattlePassScreenS29_OnSetBaseRewardsInfo::TotalRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetBaseRewardsInfo, CompletedPages) == 0x000008, "Member 'BattlePassScreenS29_OnSetBaseRewardsInfo::CompletedPages' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetBaseRewardsInfo, TotalPages) == 0x00000C, "Member 'BattlePassScreenS29_OnSetBaseRewardsInfo::TotalPages' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetBonusInfo
// 0x0018 (0x0018 - 0x0000)
struct BattlePassScreenS29_OnSetBonusInfo final
{
public:
	struct FBonusInfoMiniTagData                  BonusInfo;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnSetBonusInfo) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnSetBonusInfo");
static_assert(sizeof(BattlePassScreenS29_OnSetBonusInfo) == 0x000018, "Wrong size on BattlePassScreenS29_OnSetBonusInfo");
static_assert(offsetof(BattlePassScreenS29_OnSetBonusInfo, BonusInfo) == 0x000000, "Member 'BattlePassScreenS29_OnSetBonusInfo::BonusInfo' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetBonusRewardsInfo
// 0x001C (0x001C - 0x0000)
struct BattlePassScreenS29_OnSetBonusRewardsInfo final
{
public:
	bool                                          bIsUnlocked;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OwnedRewards;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalRewards;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompletedPages;                                    // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalPages;                                        // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClaimedOutfits;                                    // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalOutfits;                                      // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnSetBonusRewardsInfo) == 0x000004, "Wrong alignment on BattlePassScreenS29_OnSetBonusRewardsInfo");
static_assert(sizeof(BattlePassScreenS29_OnSetBonusRewardsInfo) == 0x00001C, "Wrong size on BattlePassScreenS29_OnSetBonusRewardsInfo");
static_assert(offsetof(BattlePassScreenS29_OnSetBonusRewardsInfo, bIsUnlocked) == 0x000000, "Member 'BattlePassScreenS29_OnSetBonusRewardsInfo::bIsUnlocked' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetBonusRewardsInfo, OwnedRewards) == 0x000004, "Member 'BattlePassScreenS29_OnSetBonusRewardsInfo::OwnedRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetBonusRewardsInfo, TotalRewards) == 0x000008, "Member 'BattlePassScreenS29_OnSetBonusRewardsInfo::TotalRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetBonusRewardsInfo, CompletedPages) == 0x00000C, "Member 'BattlePassScreenS29_OnSetBonusRewardsInfo::CompletedPages' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetBonusRewardsInfo, TotalPages) == 0x000010, "Member 'BattlePassScreenS29_OnSetBonusRewardsInfo::TotalPages' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetBonusRewardsInfo, ClaimedOutfits) == 0x000014, "Member 'BattlePassScreenS29_OnSetBonusRewardsInfo::ClaimedOutfits' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetBonusRewardsInfo, TotalOutfits) == 0x000018, "Member 'BattlePassScreenS29_OnSetBonusRewardsInfo::TotalOutfits' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetCoverPageData
// 0x0038 (0x0038 - 0x0000)
struct BattlePassScreenS29_OnSetCoverPageData final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bPageComplete;                                     // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BattlePassScreenS29_OnSetCoverPageData) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnSetCoverPageData");
static_assert(sizeof(BattlePassScreenS29_OnSetCoverPageData) == 0x000038, "Wrong size on BattlePassScreenS29_OnSetCoverPageData");
static_assert(offsetof(BattlePassScreenS29_OnSetCoverPageData, Title) == 0x000000, "Member 'BattlePassScreenS29_OnSetCoverPageData::Title' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetCoverPageData, Description) == 0x000018, "Member 'BattlePassScreenS29_OnSetCoverPageData::Description' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetCoverPageData, bPageComplete) == 0x000030, "Member 'BattlePassScreenS29_OnSetCoverPageData::bPageComplete' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetCrewInfo
// 0x0058 (0x0058 - 0x0000)
struct BattlePassScreenS29_OnSetCrewInfo final
{
public:
	bool                                          bIsNextMonthRewards;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MonthText;                                         // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTimespan                              NextMonthlyRewardTimespan;                         // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CharacterDisplayName;                              // 0x0028(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   CharacterDescription;                              // 0x0040(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnSetCrewInfo) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnSetCrewInfo");
static_assert(sizeof(BattlePassScreenS29_OnSetCrewInfo) == 0x000058, "Wrong size on BattlePassScreenS29_OnSetCrewInfo");
static_assert(offsetof(BattlePassScreenS29_OnSetCrewInfo, bIsNextMonthRewards) == 0x000000, "Member 'BattlePassScreenS29_OnSetCrewInfo::bIsNextMonthRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetCrewInfo, MonthText) == 0x000008, "Member 'BattlePassScreenS29_OnSetCrewInfo::MonthText' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetCrewInfo, NextMonthlyRewardTimespan) == 0x000020, "Member 'BattlePassScreenS29_OnSetCrewInfo::NextMonthlyRewardTimespan' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetCrewInfo, CharacterDisplayName) == 0x000028, "Member 'BattlePassScreenS29_OnSetCrewInfo::CharacterDisplayName' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetCrewInfo, CharacterDescription) == 0x000040, "Member 'BattlePassScreenS29_OnSetCrewInfo::CharacterDescription' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetEquipButtonEnable
// 0x0001 (0x0001 - 0x0000)
struct BattlePassScreenS29_OnSetEquipButtonEnable final
{
public:
	bool                                          bIsEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnSetEquipButtonEnable) == 0x000001, "Wrong alignment on BattlePassScreenS29_OnSetEquipButtonEnable");
static_assert(sizeof(BattlePassScreenS29_OnSetEquipButtonEnable) == 0x000001, "Wrong size on BattlePassScreenS29_OnSetEquipButtonEnable");
static_assert(offsetof(BattlePassScreenS29_OnSetEquipButtonEnable, bIsEnable) == 0x000000, "Member 'BattlePassScreenS29_OnSetEquipButtonEnable::bIsEnable' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetItemPrice
// 0x0008 (0x0008 - 0x0000)
struct BattlePassScreenS29_OnSetItemPrice final
{
public:
	int32                                         Cost;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBattlePassCurrencyType                       CurrencyType;                                      // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BattlePassScreenS29_OnSetItemPrice) == 0x000004, "Wrong alignment on BattlePassScreenS29_OnSetItemPrice");
static_assert(sizeof(BattlePassScreenS29_OnSetItemPrice) == 0x000008, "Wrong size on BattlePassScreenS29_OnSetItemPrice");
static_assert(offsetof(BattlePassScreenS29_OnSetItemPrice, Cost) == 0x000000, "Member 'BattlePassScreenS29_OnSetItemPrice::Cost' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetItemPrice, CurrencyType) == 0x000004, "Member 'BattlePassScreenS29_OnSetItemPrice::CurrencyType' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetPrerequisiteInfo
// 0x0028 (0x0028 - 0x0000)
struct BattlePassScreenS29_OnSetPrerequisiteInfo final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         CurrentAmount;                                     // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NeededAmount;                                      // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBattlePassRewardPrerequisiteType             PrerequisiteType;                                  // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowPrerequisiteLock;                             // 0x0021(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BattlePassScreenS29_OnSetPrerequisiteInfo) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnSetPrerequisiteInfo");
static_assert(sizeof(BattlePassScreenS29_OnSetPrerequisiteInfo) == 0x000028, "Wrong size on BattlePassScreenS29_OnSetPrerequisiteInfo");
static_assert(offsetof(BattlePassScreenS29_OnSetPrerequisiteInfo, Description) == 0x000000, "Member 'BattlePassScreenS29_OnSetPrerequisiteInfo::Description' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetPrerequisiteInfo, CurrentAmount) == 0x000018, "Member 'BattlePassScreenS29_OnSetPrerequisiteInfo::CurrentAmount' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetPrerequisiteInfo, NeededAmount) == 0x00001C, "Member 'BattlePassScreenS29_OnSetPrerequisiteInfo::NeededAmount' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetPrerequisiteInfo, PrerequisiteType) == 0x000020, "Member 'BattlePassScreenS29_OnSetPrerequisiteInfo::PrerequisiteType' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetPrerequisiteInfo, bShowPrerequisiteLock) == 0x000021, "Member 'BattlePassScreenS29_OnSetPrerequisiteInfo::bShowPrerequisiteLock' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetQuestRewardsInfo
// 0x0018 (0x0018 - 0x0000)
struct BattlePassScreenS29_OnSetQuestRewardsInfo final
{
public:
	struct FTimespan                              DelayTimespan;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnedRewards;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalRewards;                                      // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompletedPages;                                    // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalPages;                                        // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnSetQuestRewardsInfo) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnSetQuestRewardsInfo");
static_assert(sizeof(BattlePassScreenS29_OnSetQuestRewardsInfo) == 0x000018, "Wrong size on BattlePassScreenS29_OnSetQuestRewardsInfo");
static_assert(offsetof(BattlePassScreenS29_OnSetQuestRewardsInfo, DelayTimespan) == 0x000000, "Member 'BattlePassScreenS29_OnSetQuestRewardsInfo::DelayTimespan' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetQuestRewardsInfo, OwnedRewards) == 0x000008, "Member 'BattlePassScreenS29_OnSetQuestRewardsInfo::OwnedRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetQuestRewardsInfo, TotalRewards) == 0x00000C, "Member 'BattlePassScreenS29_OnSetQuestRewardsInfo::TotalRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetQuestRewardsInfo, CompletedPages) == 0x000010, "Member 'BattlePassScreenS29_OnSetQuestRewardsInfo::CompletedPages' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetQuestRewardsInfo, TotalPages) == 0x000014, "Member 'BattlePassScreenS29_OnSetQuestRewardsInfo::TotalPages' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetResourcePrice
// 0x0010 (0x0010 - 0x0000)
struct BattlePassScreenS29_OnSetResourcePrice final
{
public:
	int32                                         Cost;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortPersistentResourceItemDefinition* PersistentResource;                                // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnSetResourcePrice) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnSetResourcePrice");
static_assert(sizeof(BattlePassScreenS29_OnSetResourcePrice) == 0x000010, "Wrong size on BattlePassScreenS29_OnSetResourcePrice");
static_assert(offsetof(BattlePassScreenS29_OnSetResourcePrice, Cost) == 0x000000, "Member 'BattlePassScreenS29_OnSetResourcePrice::Cost' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetResourcePrice, PersistentResource) == 0x000008, "Member 'BattlePassScreenS29_OnSetResourcePrice::PersistentResource' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetWarningToolTip
// 0x0020 (0x0020 - 0x0000)
struct BattlePassScreenS29_OnSetWarningToolTip final
{
public:
	ERewardWarningTooltipType29                   WarningTooltipType;                                // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnSetWarningToolTip) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnSetWarningToolTip");
static_assert(sizeof(BattlePassScreenS29_OnSetWarningToolTip) == 0x000020, "Wrong size on BattlePassScreenS29_OnSetWarningToolTip");
static_assert(offsetof(BattlePassScreenS29_OnSetWarningToolTip, WarningTooltipType) == 0x000000, "Member 'BattlePassScreenS29_OnSetWarningToolTip::WarningTooltipType' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetWarningToolTip, Description) == 0x000008, "Member 'BattlePassScreenS29_OnSetWarningToolTip::Description' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnSetWeeklyRewardsInfo
// 0x0020 (0x0020 - 0x0000)
struct BattlePassScreenS29_OnSetWeeklyRewardsInfo final
{
public:
	struct FTimespan                              DelayTimespan;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AvailableRewards;                                  // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnedRewards;                                      // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalRewards;                                      // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AvailablePages;                                    // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompletedPages;                                    // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalPages;                                        // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnSetWeeklyRewardsInfo) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnSetWeeklyRewardsInfo");
static_assert(sizeof(BattlePassScreenS29_OnSetWeeklyRewardsInfo) == 0x000020, "Wrong size on BattlePassScreenS29_OnSetWeeklyRewardsInfo");
static_assert(offsetof(BattlePassScreenS29_OnSetWeeklyRewardsInfo, DelayTimespan) == 0x000000, "Member 'BattlePassScreenS29_OnSetWeeklyRewardsInfo::DelayTimespan' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetWeeklyRewardsInfo, AvailableRewards) == 0x000008, "Member 'BattlePassScreenS29_OnSetWeeklyRewardsInfo::AvailableRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetWeeklyRewardsInfo, OwnedRewards) == 0x00000C, "Member 'BattlePassScreenS29_OnSetWeeklyRewardsInfo::OwnedRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetWeeklyRewardsInfo, TotalRewards) == 0x000010, "Member 'BattlePassScreenS29_OnSetWeeklyRewardsInfo::TotalRewards' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetWeeklyRewardsInfo, AvailablePages) == 0x000014, "Member 'BattlePassScreenS29_OnSetWeeklyRewardsInfo::AvailablePages' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetWeeklyRewardsInfo, CompletedPages) == 0x000018, "Member 'BattlePassScreenS29_OnSetWeeklyRewardsInfo::CompletedPages' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnSetWeeklyRewardsInfo, TotalPages) == 0x00001C, "Member 'BattlePassScreenS29_OnSetWeeklyRewardsInfo::TotalPages' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnTransitionItemDetails
// 0x0001 (0x0001 - 0x0000)
struct BattlePassScreenS29_OnTransitionItemDetails final
{
public:
	bool                                          bTransitionForward;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnTransitionItemDetails) == 0x000001, "Wrong alignment on BattlePassScreenS29_OnTransitionItemDetails");
static_assert(sizeof(BattlePassScreenS29_OnTransitionItemDetails) == 0x000001, "Wrong size on BattlePassScreenS29_OnTransitionItemDetails");
static_assert(offsetof(BattlePassScreenS29_OnTransitionItemDetails, bTransitionForward) == 0x000000, "Member 'BattlePassScreenS29_OnTransitionItemDetails::bTransitionForward' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnUpdateBattlePassRequiredBar
// 0x0001 (0x0001 - 0x0000)
struct BattlePassScreenS29_OnUpdateBattlePassRequiredBar final
{
public:
	bool                                          bPassRequiredVisible;                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnUpdateBattlePassRequiredBar) == 0x000001, "Wrong alignment on BattlePassScreenS29_OnUpdateBattlePassRequiredBar");
static_assert(sizeof(BattlePassScreenS29_OnUpdateBattlePassRequiredBar) == 0x000001, "Wrong size on BattlePassScreenS29_OnUpdateBattlePassRequiredBar");
static_assert(offsetof(BattlePassScreenS29_OnUpdateBattlePassRequiredBar, bPassRequiredVisible) == 0x000000, "Member 'BattlePassScreenS29_OnUpdateBattlePassRequiredBar::bPassRequiredVisible' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnUpdateOwnedOrEquippedTag
// 0x0018 (0x0018 - 0x0000)
struct BattlePassScreenS29_OnUpdateOwnedOrEquippedTag final
{
public:
	class FText                                   StatusText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_OnUpdateOwnedOrEquippedTag) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnUpdateOwnedOrEquippedTag");
static_assert(sizeof(BattlePassScreenS29_OnUpdateOwnedOrEquippedTag) == 0x000018, "Wrong size on BattlePassScreenS29_OnUpdateOwnedOrEquippedTag");
static_assert(offsetof(BattlePassScreenS29_OnUpdateOwnedOrEquippedTag, StatusText) == 0x000000, "Member 'BattlePassScreenS29_OnUpdateOwnedOrEquippedTag::StatusText' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.OnUpdateStatusBar
// 0x0020 (0x0020 - 0x0000)
struct BattlePassScreenS29_OnUpdateStatusBar final
{
public:
	class FText                                   StatusText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EBattlePassStatusBarTypeS29                   BarType;                                           // 0x0018(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BattlePassScreenS29_OnUpdateStatusBar) == 0x000008, "Wrong alignment on BattlePassScreenS29_OnUpdateStatusBar");
static_assert(sizeof(BattlePassScreenS29_OnUpdateStatusBar) == 0x000020, "Wrong size on BattlePassScreenS29_OnUpdateStatusBar");
static_assert(offsetof(BattlePassScreenS29_OnUpdateStatusBar, StatusText) == 0x000000, "Member 'BattlePassScreenS29_OnUpdateStatusBar::StatusText' has a wrong offset!");
static_assert(offsetof(BattlePassScreenS29_OnUpdateStatusBar, BarType) == 0x000018, "Member 'BattlePassScreenS29_OnUpdateStatusBar::BarType' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.GetEquipButtonEnable
// 0x0001 (0x0001 - 0x0000)
struct BattlePassScreenS29_GetEquipButtonEnable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_GetEquipButtonEnable) == 0x000001, "Wrong alignment on BattlePassScreenS29_GetEquipButtonEnable");
static_assert(sizeof(BattlePassScreenS29_GetEquipButtonEnable) == 0x000001, "Wrong size on BattlePassScreenS29_GetEquipButtonEnable");
static_assert(offsetof(BattlePassScreenS29_GetEquipButtonEnable, ReturnValue) == 0x000000, "Member 'BattlePassScreenS29_GetEquipButtonEnable::ReturnValue' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.GetQuestPageDelay
// 0x0008 (0x0008 - 0x0000)
struct BattlePassScreenS29_GetQuestPageDelay final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_GetQuestPageDelay) == 0x000008, "Wrong alignment on BattlePassScreenS29_GetQuestPageDelay");
static_assert(sizeof(BattlePassScreenS29_GetQuestPageDelay) == 0x000008, "Wrong size on BattlePassScreenS29_GetQuestPageDelay");
static_assert(offsetof(BattlePassScreenS29_GetQuestPageDelay, ReturnValue) == 0x000000, "Member 'BattlePassScreenS29_GetQuestPageDelay::ReturnValue' has a wrong offset!");

// Function BattlePassS29UI.BattlePassScreenS29.IsSeasonalCustomizationItemOwned
// 0x0001 (0x0001 - 0x0000)
struct BattlePassScreenS29_IsSeasonalCustomizationItemOwned final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassScreenS29_IsSeasonalCustomizationItemOwned) == 0x000001, "Wrong alignment on BattlePassScreenS29_IsSeasonalCustomizationItemOwned");
static_assert(sizeof(BattlePassScreenS29_IsSeasonalCustomizationItemOwned) == 0x000001, "Wrong size on BattlePassScreenS29_IsSeasonalCustomizationItemOwned");
static_assert(offsetof(BattlePassScreenS29_IsSeasonalCustomizationItemOwned, ReturnValue) == 0x000000, "Member 'BattlePassScreenS29_IsSeasonalCustomizationItemOwned::ReturnValue' has a wrong offset!");

// Function BattlePassS29UI.BattlePassLandingPageS29.OnBattlePassSubscriptionAllowed
// 0x0001 (0x0001 - 0x0000)
struct BattlePassLandingPageS29_OnBattlePassSubscriptionAllowed final
{
public:
	bool                                          bSubscriptionAllowed;                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassLandingPageS29_OnBattlePassSubscriptionAllowed) == 0x000001, "Wrong alignment on BattlePassLandingPageS29_OnBattlePassSubscriptionAllowed");
static_assert(sizeof(BattlePassLandingPageS29_OnBattlePassSubscriptionAllowed) == 0x000001, "Wrong size on BattlePassLandingPageS29_OnBattlePassSubscriptionAllowed");
static_assert(offsetof(BattlePassLandingPageS29_OnBattlePassSubscriptionAllowed, bSubscriptionAllowed) == 0x000000, "Member 'BattlePassLandingPageS29_OnBattlePassSubscriptionAllowed::bSubscriptionAllowed' has a wrong offset!");

// Function BattlePassS29UI.BattlePassRewardPageS29.HandleRewardTracksBoundaryNavigation
// 0x0010 (0x0010 - 0x0000)
struct BattlePassRewardPageS29_HandleRewardTracksBoundaryNavigation final
{
public:
	EUINavigation                                 InNavigation;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassRewardPageS29_HandleRewardTracksBoundaryNavigation) == 0x000008, "Wrong alignment on BattlePassRewardPageS29_HandleRewardTracksBoundaryNavigation");
static_assert(sizeof(BattlePassRewardPageS29_HandleRewardTracksBoundaryNavigation) == 0x000010, "Wrong size on BattlePassRewardPageS29_HandleRewardTracksBoundaryNavigation");
static_assert(offsetof(BattlePassRewardPageS29_HandleRewardTracksBoundaryNavigation, InNavigation) == 0x000000, "Member 'BattlePassRewardPageS29_HandleRewardTracksBoundaryNavigation::InNavigation' has a wrong offset!");
static_assert(offsetof(BattlePassRewardPageS29_HandleRewardTracksBoundaryNavigation, ReturnValue) == 0x000008, "Member 'BattlePassRewardPageS29_HandleRewardTracksBoundaryNavigation::ReturnValue' has a wrong offset!");

// Function BattlePassS29UI.BattlePassRewardPageS29.OnInitForPageType
// 0x0001 (0x0001 - 0x0000)
struct BattlePassRewardPageS29_OnInitForPageType final
{
public:
	ERewardPageType                               InRewardPageType;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassRewardPageS29_OnInitForPageType) == 0x000001, "Wrong alignment on BattlePassRewardPageS29_OnInitForPageType");
static_assert(sizeof(BattlePassRewardPageS29_OnInitForPageType) == 0x000001, "Wrong size on BattlePassRewardPageS29_OnInitForPageType");
static_assert(offsetof(BattlePassRewardPageS29_OnInitForPageType, InRewardPageType) == 0x000000, "Member 'BattlePassRewardPageS29_OnInitForPageType::InRewardPageType' has a wrong offset!");

// Function BattlePassS29UI.BattlePassRewardPageS29.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct BattlePassRewardPageS29_OnInputMethodChanged final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassRewardPageS29_OnInputMethodChanged) == 0x000001, "Wrong alignment on BattlePassRewardPageS29_OnInputMethodChanged");
static_assert(sizeof(BattlePassRewardPageS29_OnInputMethodChanged) == 0x000001, "Wrong size on BattlePassRewardPageS29_OnInputMethodChanged");
static_assert(offsetof(BattlePassRewardPageS29_OnInputMethodChanged, InputType) == 0x000000, "Member 'BattlePassRewardPageS29_OnInputMethodChanged::InputType' has a wrong offset!");

// Function BattlePassS29UI.BattlePassRewardPageS29.OnLoadingScreenSelectedChanged
// 0x0001 (0x0001 - 0x0000)
struct BattlePassRewardPageS29_OnLoadingScreenSelectedChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassRewardPageS29_OnLoadingScreenSelectedChanged) == 0x000001, "Wrong alignment on BattlePassRewardPageS29_OnLoadingScreenSelectedChanged");
static_assert(sizeof(BattlePassRewardPageS29_OnLoadingScreenSelectedChanged) == 0x000001, "Wrong size on BattlePassRewardPageS29_OnLoadingScreenSelectedChanged");
static_assert(offsetof(BattlePassRewardPageS29_OnLoadingScreenSelectedChanged, bIsSelected) == 0x000000, "Member 'BattlePassRewardPageS29_OnLoadingScreenSelectedChanged::bIsSelected' has a wrong offset!");

// Function BattlePassS29UI.BattlePassRewardPageS29.OnPageChanged
// 0x0008 (0x0008 - 0x0000)
struct BattlePassRewardPageS29_OnPageChanged final
{
public:
	int32                                         PageNumber;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RewardPageTotal;                                   // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassRewardPageS29_OnPageChanged) == 0x000004, "Wrong alignment on BattlePassRewardPageS29_OnPageChanged");
static_assert(sizeof(BattlePassRewardPageS29_OnPageChanged) == 0x000008, "Wrong size on BattlePassRewardPageS29_OnPageChanged");
static_assert(offsetof(BattlePassRewardPageS29_OnPageChanged, PageNumber) == 0x000000, "Member 'BattlePassRewardPageS29_OnPageChanged::PageNumber' has a wrong offset!");
static_assert(offsetof(BattlePassRewardPageS29_OnPageChanged, RewardPageTotal) == 0x000004, "Member 'BattlePassRewardPageS29_OnPageChanged::RewardPageTotal' has a wrong offset!");

// Function BattlePassS29UI.BattlePassRewardPageS29.GetRewardPageBackgroundData
// 0x0058 (0x0058 - 0x0000)
struct BattlePassRewardPageS29_GetRewardPageBackgroundData final
{
public:
	struct FVaultWorldBackgroundData              ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePassRewardPageS29_GetRewardPageBackgroundData) == 0x000008, "Wrong alignment on BattlePassRewardPageS29_GetRewardPageBackgroundData");
static_assert(sizeof(BattlePassRewardPageS29_GetRewardPageBackgroundData) == 0x000058, "Wrong size on BattlePassRewardPageS29_GetRewardPageBackgroundData");
static_assert(offsetof(BattlePassRewardPageS29_GetRewardPageBackgroundData, ReturnValue) == 0x000000, "Member 'BattlePassRewardPageS29_GetRewardPageBackgroundData::ReturnValue' has a wrong offset!");

// Function BattlePassS29UI.FortBattlePassResourcesWidgetS29.OnBattleStarRewardsSet
// 0x0004 (0x0004 - 0x0000)
struct FortBattlePassResourcesWidgetS29_OnBattleStarRewardsSet final
{
public:
	int32                                         Rewards;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortBattlePassResourcesWidgetS29_OnBattleStarRewardsSet) == 0x000004, "Wrong alignment on FortBattlePassResourcesWidgetS29_OnBattleStarRewardsSet");
static_assert(sizeof(FortBattlePassResourcesWidgetS29_OnBattleStarRewardsSet) == 0x000004, "Wrong size on FortBattlePassResourcesWidgetS29_OnBattleStarRewardsSet");
static_assert(offsetof(FortBattlePassResourcesWidgetS29_OnBattleStarRewardsSet, Rewards) == 0x000000, "Member 'FortBattlePassResourcesWidgetS29_OnBattleStarRewardsSet::Rewards' has a wrong offset!");

// Function BattlePassS29UI.FortBattlePassResourcesWidgetS29.OnStylePointsRewardsSet
// 0x0004 (0x0004 - 0x0000)
struct FortBattlePassResourcesWidgetS29_OnStylePointsRewardsSet final
{
public:
	int32                                         Rewards;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortBattlePassResourcesWidgetS29_OnStylePointsRewardsSet) == 0x000004, "Wrong alignment on FortBattlePassResourcesWidgetS29_OnStylePointsRewardsSet");
static_assert(sizeof(FortBattlePassResourcesWidgetS29_OnStylePointsRewardsSet) == 0x000004, "Wrong size on FortBattlePassResourcesWidgetS29_OnStylePointsRewardsSet");
static_assert(offsetof(FortBattlePassResourcesWidgetS29_OnStylePointsRewardsSet, Rewards) == 0x000000, "Member 'FortBattlePassResourcesWidgetS29_OnStylePointsRewardsSet::Rewards' has a wrong offset!");

// Function BattlePassS29UI.FortBattlePassTutorialTooltipS29.SetText
// 0x0018 (0x0018 - 0x0000)
struct FortBattlePassTutorialTooltipS29_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortBattlePassTutorialTooltipS29_SetText) == 0x000008, "Wrong alignment on FortBattlePassTutorialTooltipS29_SetText");
static_assert(sizeof(FortBattlePassTutorialTooltipS29_SetText) == 0x000018, "Wrong size on FortBattlePassTutorialTooltipS29_SetText");
static_assert(offsetof(FortBattlePassTutorialTooltipS29_SetText, Text) == 0x000000, "Member 'FortBattlePassTutorialTooltipS29_SetText::Text' has a wrong offset!");

}

