#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BotController_NPC_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_BotController_NPC_Base.BP_BotController_NPC_Base_C.AddPatrollingGE
// 0x0018 (0x0018 - 0x0000)
struct BP_BotController_NPC_Base_C_AddPatrollingGE final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotController_NPC_Base_C_AddPatrollingGE) == 0x000008, "Wrong alignment on BP_BotController_NPC_Base_C_AddPatrollingGE");
static_assert(sizeof(BP_BotController_NPC_Base_C_AddPatrollingGE) == 0x000018, "Wrong size on BP_BotController_NPC_Base_C_AddPatrollingGE");
static_assert(offsetof(BP_BotController_NPC_Base_C_AddPatrollingGE, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'BP_BotController_NPC_Base_C_AddPatrollingGE::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotController_NPC_Base_C_AddPatrollingGE, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_BotController_NPC_Base_C_AddPatrollingGE::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotController_NPC_Base_C_AddPatrollingGE, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'BP_BotController_NPC_Base_C_AddPatrollingGE::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BotController_NPC_Base_C_AddPatrollingGE, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00000C, "Member 'BP_BotController_NPC_Base_C_AddPatrollingGE::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function BP_BotController_NPC_Base.BP_BotController_NPC_Base_C.ExecuteUbergraph_BP_BotController_NPC_Base
// 0x0008 (0x0008 - 0x0000)
struct BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base) == 0x000004, "Wrong alignment on BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base");
static_assert(sizeof(BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base) == 0x000008, "Wrong size on BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base");
static_assert(offsetof(BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base, EntryPoint) == 0x000000, "Member 'BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_BotController_NPC_Base_C_ExecuteUbergraph_BP_BotController_NPC_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_BotController_NPC_Base.BP_BotController_NPC_Base_C.RemovePatrollingGE
// 0x0010 (0x0010 - 0x0000)
struct BP_BotController_NPC_Base_C_RemovePatrollingGE final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BotController_NPC_Base_C_RemovePatrollingGE) == 0x000008, "Wrong alignment on BP_BotController_NPC_Base_C_RemovePatrollingGE");
static_assert(sizeof(BP_BotController_NPC_Base_C_RemovePatrollingGE) == 0x000010, "Wrong size on BP_BotController_NPC_Base_C_RemovePatrollingGE");
static_assert(offsetof(BP_BotController_NPC_Base_C_RemovePatrollingGE, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'BP_BotController_NPC_Base_C_RemovePatrollingGE::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotController_NPC_Base_C_RemovePatrollingGE, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_BotController_NPC_Base_C_RemovePatrollingGE::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotController_NPC_Base_C_RemovePatrollingGE, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000009, "Member 'BP_BotController_NPC_Base_C_RemovePatrollingGE::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BotController_NPC_Base_C_RemovePatrollingGE, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'BP_BotController_NPC_Base_C_RemovePatrollingGE::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

