#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS29_WarningTooltip

#include "Basic.hpp"

#include "BattlePassS29UI_structs.hpp"


namespace SDK::Params
{

// Function BPS29_WarningTooltip.BPS29_WarningTooltip_C.ExecuteUbergraph_BPS29_WarningTooltip
// 0x0028 (0x0028 - 0x0000)
struct BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardWarningTooltipType29                   K2Node_CustomEvent_EWarningPopup;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_CustomText;                     // 0x0008(0x0018)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip) == 0x000008, "Wrong alignment on BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip");
static_assert(sizeof(BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip) == 0x000028, "Wrong size on BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip");
static_assert(offsetof(BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip, EntryPoint) == 0x000000, "Member 'BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip, K2Node_CustomEvent_EWarningPopup) == 0x000004, "Member 'BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip::K2Node_CustomEvent_EWarningPopup' has a wrong offset!");
static_assert(offsetof(BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip, K2Node_CustomEvent_CustomText) == 0x000008, "Member 'BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip::K2Node_CustomEvent_CustomText' has a wrong offset!");
static_assert(offsetof(BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BPS29_WarningTooltip_C_ExecuteUbergraph_BPS29_WarningTooltip::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPS29_WarningTooltip.BPS29_WarningTooltip_C.PrepareWidget
// 0x0020 (0x0020 - 0x0000)
struct BPS29_WarningTooltip_C_PrepareWidget final
{
public:
	ERewardWarningTooltipType29                   EWarningPopup;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CustomText_0;                                      // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPS29_WarningTooltip_C_PrepareWidget) == 0x000008, "Wrong alignment on BPS29_WarningTooltip_C_PrepareWidget");
static_assert(sizeof(BPS29_WarningTooltip_C_PrepareWidget) == 0x000020, "Wrong size on BPS29_WarningTooltip_C_PrepareWidget");
static_assert(offsetof(BPS29_WarningTooltip_C_PrepareWidget, EWarningPopup) == 0x000000, "Member 'BPS29_WarningTooltip_C_PrepareWidget::EWarningPopup' has a wrong offset!");
static_assert(offsetof(BPS29_WarningTooltip_C_PrepareWidget, CustomText_0) == 0x000008, "Member 'BPS29_WarningTooltip_C_PrepareWidget::CustomText_0' has a wrong offset!");

}

