#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicMinusTeamMics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Cinematic-TeamMics.Cinematic-TeamMics_C
// 0x0278 (0x0560 - 0x02E8)
class UCinematicMinusTeamMics_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMicIndicator_C*                        MicIndicator;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            SwitcherConnectingStranger;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_6;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPlayerName;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    MemberInfo;                                        // 0x0310(0x0250)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CinematicMinusTeamMics(int32 EntryPoint);
	void Update(const struct FFortTeamMemberInfo& UpdatedMemberInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cinematic-TeamMics_C">();
	}
	static class UCinematicMinusTeamMics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCinematicMinusTeamMics_C>();
	}
};
static_assert(alignof(UCinematicMinusTeamMics_C) == 0x000010, "Wrong alignment on UCinematicMinusTeamMics_C");
static_assert(sizeof(UCinematicMinusTeamMics_C) == 0x000560, "Wrong size on UCinematicMinusTeamMics_C");
static_assert(offsetof(UCinematicMinusTeamMics_C, UberGraphFrame) == 0x0002E8, "Member 'UCinematicMinusTeamMics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, MicIndicator) == 0x0002F0, "Member 'UCinematicMinusTeamMics_C::MicIndicator' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, SwitcherConnectingStranger) == 0x0002F8, "Member 'UCinematicMinusTeamMics_C::SwitcherConnectingStranger' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, TextBlock_6) == 0x000300, "Member 'UCinematicMinusTeamMics_C::TextBlock_6' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, TextPlayerName) == 0x000308, "Member 'UCinematicMinusTeamMics_C::TextPlayerName' has a wrong offset!");
static_assert(offsetof(UCinematicMinusTeamMics_C, MemberInfo) == 0x000310, "Member 'UCinematicMinusTeamMics_C::MemberInfo' has a wrong offset!");

}

