#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CloseButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CloseButton.CloseButton_C
// 0x0060 (0x1550 - 0x14F0)
class UCloseButton_C final : public UBacchusCloseButton
{
public:
	class UBorder*                                Border_Container;                                  // 0x14F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x14F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Control;                                   // 0x1500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ButtonAction;                                 // 0x1508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_Description;                                // 0x1510(0x0018)(Edit, BlueprintVisible)
	bool                                          FontSizeOveride;                                   // 0x1528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1529[0x3];                                     // 0x1529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x152C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Padding_Overide;                                   // 0x1530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PaddingOveride;                                    // 0x1540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void HandleSize();
	void SetText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CloseButton_C">();
	}
	static class UCloseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCloseButton_C>();
	}
};
static_assert(alignof(UCloseButton_C) == 0x000010, "Wrong alignment on UCloseButton_C");
static_assert(sizeof(UCloseButton_C) == 0x001550, "Wrong size on UCloseButton_C");
static_assert(offsetof(UCloseButton_C, Border_Container) == 0x0014F0, "Member 'UCloseButton_C::Border_Container' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, CloseIcon) == 0x0014F8, "Member 'UCloseButton_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, SizeBox_Control) == 0x001500, "Member 'UCloseButton_C::SizeBox_Control' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Text_ButtonAction) == 0x001508, "Member 'UCloseButton_C::Text_ButtonAction' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Button_Description) == 0x001510, "Member 'UCloseButton_C::Button_Description' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, FontSizeOveride) == 0x001528, "Member 'UCloseButton_C::FontSizeOveride' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, FontSize) == 0x00152C, "Member 'UCloseButton_C::FontSize' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, Padding_Overide) == 0x001530, "Member 'UCloseButton_C::Padding_Overide' has a wrong offset!");
static_assert(offsetof(UCloseButton_C, PaddingOveride) == 0x001540, "Member 'UCloseButton_C::PaddingOveride' has a wrong offset!");

}

