#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Entity_0_classes.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseUI_0_structs.hpp"
#include "VerseColors_structs.hpp"


namespace SDK
{

// VerseClass Component.Component_light_entity_component
// 0x0020 (0x00D8 - 0x00B8)
class UComponent_light_entity_component : public UEntity_component
{
public:
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component_light_entity_component">();
	}
	static class UComponent_light_entity_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_light_entity_component>();
	}
};
static_assert(alignof(UComponent_light_entity_component) == 0x000008, "Wrong alignment on UComponent_light_entity_component");
static_assert(sizeof(UComponent_light_entity_component) == 0x0000D8, "Wrong size on UComponent_light_entity_component");

// VerseClass Component.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class Component_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass Component.$SolarisSignatureFunctionOuter", true>();
	}
	static class Component_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<Component_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(Component_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on Component_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(Component_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on Component_0::U_SolarisSignatureFunctionOuter");

// VerseClass Component.Component_mesh_component
// 0x0018 (0x00D0 - 0x00B8)
class UComponent_mesh_component : public UEntity_component
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component_mesh_component">();
	}
	static class UComponent_mesh_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_mesh_component>();
	}
};
static_assert(alignof(UComponent_mesh_component) == 0x000008, "Wrong alignment on UComponent_mesh_component");
static_assert(sizeof(UComponent_mesh_component) == 0x0000D0, "Wrong size on UComponent_mesh_component");

// VerseClass Component.Component
// 0x0000 (0x0028 - 0x0028)
class UComponent final : public UObject
{
public:
	static struct FComponent_hit_result Component_hit_result_Factory();
	static struct FComponent_hit_result Component_hit_result_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component">();
	}
	static class UComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent>();
	}
};
static_assert(alignof(UComponent) == 0x000008, "Wrong alignment on UComponent");
static_assert(sizeof(UComponent) == 0x000028, "Wrong size on UComponent");

// VerseClass Component.Component_attachment_component
// 0x0138 (0x01F0 - 0x00B8)
class UComponent_attachment_component final : public UEntity_component
{
public:
	FVerseFunctionProperty_                       __verse_0xC8656958__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFC1FA7EB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x72231FFE__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCB558A13__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4E118BAE__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAF7F413E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         __verse_0x1AEA3A6F_AutoAttachToOwner : 1;          // 0x0118(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_transform>      __verse_0xDF51C8D3_RelativeTransform;              // 0x0120(0x0070)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference)
	TOptional<class UEntity_entity*, true>        __verse_0x1F66826C_ParentEntity;                   // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_198[0x58];                                     // 0x0198(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R(const struct FTuple_Lentity_Mtransform_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R(class UEntity_entity* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_transform> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component_attachment_component">();
	}
	static class UComponent_attachment_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_attachment_component>();
	}
};
static_assert(alignof(UComponent_attachment_component) == 0x000010, "Wrong alignment on UComponent_attachment_component");
static_assert(sizeof(UComponent_attachment_component) == 0x0001F0, "Wrong size on UComponent_attachment_component");
static_assert(offsetof(UComponent_attachment_component, __verse_0xC8656958__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R) == 0x0000B8, "Member 'UComponent_attachment_component::__verse_0xC8656958__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R' has a wrong offset!");
static_assert(offsetof(UComponent_attachment_component, __verse_0xFC1FA7EB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R) == 0x0000C8, "Member 'UComponent_attachment_component::__verse_0xFC1FA7EB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R' has a wrong offset!");
static_assert(offsetof(UComponent_attachment_component, __verse_0x72231FFE__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom) == 0x0000D8, "Member 'UComponent_attachment_component::__verse_0x72231FFE__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom' has a wrong offset!");
static_assert(offsetof(UComponent_attachment_component, __verse_0xCB558A13__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R) == 0x0000E8, "Member 'UComponent_attachment_component::__verse_0xCB558A13__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R' has a wrong offset!");
static_assert(offsetof(UComponent_attachment_component, __verse_0x4E118BAE__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R) == 0x0000F8, "Member 'UComponent_attachment_component::__verse_0x4E118BAE__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R' has a wrong offset!");
static_assert(offsetof(UComponent_attachment_component, __verse_0xAF7F413E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform) == 0x000108, "Member 'UComponent_attachment_component::__verse_0xAF7F413E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform' has a wrong offset!");
static_assert(offsetof(UComponent_attachment_component, __verse_0xDF51C8D3_RelativeTransform) == 0x000120, "Member 'UComponent_attachment_component::__verse_0xDF51C8D3_RelativeTransform' has a wrong offset!");
static_assert(offsetof(UComponent_attachment_component, __verse_0x1F66826C_ParentEntity) == 0x000190, "Member 'UComponent_attachment_component::__verse_0x1F66826C_ParentEntity' has a wrong offset!");

// VerseClass Component.Component_camera_entity_component
// 0x00F8 (0x01B0 - 0x00B8)
class UComponent_camera_entity_component final : public UEntity_component
{
public:
	FVerseFunctionProperty_                       __verse_0xD506504F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetFieldOfView_L_Nfloat_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4901A925__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA4DCB9EB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD1A25B1D__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateFieldOfView; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x09BDC6B6__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetAspectRatio_L_Nfloat_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x471B9641__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAAC6868F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDFB86479__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateAspectRatio; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4133B7A6__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetIsActive_L_Nlogic_R; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x893FA230__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE5F1CC3F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive; // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAB45C758__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateIsActive; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	double                                        __verse_0xE317D65E_FieldOfView;                    // 0x0178(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xED0DE93A_AspectRatio;                    // 0x0180(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x84F9DFC3_IsActive : 1;                   // 0x0188(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_189[0x27];                                     // 0x0189(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetAspectRatio_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetFieldOfView_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetIsActive_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateAspectRatio(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateFieldOfView(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateIsActive(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RBeginPlay(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component_camera_entity_component">();
	}
	static class UComponent_camera_entity_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_camera_entity_component>();
	}
};
static_assert(alignof(UComponent_camera_entity_component) == 0x000008, "Wrong alignment on UComponent_camera_entity_component");
static_assert(sizeof(UComponent_camera_entity_component) == 0x0001B0, "Wrong size on UComponent_camera_entity_component");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0xD506504F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetFieldOfView_L_Nfloat_R) == 0x0000B8, "Member 'UComponent_camera_entity_component::__verse_0xD506504F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetFieldOfView_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0x4901A925__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView) == 0x0000C8, "Member 'UComponent_camera_entity_component::__verse_0x4901A925__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0xA4DCB9EB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView) == 0x0000D8, "Member 'UComponent_camera_entity_component::__verse_0xA4DCB9EB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0xD1A25B1D__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateFieldOfView) == 0x0000E8, "Member 'UComponent_camera_entity_component::__verse_0xD1A25B1D__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateFieldOfView' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0x09BDC6B6__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetAspectRatio_L_Nfloat_R) == 0x0000F8, "Member 'UComponent_camera_entity_component::__verse_0x09BDC6B6__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetAspectRatio_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0x471B9641__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio) == 0x000108, "Member 'UComponent_camera_entity_component::__verse_0x471B9641__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0xAAC6868F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio) == 0x000118, "Member 'UComponent_camera_entity_component::__verse_0xAAC6868F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0xDFB86479__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateAspectRatio) == 0x000128, "Member 'UComponent_camera_entity_component::__verse_0xDFB86479__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateAspectRatio' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0x4133B7A6__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetIsActive_L_Nlogic_R) == 0x000138, "Member 'UComponent_camera_entity_component::__verse_0x4133B7A6__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetIsActive_L_Nlogic_R' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0x893FA230__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive) == 0x000148, "Member 'UComponent_camera_entity_component::__verse_0x893FA230__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0xE5F1CC3F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive) == 0x000158, "Member 'UComponent_camera_entity_component::__verse_0xE5F1CC3F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0xAB45C758__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateIsActive) == 0x000168, "Member 'UComponent_camera_entity_component::__verse_0xAB45C758__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RUpdateIsActive' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0xE317D65E_FieldOfView) == 0x000178, "Member 'UComponent_camera_entity_component::__verse_0xE317D65E_FieldOfView' has a wrong offset!");
static_assert(offsetof(UComponent_camera_entity_component, __verse_0xED0DE93A_AspectRatio) == 0x000180, "Member 'UComponent_camera_entity_component::__verse_0xED0DE93A_AspectRatio' has a wrong offset!");

// VerseClass Component.Component_local_hud_component
// 0x0050 (0x0108 - 0x00B8)
class UComponent_local_hud_component final : public UEntity_component
{
public:
	class UUI_canvas*                             __verse_0x89A21F20_Canvas;                         // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUI_player_ui_slot                     __verse_0xF1214EFE_UISlot;                         // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	TArray<class USimulation_player*>             __verse_0x76952CF9_ShowingPlayerUI;                // 0x00D0(0x0010)(InstancedReference, ContainsInstancedReference)
	uint8                                         __verse_0x6B820C00_IsSimulating : 1;               // 0x00E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       __verse_0xFD1D3118__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2flocal__hud__component_N_RHide_L_Nplayer_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF1E3D897__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2flocal__hud__component_N_RShow_L_Nplayer_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2flocal__hud__component_N_RHide_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2flocal__hud__component_N_RShow_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RBeginPlay(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_REndPlay(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component_local_hud_component">();
	}
	static class UComponent_local_hud_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_local_hud_component>();
	}
};
static_assert(alignof(UComponent_local_hud_component) == 0x000008, "Wrong alignment on UComponent_local_hud_component");
static_assert(sizeof(UComponent_local_hud_component) == 0x000108, "Wrong size on UComponent_local_hud_component");
static_assert(offsetof(UComponent_local_hud_component, __verse_0x89A21F20_Canvas) == 0x0000B8, "Member 'UComponent_local_hud_component::__verse_0x89A21F20_Canvas' has a wrong offset!");
static_assert(offsetof(UComponent_local_hud_component, __verse_0xF1214EFE_UISlot) == 0x0000C0, "Member 'UComponent_local_hud_component::__verse_0xF1214EFE_UISlot' has a wrong offset!");
static_assert(offsetof(UComponent_local_hud_component, __verse_0x76952CF9_ShowingPlayerUI) == 0x0000D0, "Member 'UComponent_local_hud_component::__verse_0x76952CF9_ShowingPlayerUI' has a wrong offset!");
static_assert(offsetof(UComponent_local_hud_component, __verse_0xFD1D3118__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2flocal__hud__component_N_RHide_L_Nplayer_R) == 0x0000E8, "Member 'UComponent_local_hud_component::__verse_0xFD1D3118__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2flocal__hud__component_N_RHide_L_Nplayer_R' has a wrong offset!");
static_assert(offsetof(UComponent_local_hud_component, __verse_0xF1E3D897__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2flocal__hud__component_N_RShow_L_Nplayer_R) == 0x0000F8, "Member 'UComponent_local_hud_component::__verse_0xF1E3D897__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2flocal__hud__component_N_RShow_L_Nplayer_R' has a wrong offset!");

// VerseClass Component.Component_particle_system_component
// 0x00A0 (0x0158 - 0x00B8)
class UComponent_particle_system_component final : public UEntity_component
{
public:
	FVerseFunctionProperty_                       __verse_0xBDD7337E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_RActivate; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5CD3D543__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_RDeactivate; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3D627375__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_ROnRep__bIsActive; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB17CC116__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_ROnRep__ParticleSystem; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<class UAssets_particle_system*, true> __verse_0x1CB585BF_ParticleSystem;                 // 0x00F8(0x0008)(Net, ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x9CF6E76B_bIsActive : 1;                  // 0x0120(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_120_1 : 7;                                  // 0x0120(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x0121(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_122[0x36];                                     // 0x0122(0x0036)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_RActivate(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_RDeactivate(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_ROnRep__bIsActive(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_ROnRep__ParticleSystem(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component_particle_system_component">();
	}
	static class UComponent_particle_system_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_particle_system_component>();
	}
};
static_assert(alignof(UComponent_particle_system_component) == 0x000008, "Wrong alignment on UComponent_particle_system_component");
static_assert(sizeof(UComponent_particle_system_component) == 0x000158, "Wrong size on UComponent_particle_system_component");
static_assert(offsetof(UComponent_particle_system_component, __verse_0xBDD7337E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_RActivate) == 0x0000B8, "Member 'UComponent_particle_system_component::__verse_0xBDD7337E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_RActivate' has a wrong offset!");
static_assert(offsetof(UComponent_particle_system_component, __verse_0x5CD3D543__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_RDeactivate) == 0x0000C8, "Member 'UComponent_particle_system_component::__verse_0x5CD3D543__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_RDeactivate' has a wrong offset!");
static_assert(offsetof(UComponent_particle_system_component, __verse_0x3D627375__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_ROnRep__bIsActive) == 0x0000D8, "Member 'UComponent_particle_system_component::__verse_0x3D627375__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_ROnRep__bIsActive' has a wrong offset!");
static_assert(offsetof(UComponent_particle_system_component, __verse_0xB17CC116__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_ROnRep__ParticleSystem) == 0x0000E8, "Member 'UComponent_particle_system_component::__verse_0xB17CC116__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fparticle__system__component_N_ROnRep__ParticleSystem' has a wrong offset!");
static_assert(offsetof(UComponent_particle_system_component, __verse_0x1CB585BF_ParticleSystem) == 0x0000F8, "Member 'UComponent_particle_system_component::__verse_0x1CB585BF_ParticleSystem' has a wrong offset!");

// VerseClass Component.Component_physics_component
// 0x0030 (0x00E8 - 0x00B8)
class UComponent_physics_component final : public UEntity_component
{
public:
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x00C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_C9[0x17];                                      // 0x00C9(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x4BFA8E15_HitEvent;                       // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component_physics_component">();
	}
	static class UComponent_physics_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_physics_component>();
	}
};
static_assert(alignof(UComponent_physics_component) == 0x000008, "Wrong alignment on UComponent_physics_component");
static_assert(sizeof(UComponent_physics_component) == 0x0000E8, "Wrong size on UComponent_physics_component");
static_assert(offsetof(UComponent_physics_component, __verse_0x4BFA8E15_HitEvent) == 0x0000E0, "Member 'UComponent_physics_component::__verse_0x4BFA8E15_HitEvent' has a wrong offset!");

// VerseClass Component.Component_point_light_entity_component
// 0x0180 (0x0258 - 0x00D8)
class UComponent_point_light_entity_component final : public UComponent_light_entity_component
{
public:
	FVerseFunctionProperty_                       __verse_0x7549C9C7__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetIntensity_L_Nfloat_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3B1D5A6A__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetColor_L_Ncolor_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCD1C1060__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetSourceRadius_L_Nfloat_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8248FCB5__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetSourceLength_L_Nfloat_R; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4EBC1D5D__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetAttenuationRadius_L_Nfloat_R; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC5865D9C__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetIntensity; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA018248B__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetColor; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5398D82E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetSourceRadius; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEBDB5E2B__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetSourceLength; // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x247ECFF9__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetAttenuationRadius; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x644E803F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__Intensity; // 0x0178(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF936B2EF__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__Color; // 0x0188(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC11727A1__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__SourceRadius; // 0x0198(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7954A1A4__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__SourceLength; // 0x01A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA383CA8C__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__AttenuationRadius; // 0x01B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE0FEC0DB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateIntensity; // 0x01C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x337BF0C2__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateColor; // 0x01D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9AEA0D64__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateSourceRadius; // 0x01E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x22A98B61__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateSourceLength; // 0x01F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9EC5D5E2__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateAttenuationRadius; // 0x0208(0x0010)(InstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x06B3E864_Intensity;                      // 0x0218(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x65678AC7_Color;                          // 0x0220(0x0018)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	double                                        __verse_0x12542E15_SourceRadius;                   // 0x0238(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xAA17A810_SourceLength;                   // 0x0240(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xBAB0877B_AttenuationRadius;              // 0x0248(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_250[0x8];                                      // 0x0250(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetAttenuationRadius(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FColors_color _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetColor(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetIntensity(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetSourceLength(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetSourceRadius(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__AttenuationRadius(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__Color(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__Intensity(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__SourceLength(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__SourceRadius(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetAttenuationRadius_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetColor_L_Ncolor_R(const struct FColors_color& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetIntensity_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetSourceLength_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetSourceRadius_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateAttenuationRadius(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateColor(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateIntensity(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateSourceLength(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateSourceRadius(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component_point_light_entity_component">();
	}
	static class UComponent_point_light_entity_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_point_light_entity_component>();
	}
};
static_assert(alignof(UComponent_point_light_entity_component) == 0x000008, "Wrong alignment on UComponent_point_light_entity_component");
static_assert(sizeof(UComponent_point_light_entity_component) == 0x000258, "Wrong size on UComponent_point_light_entity_component");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x7549C9C7__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetIntensity_L_Nfloat_R) == 0x0000D8, "Member 'UComponent_point_light_entity_component::__verse_0x7549C9C7__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetIntensity_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x3B1D5A6A__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetColor_L_Ncolor_R) == 0x0000E8, "Member 'UComponent_point_light_entity_component::__verse_0x3B1D5A6A__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetColor_L_Ncolor_R' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xCD1C1060__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetSourceRadius_L_Nfloat_R) == 0x0000F8, "Member 'UComponent_point_light_entity_component::__verse_0xCD1C1060__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetSourceRadius_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x8248FCB5__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetSourceLength_L_Nfloat_R) == 0x000108, "Member 'UComponent_point_light_entity_component::__verse_0x8248FCB5__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetSourceLength_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x4EBC1D5D__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetAttenuationRadius_L_Nfloat_R) == 0x000118, "Member 'UComponent_point_light_entity_component::__verse_0x4EBC1D5D__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RSetAttenuationRadius_L_Nfloat_R' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xC5865D9C__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetIntensity) == 0x000128, "Member 'UComponent_point_light_entity_component::__verse_0xC5865D9C__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetIntensity' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xA018248B__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetColor) == 0x000138, "Member 'UComponent_point_light_entity_component::__verse_0xA018248B__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetColor' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x5398D82E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetSourceRadius) == 0x000148, "Member 'UComponent_point_light_entity_component::__verse_0x5398D82E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetSourceRadius' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xEBDB5E2B__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetSourceLength) == 0x000158, "Member 'UComponent_point_light_entity_component::__verse_0xEBDB5E2B__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetSourceLength' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x247ECFF9__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetAttenuationRadius) == 0x000168, "Member 'UComponent_point_light_entity_component::__verse_0x247ECFF9__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RGetAttenuationRadius' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x644E803F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__Intensity) == 0x000178, "Member 'UComponent_point_light_entity_component::__verse_0x644E803F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__Intensity' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xF936B2EF__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__Color) == 0x000188, "Member 'UComponent_point_light_entity_component::__verse_0xF936B2EF__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__Color' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xC11727A1__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__SourceRadius) == 0x000198, "Member 'UComponent_point_light_entity_component::__verse_0xC11727A1__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__SourceRadius' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x7954A1A4__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__SourceLength) == 0x0001A8, "Member 'UComponent_point_light_entity_component::__verse_0x7954A1A4__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__SourceLength' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xA383CA8C__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__AttenuationRadius) == 0x0001B8, "Member 'UComponent_point_light_entity_component::__verse_0xA383CA8C__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_ROnRep__AttenuationRadius' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xE0FEC0DB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateIntensity) == 0x0001C8, "Member 'UComponent_point_light_entity_component::__verse_0xE0FEC0DB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateIntensity' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x337BF0C2__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateColor) == 0x0001D8, "Member 'UComponent_point_light_entity_component::__verse_0x337BF0C2__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateColor' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x9AEA0D64__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateSourceRadius) == 0x0001E8, "Member 'UComponent_point_light_entity_component::__verse_0x9AEA0D64__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateSourceRadius' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x22A98B61__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateSourceLength) == 0x0001F8, "Member 'UComponent_point_light_entity_component::__verse_0x22A98B61__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateSourceLength' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x9EC5D5E2__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateAttenuationRadius) == 0x000208, "Member 'UComponent_point_light_entity_component::__verse_0x9EC5D5E2__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fpoint__light__entity__component_N_RUpdateAttenuationRadius' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x06B3E864_Intensity) == 0x000218, "Member 'UComponent_point_light_entity_component::__verse_0x06B3E864_Intensity' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x65678AC7_Color) == 0x000220, "Member 'UComponent_point_light_entity_component::__verse_0x65678AC7_Color' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0x12542E15_SourceRadius) == 0x000238, "Member 'UComponent_point_light_entity_component::__verse_0x12542E15_SourceRadius' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xAA17A810_SourceLength) == 0x000240, "Member 'UComponent_point_light_entity_component::__verse_0xAA17A810_SourceLength' has a wrong offset!");
static_assert(offsetof(UComponent_point_light_entity_component, __verse_0xBAB0877B_AttenuationRadius) == 0x000248, "Member 'UComponent_point_light_entity_component::__verse_0xBAB0877B_AttenuationRadius' has a wrong offset!");

// VerseClass Component.Component_sound_component
// 0x00A8 (0x0160 - 0x00B8)
class UComponent_sound_component final : public UEntity_component
{
public:
	FVerseFunctionProperty_                       __verse_0x32B30A09__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fsound__component_N_RPlay; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7AC15442__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fsound__component_N_RStop; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xADEC461E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fsound__component_N_ROnRep__StartCounter; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x071BEA02__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fsound__component_N_ROnRep__Sound; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_sound*                          __verse_0xF013250F_Sound;                          // 0x00F8(0x0008)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x0120(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x38C2642B_StartCounter;                   // 0x0128(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_130[0x30];                                     // 0x0130(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fsound__component_N_ROnRep__Sound(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fsound__component_N_ROnRep__StartCounter(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fsound__component_N_RPlay(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fsound__component_N_RStop(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize(const struct Component_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component_sound_component">();
	}
	static class UComponent_sound_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent_sound_component>();
	}
};
