#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component_0

#include "Basic.hpp"

#include "EpicGamesTemporary_structs.hpp"
#include "VerseUI_0_structs.hpp"


namespace SDK
{

// VerseStruct Component.Component_hit_result
// 0x0050 (0x0050 - 0x0000)
struct FComponent_hit_result final
{
public:
	TOptional<class UEntity_entity*, true>        __verse_0x9C8E9A95_ThisEntity;                     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UComponent_physics_component*, true> __verse_0x0170A73A_ThisComponent;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntity_entity*, true>        __verse_0x9E548E88_OtherEntity;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UComponent_physics_component*, true> __verse_0x15DAA648_OtherComponent;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xA0175DA6_HitNormal;                      // 0x0020(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xE16733E1_HitLocation;                    // 0x0038(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FComponent_hit_result) == 0x000008, "Wrong alignment on FComponent_hit_result");
static_assert(sizeof(FComponent_hit_result) == 0x000050, "Wrong size on FComponent_hit_result");
static_assert(offsetof(FComponent_hit_result, __verse_0x9C8E9A95_ThisEntity) == 0x000000, "Member 'FComponent_hit_result::__verse_0x9C8E9A95_ThisEntity' has a wrong offset!");
static_assert(offsetof(FComponent_hit_result, __verse_0x0170A73A_ThisComponent) == 0x000008, "Member 'FComponent_hit_result::__verse_0x0170A73A_ThisComponent' has a wrong offset!");
static_assert(offsetof(FComponent_hit_result, __verse_0x9E548E88_OtherEntity) == 0x000010, "Member 'FComponent_hit_result::__verse_0x9E548E88_OtherEntity' has a wrong offset!");
static_assert(offsetof(FComponent_hit_result, __verse_0x15DAA648_OtherComponent) == 0x000018, "Member 'FComponent_hit_result::__verse_0x15DAA648_OtherComponent' has a wrong offset!");
static_assert(offsetof(FComponent_hit_result, __verse_0xA0175DA6_HitNormal) == 0x000020, "Member 'FComponent_hit_result::__verse_0xA0175DA6_HitNormal' has a wrong offset!");
static_assert(offsetof(FComponent_hit_result, __verse_0xE16733E1_HitLocation) == 0x000038, "Member 'FComponent_hit_result::__verse_0xE16733E1_HitLocation' has a wrong offset!");

// VerseStruct Component.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct Component_0::FTuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Component_0::FTuple_L_R) == 0x000001, "Wrong alignment on Component_0::FTuple_L_R");
static_assert(sizeof(Component_0::FTuple_L_R) == 0x000001, "Wrong size on Component_0::FTuple_L_R");
static_assert(offsetof(Component_0::FTuple_L_R, _StructPaddingDummy) == 0x000000, "Member 'Component_0::FTuple_L_R::_StructPaddingDummy' has a wrong offset!");

// VerseStruct Component.tuple_L_Kany_Mtuple_L_R_Many_R
// 0x0028 (0x0028 - 0x0000)
struct Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Component_0::FTuple_L_R                __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R) == 0x000008, "Wrong alignment on Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R");
static_assert(sizeof(Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R) == 0x000028, "Wrong size on Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R");
static_assert(offsetof(Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R, __verse_0x7D844C3C_Elem1) == 0x000010, "Member 'Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R, __verse_0x932BF92E_Elem2) == 0x000018, "Member 'Component_0::FTuple_L_Kany_Mtuple_L_R_Many_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// VerseStruct Component.tuple_L_Kany_Mtuple_L_R_Mint_R
// 0x0020 (0x0020 - 0x0000)
struct Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R final
{
public:
	TArray<FVerseDynamicProperty_>                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, ContainsInstancedReference)
	struct Component_0::FTuple_L_R                __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R) == 0x000008, "Wrong alignment on Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R");
static_assert(sizeof(Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R) == 0x000020, "Wrong size on Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R");
static_assert(offsetof(Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R, __verse_0x7D844C3C_Elem1) == 0x000010, "Member 'Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R, __verse_0x932BF92E_Elem2) == 0x000018, "Member 'Component_0::FTuple_L_Kany_Mtuple_L_R_Mint_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// VerseStruct Component.tuple_Lcanvas_Mplayer__ui__slot_R
// 0x0018 (0x0018 - 0x0000)
struct FTuple_Lcanvas_Mplayer__ui__slot_R final
{
public:
	class UUI_canvas*                             __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUI_player_ui_slot                     __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FTuple_Lcanvas_Mplayer__ui__slot_R) == 0x000008, "Wrong alignment on FTuple_Lcanvas_Mplayer__ui__slot_R");
static_assert(sizeof(FTuple_Lcanvas_Mplayer__ui__slot_R) == 0x000018, "Wrong size on FTuple_Lcanvas_Mplayer__ui__slot_R");
static_assert(offsetof(FTuple_Lcanvas_Mplayer__ui__slot_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'FTuple_Lcanvas_Mplayer__ui__slot_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(FTuple_Lcanvas_Mplayer__ui__slot_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'FTuple_Lcanvas_Mplayer__ui__slot_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// VerseStruct Component.tuple_Lentity_Mtransform_R
// 0x0070 (0x0070 - 0x0000)
struct FTuple_Lentity_Mtransform_R final
{
public:
	class UEntity_entity*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0060)(InstancedReference, NoDestructor)
};
static_assert(alignof(FTuple_Lentity_Mtransform_R) == 0x000010, "Wrong alignment on FTuple_Lentity_Mtransform_R");
static_assert(sizeof(FTuple_Lentity_Mtransform_R) == 0x000070, "Wrong size on FTuple_Lentity_Mtransform_R");
static_assert(offsetof(FTuple_Lentity_Mtransform_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'FTuple_Lentity_Mtransform_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(FTuple_Lentity_Mtransform_R, __verse_0x7D844C3C_Elem1) == 0x000010, "Member 'FTuple_Lentity_Mtransform_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// VerseStruct Component.tuple_Lwidget_Mplayer__ui__slot_R
// 0x0018 (0x0018 - 0x0000)
struct Component_0::FTuple_Lwidget_Mplayer__ui__slot_R final
{
public:
	class UUI_widget*                             __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUI_player_ui_slot                     __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Component_0::FTuple_Lwidget_Mplayer__ui__slot_R) == 0x000008, "Wrong alignment on Component_0::FTuple_Lwidget_Mplayer__ui__slot_R");
static_assert(sizeof(Component_0::FTuple_Lwidget_Mplayer__ui__slot_R) == 0x000018, "Wrong size on Component_0::FTuple_Lwidget_Mplayer__ui__slot_R");
static_assert(offsetof(Component_0::FTuple_Lwidget_Mplayer__ui__slot_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'Component_0::FTuple_Lwidget_Mplayer__ui__slot_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(Component_0::FTuple_Lwidget_Mplayer__ui__slot_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'Component_0::FTuple_Lwidget_Mplayer__ui__slot_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

}

