#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component_0

#include "Basic.hpp"

#include "Component_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseColors_structs.hpp"


namespace SDK::Params
{

// Function Component.Component_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize) == 0x000001, "Wrong alignment on Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize");
static_assert(sizeof(Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize) == 0x000001, "Wrong size on Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize");
static_assert(offsetof(Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function Component.Component_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient) == 0x000001, "Wrong alignment on Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient");
static_assert(sizeof(Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient) == 0x000002, "Wrong size on Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient");
static_assert(offsetof(Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function Component.Component_light_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize) == 0x000001, "Wrong alignment on Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize");
static_assert(sizeof(Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize) == 0x000001, "Wrong size on Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize");
static_assert(offsetof(Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_light_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function Component.Component_mesh_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Component_mesh_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Component_mesh_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient) == 0x000001, "Wrong alignment on Component_mesh_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient");
static_assert(sizeof(Component_mesh_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient) == 0x000002, "Wrong size on Component_mesh_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient");
static_assert(offsetof(Component_mesh_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_mesh_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function Component.Component.Component_hit_result$Factory
// 0x0050 (0x0050 - 0x0000)
struct Component_Component_hit_result_Factory final
{
public:
	struct FComponent_hit_result                  RetVal;                                            // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(Component_Component_hit_result_Factory) == 0x000008, "Wrong alignment on Component_Component_hit_result_Factory");
static_assert(sizeof(Component_Component_hit_result_Factory) == 0x000050, "Wrong size on Component_Component_hit_result_Factory");
static_assert(offsetof(Component_Component_hit_result_Factory, RetVal) == 0x000000, "Member 'Component_Component_hit_result_Factory::RetVal' has a wrong offset!");

// Function Component.Component.Component_hit_result$OverrideFactory
// 0x00A0 (0x00A0 - 0x0000)
struct Component_Component_hit_result_OverrideFactory final
{
public:
	struct FComponent_hit_result                  RetVal;                                            // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0050(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};
static_assert(alignof(Component_Component_hit_result_OverrideFactory) == 0x000008, "Wrong alignment on Component_Component_hit_result_OverrideFactory");
static_assert(sizeof(Component_Component_hit_result_OverrideFactory) == 0x0000A0, "Wrong size on Component_Component_hit_result_OverrideFactory");
static_assert(offsetof(Component_Component_hit_result_OverrideFactory, RetVal) == 0x000000, "Member 'Component_Component_hit_result_OverrideFactory::RetVal' has a wrong offset!");
static_assert(offsetof(Component_Component_hit_result_OverrideFactory, __verse_0xFB48ED96__InitOverrideMap) == 0x000050, "Member 'Component_Component_hit_result_OverrideFactory::__verse_0xFB48ED96__InitOverrideMap' has a wrong offset!");

// Function Component.Component_attachment_component.$InitCDO
// 0x0120 (0x0120 - 0x0000)
struct Component_attachment_component__InitCDO final
{
public:
	TOptional<struct FSpatialMath_transform>      _ExprResult_0;                                     // 0x0000(0x0070)(ZeroConstructor, NoDestructor)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0070(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_1 : 1;                                 // 0x0072(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_2;                                // 0x0073(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UEntity_entity*, true>        _ExprResult_3;                                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0080(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0082(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_5;                                // 0x0083(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0xB];                                       // 0x0085(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_transform>      _ExprResult_6;                                     // 0x0090(0x0070)(ZeroConstructor, NoDestructor)
	TOptional<EVerseFalse>                        __verse_0x00000000__5;                             // 0x0100(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_7 : 1;                                 // 0x0102(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_8;                                // 0x0103(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UEntity_entity*, true>        _ExprResult_9;                                     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__7;                             // 0x0110(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_10 : 1;                                // 0x0112(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_11;                               // 0x0113(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Component_attachment_component__InitCDO) == 0x000010, "Wrong alignment on Component_attachment_component__InitCDO");
static_assert(sizeof(Component_attachment_component__InitCDO) == 0x000120, "Wrong size on Component_attachment_component__InitCDO");
static_assert(offsetof(Component_attachment_component__InitCDO, _ExprResult_0) == 0x000000, "Member 'Component_attachment_component__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, __verse_0x00000000__1) == 0x000070, "Member 'Component_attachment_component__InitCDO::__verse_0x00000000__1' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, _ExprResultStack_2) == 0x000073, "Member 'Component_attachment_component__InitCDO::_ExprResultStack_2' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, _ExprResult_3) == 0x000078, "Member 'Component_attachment_component__InitCDO::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, __verse_0x00000000__3) == 0x000080, "Member 'Component_attachment_component__InitCDO::__verse_0x00000000__3' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, _ExprResultStack_5) == 0x000083, "Member 'Component_attachment_component__InitCDO::_ExprResultStack_5' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, _ExprResult_6) == 0x000090, "Member 'Component_attachment_component__InitCDO::_ExprResult_6' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, __verse_0x00000000__5) == 0x000100, "Member 'Component_attachment_component__InitCDO::__verse_0x00000000__5' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, _ExprResultStack_8) == 0x000103, "Member 'Component_attachment_component__InitCDO::_ExprResultStack_8' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, _ExprResult_9) == 0x000108, "Member 'Component_attachment_component__InitCDO::_ExprResult_9' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, __verse_0x00000000__7) == 0x000110, "Member 'Component_attachment_component__InitCDO::__verse_0x00000000__7' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__InitCDO, _ExprResultStack_11) == 0x000113, "Member 'Component_attachment_component__InitCDO::_ExprResultStack_11' has a wrong offset!");

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R
// 0x0080 (0x0080 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R final
{
public:
	struct FTuple_Lentity_Mtransform_R            __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0070)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0070(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R) == 0x000010, "Wrong alignment on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R");
static_assert(sizeof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R) == 0x000080, "Wrong size on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R, RetVal) == 0x000070, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R::RetVal' has a wrong offset!");

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R
// 0x0010 (0x0010 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R final
{
public:
	class UEntity_entity*                         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0008(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R) == 0x000008, "Wrong alignment on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R");
static_assert(sizeof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R) == 0x000010, "Wrong size on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R, RetVal) == 0x000008, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RAttachTo_L_Nentity_R::RetVal' has a wrong offset!");

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom
// 0x0003 (0x0003 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom) == 0x000001, "Wrong alignment on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom");
static_assert(sizeof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom) == 0x000003, "Wrong size on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom, RetVal) == 0x000001, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RDetachFrom::RetVal' has a wrong offset!");

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform
// 0x0080 (0x0080 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_transform>      RetVal;                                            // 0x0010(0x0070)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};
static_assert(alignof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform) == 0x000010, "Wrong alignment on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform");
static_assert(sizeof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform) == 0x000080, "Wrong size on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform, RetVal) == 0x000010, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RGetAttachedTransform::RetVal' has a wrong offset!");

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R
// 0x0070 (0x0070 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R final
{
public:
	struct FSpatialMath_transform                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0060)(Parm, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0060(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R) == 0x000010, "Wrong alignment on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R");
static_assert(sizeof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R) == 0x000070, "Wrong size on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R, RetVal) == 0x000060, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R::RetVal' has a wrong offset!");

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R
// 0x0070 (0x0070 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R final
{
public:
	struct FSpatialMath_transform                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0060)(Parm, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0060(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R) == 0x000010, "Wrong alignment on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R");
static_assert(sizeof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R) == 0x000070, "Wrong size on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R, RetVal) == 0x000060, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R::RetVal' has a wrong offset!");

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize) == 0x000001, "Wrong alignment on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize");
static_assert(sizeof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize) == 0x000001, "Wrong size on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient) == 0x000001, "Wrong alignment on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient");
static_assert(sizeof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient) == 0x000002, "Wrong size on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function Component.Component_attachment_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize
// 0x0001 (0x0001 - 0x0000)
struct Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
};
static_assert(alignof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize) == 0x000001, "Wrong alignment on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize");
static_assert(sizeof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize) == 0x000001, "Wrong size on Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize");
static_assert(offsetof(Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_attachment_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize::__verse_0xB2CDDD72_Argument' has a wrong offset!");

// Function Component.Component_camera_entity_component.$InitCDO
// 0x0030 (0x0030 - 0x0000)
struct Component_camera_entity_component__InitCDO final
{
public:
	double                                        _ExprResult_0;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_1;                                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_2 : 1;                                 // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        _ExprResult_3;                                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResult_4;                                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_5 : 1;                                 // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(Component_camera_entity_component__InitCDO) == 0x000008, "Wrong alignment on Component_camera_entity_component__InitCDO");
static_assert(sizeof(Component_camera_entity_component__InitCDO) == 0x000030, "Wrong size on Component_camera_entity_component__InitCDO");
static_assert(offsetof(Component_camera_entity_component__InitCDO, _ExprResult_0) == 0x000000, "Member 'Component_camera_entity_component__InitCDO::_ExprResult_0' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__InitCDO, _ExprResult_1) == 0x000008, "Member 'Component_camera_entity_component__InitCDO::_ExprResult_1' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__InitCDO, _ExprResult_3) == 0x000018, "Member 'Component_camera_entity_component__InitCDO::_ExprResult_3' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__InitCDO, _ExprResult_4) == 0x000020, "Member 'Component_camera_entity_component__InitCDO::_ExprResult_4' has a wrong offset!");

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio
// 0x0020 (0x0020 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UComponent_camera_entity_component*     _TEMP_0;                                           // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComponent_camera_entity_component*     _TEMP_1;                                           // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio) == 0x000008, "Wrong alignment on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio");
static_assert(sizeof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio) == 0x000020, "Wrong size on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio, RetVal) == 0x000008, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio::RetVal' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio, _TEMP_0) == 0x000010, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio::_TEMP_0' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio, _TEMP_1) == 0x000018, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetAspectRatio::_TEMP_1' has a wrong offset!");

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView
// 0x0020 (0x0020 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UComponent_camera_entity_component*     _TEMP_0;                                           // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComponent_camera_entity_component*     _TEMP_1;                                           // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView) == 0x000008, "Wrong alignment on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView");
static_assert(sizeof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView) == 0x000020, "Wrong size on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView, RetVal) == 0x000008, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView::RetVal' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView, _TEMP_0) == 0x000010, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView::_TEMP_0' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView, _TEMP_1) == 0x000018, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetFieldOfView::_TEMP_1' has a wrong offset!");

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive
// 0x0018 (0x0018 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UComponent_camera_entity_component*     _TEMP_0;                                           // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComponent_camera_entity_component*     _TEMP_1;                                           // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive) == 0x000008, "Wrong alignment on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive");
static_assert(sizeof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive) == 0x000018, "Wrong size on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive, _TEMP_0) == 0x000008, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive::_TEMP_0' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive, _TEMP_1) == 0x000010, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RGetIsActive::_TEMP_1' has a wrong offset!");

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio
// 0x0038 (0x0038 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::FTuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::FTuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
static_assert(alignof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio) == 0x000008, "Wrong alignment on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio");
static_assert(sizeof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio) == 0x000038, "Wrong size on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio, _InvokeSureResultDummy_0) == 0x000001, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio::_InvokeSureResultDummy_0' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio, _Callee_1) == 0x000008, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio::_Callee_1' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio, _ExprResult_2) == 0x000018, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio, _InvokeSureResultDummy_3) == 0x000019, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio::_InvokeSureResultDummy_3' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio, _Callee_4) == 0x000020, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio::_Callee_4' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio, _ExprResult_5) == 0x000030, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__AspectRatio::_ExprResult_5' has a wrong offset!");

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView
// 0x0038 (0x0038 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::FTuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::FTuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
static_assert(alignof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView) == 0x000008, "Wrong alignment on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView");
static_assert(sizeof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView) == 0x000038, "Wrong size on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView, _InvokeSureResultDummy_0) == 0x000001, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView::_InvokeSureResultDummy_0' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView, _Callee_1) == 0x000008, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView::_Callee_1' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView, _ExprResult_2) == 0x000018, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView, _InvokeSureResultDummy_3) == 0x000019, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView::_InvokeSureResultDummy_3' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView, _Callee_4) == 0x000020, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView::_Callee_4' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView, _ExprResult_5) == 0x000030, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__FieldOfView::_ExprResult_5' has a wrong offset!");

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive
// 0x0038 (0x0038 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive final
{
public:
	struct Component_0::FTuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct Component_0::FTuple_L_R                _ExprResult_2;                                     // 0x0018(0x0001)(HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct Component_0::FTuple_L_R                _ExprResult_5;                                     // 0x0030(0x0001)(HasGetValueTypeHash)
};
static_assert(alignof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive) == 0x000008, "Wrong alignment on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive");
static_assert(sizeof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive) == 0x000038, "Wrong size on Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive, __verse_0xB2CDDD72_Argument) == 0x000000, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive::__verse_0xB2CDDD72_Argument' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive, _InvokeSureResultDummy_0) == 0x000001, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive::_InvokeSureResultDummy_0' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive, _Callee_1) == 0x000008, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive::_Callee_1' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive, _ExprResult_2) == 0x000018, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive::_ExprResult_2' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive, _InvokeSureResultDummy_3) == 0x000019, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive::_InvokeSureResultDummy_3' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive, _Callee_4) == 0x000020, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive::_Callee_4' has a wrong offset!");
static_assert(offsetof(Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive, _ExprResult_5) == 0x000030, "Member 'Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_ROnRep__IsActive::_ExprResult_5' has a wrong offset!");

// Function Component.Component_camera_entity_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetAspectRatio_L_Nfloat_R
// 0x0068 (0x0068 - 0x0000)
struct Component_camera_entity_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fComponent_2fcamera__entity__component_N_RSetAspectRatio_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UComponent_camera_entity_component*     _TEMP_0;                                           // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
