#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_HUDController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function CRD_HUDController.CustomHUDLayoutComponent.GetTargetWidgetClassFromTag
// 0x0028 (0x0028 - 0x0000)
struct CustomHUDLayoutComponent_GetTargetWidgetClassFromTag final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomHUDLayoutComponent_GetTargetWidgetClassFromTag) == 0x000008, "Wrong alignment on CustomHUDLayoutComponent_GetTargetWidgetClassFromTag");
static_assert(sizeof(CustomHUDLayoutComponent_GetTargetWidgetClassFromTag) == 0x000028, "Wrong size on CustomHUDLayoutComponent_GetTargetWidgetClassFromTag");
static_assert(offsetof(CustomHUDLayoutComponent_GetTargetWidgetClassFromTag, GameplayTag) == 0x000000, "Member 'CustomHUDLayoutComponent_GetTargetWidgetClassFromTag::GameplayTag' has a wrong offset!");
static_assert(offsetof(CustomHUDLayoutComponent_GetTargetWidgetClassFromTag, ReturnValue) == 0x000008, "Member 'CustomHUDLayoutComponent_GetTargetWidgetClassFromTag::ReturnValue' has a wrong offset!");

// Function CRD_HUDController.CustomHUDLayoutComponent.HandleTeamIndexChanged
// 0x0001 (0x0001 - 0x0000)
struct CustomHUDLayoutComponent_HandleTeamIndexChanged final
{
public:
	uint8                                         TeamIndex;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomHUDLayoutComponent_HandleTeamIndexChanged) == 0x000001, "Wrong alignment on CustomHUDLayoutComponent_HandleTeamIndexChanged");
static_assert(sizeof(CustomHUDLayoutComponent_HandleTeamIndexChanged) == 0x000001, "Wrong size on CustomHUDLayoutComponent_HandleTeamIndexChanged");
static_assert(offsetof(CustomHUDLayoutComponent_HandleTeamIndexChanged, TeamIndex) == 0x000000, "Member 'CustomHUDLayoutComponent_HandleTeamIndexChanged::TeamIndex' has a wrong offset!");

// Function CRD_HUDController.CustomHUDLayoutComponent.PlayerPreRemoved
// 0x0038 (0x0038 - 0x0000)
struct CustomHUDLayoutComponent_PlayerPreRemoved final
{
public:
	struct FUniqueNetIdRepl                       UniqueNetId;                                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayer;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomHUDLayoutComponent_PlayerPreRemoved) == 0x000008, "Wrong alignment on CustomHUDLayoutComponent_PlayerPreRemoved");
static_assert(sizeof(CustomHUDLayoutComponent_PlayerPreRemoved) == 0x000038, "Wrong size on CustomHUDLayoutComponent_PlayerPreRemoved");
static_assert(offsetof(CustomHUDLayoutComponent_PlayerPreRemoved, UniqueNetId) == 0x000000, "Member 'CustomHUDLayoutComponent_PlayerPreRemoved::UniqueNetId' has a wrong offset!");
static_assert(offsetof(CustomHUDLayoutComponent_PlayerPreRemoved, bIsLocalPlayer) == 0x000030, "Member 'CustomHUDLayoutComponent_PlayerPreRemoved::bIsLocalPlayer' has a wrong offset!");

}

