#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRDPostProcess

#include "Basic.hpp"

#include "CRDPostProcess_structs.hpp"


namespace SDK::Params
{

// Function CRDPostProcess.CRDPostProcessDeviceComponent.ApplyPostProcessSettingsToDeviceComponent
// 0x0028 (0x0028 - 0x0000)
struct CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent final
{
public:
	const class UClass*                           ActorClass;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInEnabled;                                        // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InMaxStrength;                                     // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InEffectDuration;                                  // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBlendInDuration;                                 // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBlendOutDuration;                                // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent) == 0x000008, "Wrong alignment on CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent");
static_assert(sizeof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent) == 0x000028, "Wrong size on CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent");
static_assert(offsetof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent, ActorClass) == 0x000000, "Member 'CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent::ActorClass' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent, bInEnabled) == 0x000008, "Member 'CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent::bInEnabled' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent, InMaxStrength) == 0x00000C, "Member 'CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent::InMaxStrength' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent, InPriority) == 0x000010, "Member 'CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent::InPriority' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent, InEffectDuration) == 0x000014, "Member 'CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent::InEffectDuration' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent, InBlendInDuration) == 0x000018, "Member 'CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent::InBlendInDuration' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent, InBlendOutDuration) == 0x00001C, "Member 'CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent::InBlendOutDuration' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent, ReturnValue) == 0x000020, "Member 'CRDPostProcessDeviceComponent_ApplyPostProcessSettingsToDeviceComponent::ReturnValue' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.SetCurrentStrength
// 0x0004 (0x0004 - 0x0000)
struct CRDPostProcessDeviceComponent_SetCurrentStrength final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_SetCurrentStrength) == 0x000004, "Wrong alignment on CRDPostProcessDeviceComponent_SetCurrentStrength");
static_assert(sizeof(CRDPostProcessDeviceComponent_SetCurrentStrength) == 0x000004, "Wrong size on CRDPostProcessDeviceComponent_SetCurrentStrength");
static_assert(offsetof(CRDPostProcessDeviceComponent_SetCurrentStrength, Value) == 0x000000, "Member 'CRDPostProcessDeviceComponent_SetCurrentStrength::Value' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.SetHiddenStrength
// 0x0004 (0x0004 - 0x0000)
struct CRDPostProcessDeviceComponent_SetHiddenStrength final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_SetHiddenStrength) == 0x000004, "Wrong alignment on CRDPostProcessDeviceComponent_SetHiddenStrength");
static_assert(sizeof(CRDPostProcessDeviceComponent_SetHiddenStrength) == 0x000004, "Wrong size on CRDPostProcessDeviceComponent_SetHiddenStrength");
static_assert(offsetof(CRDPostProcessDeviceComponent_SetHiddenStrength, Value) == 0x000000, "Member 'CRDPostProcessDeviceComponent_SetHiddenStrength::Value' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.SetPostProcessEnabled
// 0x0001 (0x0001 - 0x0000)
struct CRDPostProcessDeviceComponent_SetPostProcessEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_SetPostProcessEnabled) == 0x000001, "Wrong alignment on CRDPostProcessDeviceComponent_SetPostProcessEnabled");
static_assert(sizeof(CRDPostProcessDeviceComponent_SetPostProcessEnabled) == 0x000001, "Wrong size on CRDPostProcessDeviceComponent_SetPostProcessEnabled");
static_assert(offsetof(CRDPostProcessDeviceComponent_SetPostProcessEnabled, bEnabled) == 0x000000, "Member 'CRDPostProcessDeviceComponent_SetPostProcessEnabled::bEnabled' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.StartBlending
// 0x0010 (0x0010 - 0x0000)
struct CRDPostProcessDeviceComponent_StartBlending final
{
public:
	class APlayerController*                      InBlendInstigator;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendIn;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_StartBlending) == 0x000008, "Wrong alignment on CRDPostProcessDeviceComponent_StartBlending");
static_assert(sizeof(CRDPostProcessDeviceComponent_StartBlending) == 0x000010, "Wrong size on CRDPostProcessDeviceComponent_StartBlending");
static_assert(offsetof(CRDPostProcessDeviceComponent_StartBlending, InBlendInstigator) == 0x000000, "Member 'CRDPostProcessDeviceComponent_StartBlending::InBlendInstigator' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_StartBlending, bBlendIn) == 0x000008, "Member 'CRDPostProcessDeviceComponent_StartBlending::bBlendIn' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_StartBlending, Duration) == 0x00000C, "Member 'CRDPostProcessDeviceComponent_StartBlending::Duration' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.StartBlendingFromPriority
// 0x0008 (0x0008 - 0x0000)
struct CRDPostProcessDeviceComponent_StartBlendingFromPriority final
{
public:
	bool                                          bShouldHide;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_StartBlendingFromPriority) == 0x000004, "Wrong alignment on CRDPostProcessDeviceComponent_StartBlendingFromPriority");
static_assert(sizeof(CRDPostProcessDeviceComponent_StartBlendingFromPriority) == 0x000008, "Wrong size on CRDPostProcessDeviceComponent_StartBlendingFromPriority");
static_assert(offsetof(CRDPostProcessDeviceComponent_StartBlendingFromPriority, bShouldHide) == 0x000000, "Member 'CRDPostProcessDeviceComponent_StartBlendingFromPriority::bShouldHide' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceComponent_StartBlendingFromPriority, Duration) == 0x000004, "Member 'CRDPostProcessDeviceComponent_StartBlendingFromPriority::Duration' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.StartEffectTimer
// 0x0008 (0x0008 - 0x0000)
struct CRDPostProcessDeviceComponent_StartEffectTimer final
{
public:
	class APlayerController*                      InBlendInstigator;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_StartEffectTimer) == 0x000008, "Wrong alignment on CRDPostProcessDeviceComponent_StartEffectTimer");
static_assert(sizeof(CRDPostProcessDeviceComponent_StartEffectTimer) == 0x000008, "Wrong size on CRDPostProcessDeviceComponent_StartEffectTimer");
static_assert(offsetof(CRDPostProcessDeviceComponent_StartEffectTimer, InBlendInstigator) == 0x000000, "Member 'CRDPostProcessDeviceComponent_StartEffectTimer::InBlendInstigator' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.GetBlendInTime
// 0x0004 (0x0004 - 0x0000)
struct CRDPostProcessDeviceComponent_GetBlendInTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_GetBlendInTime) == 0x000004, "Wrong alignment on CRDPostProcessDeviceComponent_GetBlendInTime");
static_assert(sizeof(CRDPostProcessDeviceComponent_GetBlendInTime) == 0x000004, "Wrong size on CRDPostProcessDeviceComponent_GetBlendInTime");
static_assert(offsetof(CRDPostProcessDeviceComponent_GetBlendInTime, ReturnValue) == 0x000000, "Member 'CRDPostProcessDeviceComponent_GetBlendInTime::ReturnValue' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.GetBlendOutTime
// 0x0004 (0x0004 - 0x0000)
struct CRDPostProcessDeviceComponent_GetBlendOutTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_GetBlendOutTime) == 0x000004, "Wrong alignment on CRDPostProcessDeviceComponent_GetBlendOutTime");
static_assert(sizeof(CRDPostProcessDeviceComponent_GetBlendOutTime) == 0x000004, "Wrong size on CRDPostProcessDeviceComponent_GetBlendOutTime");
static_assert(offsetof(CRDPostProcessDeviceComponent_GetBlendOutTime, ReturnValue) == 0x000000, "Member 'CRDPostProcessDeviceComponent_GetBlendOutTime::ReturnValue' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.GetClientEnabled
// 0x0001 (0x0001 - 0x0000)
struct CRDPostProcessDeviceComponent_GetClientEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_GetClientEnabled) == 0x000001, "Wrong alignment on CRDPostProcessDeviceComponent_GetClientEnabled");
static_assert(sizeof(CRDPostProcessDeviceComponent_GetClientEnabled) == 0x000001, "Wrong size on CRDPostProcessDeviceComponent_GetClientEnabled");
static_assert(offsetof(CRDPostProcessDeviceComponent_GetClientEnabled, ReturnValue) == 0x000000, "Member 'CRDPostProcessDeviceComponent_GetClientEnabled::ReturnValue' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.GetCurrentStrength
// 0x0004 (0x0004 - 0x0000)
struct CRDPostProcessDeviceComponent_GetCurrentStrength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_GetCurrentStrength) == 0x000004, "Wrong alignment on CRDPostProcessDeviceComponent_GetCurrentStrength");
static_assert(sizeof(CRDPostProcessDeviceComponent_GetCurrentStrength) == 0x000004, "Wrong size on CRDPostProcessDeviceComponent_GetCurrentStrength");
static_assert(offsetof(CRDPostProcessDeviceComponent_GetCurrentStrength, ReturnValue) == 0x000000, "Member 'CRDPostProcessDeviceComponent_GetCurrentStrength::ReturnValue' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceComponent.GetPriority
// 0x0004 (0x0004 - 0x0000)
struct CRDPostProcessDeviceComponent_GetPriority final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceComponent_GetPriority) == 0x000004, "Wrong alignment on CRDPostProcessDeviceComponent_GetPriority");
static_assert(sizeof(CRDPostProcessDeviceComponent_GetPriority) == 0x000004, "Wrong size on CRDPostProcessDeviceComponent_GetPriority");
static_assert(offsetof(CRDPostProcessDeviceComponent_GetPriority, ReturnValue) == 0x000000, "Member 'CRDPostProcessDeviceComponent_GetPriority::ReturnValue' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDevicePriorityControllerComponent.GetPostProcessDevicePriorityControllerComponentFromPlayerController
// 0x0018 (0x0018 - 0x0000)
struct CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateIfNotFound;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCRDPostProcessDevicePriorityControllerComponent* ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController) == 0x000008, "Wrong alignment on CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController");
static_assert(sizeof(CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController) == 0x000018, "Wrong size on CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController");
static_assert(offsetof(CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController, PC) == 0x000000, "Member 'CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController::PC' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController, bCreateIfNotFound) == 0x000008, "Member 'CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController::bCreateIfNotFound' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController, ReturnValue) == 0x000010, "Member 'CRDPostProcessDevicePriorityControllerComponent_GetPostProcessDevicePriorityControllerComponentFromPlayerController::ReturnValue' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDevicePriorityControllerComponent.CachePostProcessDeviceApplication
// 0x0008 (0x0008 - 0x0000)
struct CRDPostProcessDevicePriorityControllerComponent_CachePostProcessDeviceApplication final
{
public:
	class UCRDPostProcessDeviceComponent*         InPostProcessDeviceComponent;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDevicePriorityControllerComponent_CachePostProcessDeviceApplication) == 0x000008, "Wrong alignment on CRDPostProcessDevicePriorityControllerComponent_CachePostProcessDeviceApplication");
static_assert(sizeof(CRDPostProcessDevicePriorityControllerComponent_CachePostProcessDeviceApplication) == 0x000008, "Wrong size on CRDPostProcessDevicePriorityControllerComponent_CachePostProcessDeviceApplication");
static_assert(offsetof(CRDPostProcessDevicePriorityControllerComponent_CachePostProcessDeviceApplication, InPostProcessDeviceComponent) == 0x000000, "Member 'CRDPostProcessDevicePriorityControllerComponent_CachePostProcessDeviceApplication::InPostProcessDeviceComponent' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDevicePriorityControllerComponent.GetEffectsForPriority
// 0x0018 (0x0018 - 0x0000)
struct CRDPostProcessDevicePriorityControllerComponent_GetEffectsForPriority final
{
public:
	int32                                         Priority;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCRDPostProcessDeviceComponent*> OutEffects;                                        // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDevicePriorityControllerComponent_GetEffectsForPriority) == 0x000008, "Wrong alignment on CRDPostProcessDevicePriorityControllerComponent_GetEffectsForPriority");
static_assert(sizeof(CRDPostProcessDevicePriorityControllerComponent_GetEffectsForPriority) == 0x000018, "Wrong size on CRDPostProcessDevicePriorityControllerComponent_GetEffectsForPriority");
static_assert(offsetof(CRDPostProcessDevicePriorityControllerComponent_GetEffectsForPriority, Priority) == 0x000000, "Member 'CRDPostProcessDevicePriorityControllerComponent_GetEffectsForPriority::Priority' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDevicePriorityControllerComponent_GetEffectsForPriority, OutEffects) == 0x000008, "Member 'CRDPostProcessDevicePriorityControllerComponent_GetEffectsForPriority::OutEffects' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDevicePriorityControllerComponent.GetHighestPriorityValue
// 0x0004 (0x0004 - 0x0000)
struct CRDPostProcessDevicePriorityControllerComponent_GetHighestPriorityValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDevicePriorityControllerComponent_GetHighestPriorityValue) == 0x000004, "Wrong alignment on CRDPostProcessDevicePriorityControllerComponent_GetHighestPriorityValue");
static_assert(sizeof(CRDPostProcessDevicePriorityControllerComponent_GetHighestPriorityValue) == 0x000004, "Wrong size on CRDPostProcessDevicePriorityControllerComponent_GetHighestPriorityValue");
static_assert(offsetof(CRDPostProcessDevicePriorityControllerComponent_GetHighestPriorityValue, ReturnValue) == 0x000000, "Member 'CRDPostProcessDevicePriorityControllerComponent_GetHighestPriorityValue::ReturnValue' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDevicePriorityControllerComponent.RemovePostProcessDevice
// 0x0008 (0x0008 - 0x0000)
struct CRDPostProcessDevicePriorityControllerComponent_RemovePostProcessDevice final
{
public:
	class UCRDPostProcessDeviceComponent*         InPostProcessDeviceComponent;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDevicePriorityControllerComponent_RemovePostProcessDevice) == 0x000008, "Wrong alignment on CRDPostProcessDevicePriorityControllerComponent_RemovePostProcessDevice");
static_assert(sizeof(CRDPostProcessDevicePriorityControllerComponent_RemovePostProcessDevice) == 0x000008, "Wrong size on CRDPostProcessDevicePriorityControllerComponent_RemovePostProcessDevice");
static_assert(offsetof(CRDPostProcessDevicePriorityControllerComponent_RemovePostProcessDevice, InPostProcessDeviceComponent) == 0x000000, "Member 'CRDPostProcessDevicePriorityControllerComponent_RemovePostProcessDevice::InPostProcessDeviceComponent' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceControllerComponent.GetMinigamePlayersForPostProcessDevice
// 0x0018 (0x0018 - 0x0000)
struct CRDPostProcessDeviceControllerComponent_GetMinigamePlayersForPostProcessDevice final
{
public:
	const class AFortMinigame*                    FortMinigame;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APlayerState*>                   OutPlayers;                                        // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceControllerComponent_GetMinigamePlayersForPostProcessDevice) == 0x000008, "Wrong alignment on CRDPostProcessDeviceControllerComponent_GetMinigamePlayersForPostProcessDevice");
static_assert(sizeof(CRDPostProcessDeviceControllerComponent_GetMinigamePlayersForPostProcessDevice) == 0x000018, "Wrong size on CRDPostProcessDeviceControllerComponent_GetMinigamePlayersForPostProcessDevice");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_GetMinigamePlayersForPostProcessDevice, FortMinigame) == 0x000000, "Member 'CRDPostProcessDeviceControllerComponent_GetMinigamePlayersForPostProcessDevice::FortMinigame' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_GetMinigamePlayersForPostProcessDevice, OutPlayers) == 0x000008, "Member 'CRDPostProcessDeviceControllerComponent_GetMinigamePlayersForPostProcessDevice::OutPlayers' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceControllerComponent.GetPostProcessDeviceControllerComponentFromPlayerController
// 0x0018 (0x0018 - 0x0000)
struct CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateIfNotFound;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCRDPostProcessDeviceControllerComponent* ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController) == 0x000008, "Wrong alignment on CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController");
static_assert(sizeof(CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController) == 0x000018, "Wrong size on CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController, PC) == 0x000000, "Member 'CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController::PC' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController, bCreateIfNotFound) == 0x000008, "Member 'CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController::bCreateIfNotFound' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController, ReturnValue) == 0x000010, "Member 'CRDPostProcessDeviceControllerComponent_GetPostProcessDeviceControllerComponentFromPlayerController::ReturnValue' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceControllerComponent.AddBlendMessageToQueue
// 0x0018 (0x0018 - 0x0000)
struct CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue final
{
public:
	const class AFortCreativeDeviceProp*          PostProcessDevice;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPlayerState*                 PlayerStateMessage;                                // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPostProcessDeviceState                       EndState;                                          // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue) == 0x000008, "Wrong alignment on CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue");
static_assert(sizeof(CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue) == 0x000018, "Wrong size on CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue, PostProcessDevice) == 0x000000, "Member 'CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue::PostProcessDevice' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue, PlayerStateMessage) == 0x000008, "Member 'CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue::PlayerStateMessage' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue, EndState) == 0x000010, "Member 'CRDPostProcessDeviceControllerComponent_AddBlendMessageToQueue::EndState' has a wrong offset!");

// Function CRDPostProcess.CRDPostProcessDeviceControllerComponent.ServerBlendFinished
// 0x0018 (0x0018 - 0x0000)
struct CRDPostProcessDeviceControllerComponent_ServerBlendFinished final
{
public:
	const class AFortCreativeDeviceProp*          PostProcessDevice;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class APlayerController*                Instigator;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendIn;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CRDPostProcessDeviceControllerComponent_ServerBlendFinished) == 0x000008, "Wrong alignment on CRDPostProcessDeviceControllerComponent_ServerBlendFinished");
static_assert(sizeof(CRDPostProcessDeviceControllerComponent_ServerBlendFinished) == 0x000018, "Wrong size on CRDPostProcessDeviceControllerComponent_ServerBlendFinished");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_ServerBlendFinished, PostProcessDevice) == 0x000000, "Member 'CRDPostProcessDeviceControllerComponent_ServerBlendFinished::PostProcessDevice' has a wrong offset!");
static_assert(offsetof(CRDPostProcessDeviceControllerComponent_ServerBlendFinished, Instigator) == 0x000008, "Member 'CRDPostProcessDeviceControllerComponent_ServerBlendFinished::Instigator' has a wrong offset!");
