#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DashRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct DashRuntime.FortMovementMode_DashRuntimeData
// 0x0050 (0x0060 - 0x0010)
struct FFortMovementMode_DashRuntimeData final : public FFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_10[0x50];                                      // 0x0010(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortMovementMode_DashRuntimeData) == 0x000008, "Wrong alignment on FFortMovementMode_DashRuntimeData");
static_assert(sizeof(FFortMovementMode_DashRuntimeData) == 0x000060, "Wrong size on FFortMovementMode_DashRuntimeData");

// ScriptStruct DashRuntime.FortMovementMode_DashCreationData
// 0x0050 (0x0058 - 0x0008)
struct FFortMovementMode_DashCreationData final : public FFortMovementMode_BaseExtCreationData
{
public:
	struct FVector                                TargetLocation;                                    // 0x0008(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestrictSpeedToExpected;                          // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           PathOffsetCurve;                                   // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERootMotionFinishVelocityMode                 VelocityOnFinishMode;                              // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SetVelocityOnFinish;                               // 0x0038(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClampVelocityOnFinish;                             // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortMovementMode_DashCreationData) == 0x000008, "Wrong alignment on FFortMovementMode_DashCreationData");
static_assert(sizeof(FFortMovementMode_DashCreationData) == 0x000058, "Wrong size on FFortMovementMode_DashCreationData");
static_assert(offsetof(FFortMovementMode_DashCreationData, TargetLocation) == 0x000008, "Member 'FFortMovementMode_DashCreationData::TargetLocation' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_DashCreationData, Duration) == 0x000020, "Member 'FFortMovementMode_DashCreationData::Duration' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_DashCreationData, bRestrictSpeedToExpected) == 0x000024, "Member 'FFortMovementMode_DashCreationData::bRestrictSpeedToExpected' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_DashCreationData, PathOffsetCurve) == 0x000028, "Member 'FFortMovementMode_DashCreationData::PathOffsetCurve' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_DashCreationData, VelocityOnFinishMode) == 0x000030, "Member 'FFortMovementMode_DashCreationData::VelocityOnFinishMode' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_DashCreationData, SetVelocityOnFinish) == 0x000038, "Member 'FFortMovementMode_DashCreationData::SetVelocityOnFinish' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_DashCreationData, ClampVelocityOnFinish) == 0x000050, "Member 'FFortMovementMode_DashCreationData::ClampVelocityOnFinish' has a wrong offset!");

}

