#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Entity_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Entity_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseAssets_0_classes.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseClass Entity.Entity_engine_execution
// 0x0000 (0x0028 - 0x0028)
class UEntity_engine_execution final : public UObject
{
public:
	static class UEntity_engine_execution_subscribables* _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fengine__execution_N_RGetSubscribables_L_Nentity_R(class UEntity_entity* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity_engine_execution">();
	}
	static class UEntity_engine_execution* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_engine_execution>();
	}
};
static_assert(alignof(UEntity_engine_execution) == 0x000008, "Wrong alignment on UEntity_engine_execution");
static_assert(sizeof(UEntity_engine_execution) == 0x000028, "Wrong size on UEntity_engine_execution");

// VerseClass Entity.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class Entity_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass Entity.$SolarisSignatureFunctionOuter", true>();
	}
	static class Entity_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<Entity_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(Entity_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on Entity_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(Entity_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on Entity_0::U_SolarisSignatureFunctionOuter");

// VerseClass Entity.Entity_entity_initializer
// 0x0000 (0x0028 - 0x0028)
class UEntity_entity_initializer final : public UObject
{
public:
	static TOptional<class UEntity_component*, true> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity__initializer_N_RInitializeDependency_L_Nentity_M_NComponentType_M_Nmode_20where_20ComponentType_R(const struct FTuple_Lentity_Mcomponent_Mmode_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity_entity_initializer">();
	}
	static class UEntity_entity_initializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_entity_initializer>();
	}
};
static_assert(alignof(UEntity_entity_initializer) == 0x000008, "Wrong alignment on UEntity_entity_initializer");
static_assert(sizeof(UEntity_entity_initializer) == 0x000028, "Wrong size on UEntity_entity_initializer");

// VerseClass Entity.Entity_component
// 0x0090 (0x00B8 - 0x0028)
class UEntity_component : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x34F86866__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RGetOwner; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x80A77A56__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF4A85A8C__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF2EB0215__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5A60656F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x49572FA6__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RBeginPlay; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFD2CE98F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_REndPlay; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC373C77B__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RBeginPlay(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_REndPlay(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntity_entity*, true> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RGetOwner(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity_component">();
	}
	static class UEntity_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_component>();
	}
};
static_assert(alignof(UEntity_component) == 0x000008, "Wrong alignment on UEntity_component");
static_assert(sizeof(UEntity_component) == 0x0000B8, "Wrong size on UEntity_component");
static_assert(offsetof(UEntity_component, __verse_0x34F86866__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RGetOwner) == 0x000028, "Member 'UEntity_component::__verse_0x34F86866__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RGetOwner' has a wrong offset!");
static_assert(offsetof(UEntity_component, __verse_0x80A77A56__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize) == 0x000038, "Member 'UEntity_component::__verse_0x80A77A56__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize' has a wrong offset!");
static_assert(offsetof(UEntity_component, __verse_0xF4A85A8C__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize) == 0x000048, "Member 'UEntity_component::__verse_0xF4A85A8C__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize' has a wrong offset!");
static_assert(offsetof(UEntity_component, __verse_0xF2EB0215__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld) == 0x000058, "Member 'UEntity_component::__verse_0xF2EB0215__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld' has a wrong offset!");
static_assert(offsetof(UEntity_component, __verse_0x5A60656F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld) == 0x000068, "Member 'UEntity_component::__verse_0x5A60656F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld' has a wrong offset!");
static_assert(offsetof(UEntity_component, __verse_0x49572FA6__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RBeginPlay) == 0x000078, "Member 'UEntity_component::__verse_0x49572FA6__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RBeginPlay' has a wrong offset!");
static_assert(offsetof(UEntity_component, __verse_0xFD2CE98F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_REndPlay) == 0x000088, "Member 'UEntity_component::__verse_0xFD2CE98F__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_REndPlay' has a wrong offset!");
static_assert(offsetof(UEntity_component, __verse_0xC373C77B__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient) == 0x000098, "Member 'UEntity_component::__verse_0xC373C77B__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient' has a wrong offset!");

// VerseClass Entity.Entity_replication_component
// 0x0020 (0x00D8 - 0x00B8)
class UEntity_replication_component final : public UEntity_component
{
public:
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity_replication_component">();
	}
	static class UEntity_replication_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_replication_component>();
	}
};
static_assert(alignof(UEntity_replication_component) == 0x000008, "Wrong alignment on UEntity_replication_component");
static_assert(sizeof(UEntity_replication_component) == 0x0000D8, "Wrong size on UEntity_replication_component");

// VerseClass Entity.Entity_engine_execution_subscribables
// 0x0030 (0x0058 - 0x0028)
class UEntity_engine_execution_subscribables final : public UObject
{
public:
	class UExecution_execution_subscribable*      __verse_0x8A2FD5A2_PrePhysics;                     // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      __verse_0x64E0C2D3_StartPhysics;                   // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      __verse_0x2CC1E195_DuringPhysics;                  // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      __verse_0xA3739C71_EndPhysics;                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      __verse_0xF70848B2_PostPhysics;                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExecution_execution_subscribable*      __verse_0xDA501C13_EndFrame;                       // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity_engine_execution_subscribables">();
	}
	static class UEntity_engine_execution_subscribables* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_engine_execution_subscribables>();
	}
};
static_assert(alignof(UEntity_engine_execution_subscribables) == 0x000008, "Wrong alignment on UEntity_engine_execution_subscribables");
static_assert(sizeof(UEntity_engine_execution_subscribables) == 0x000058, "Wrong size on UEntity_engine_execution_subscribables");
static_assert(offsetof(UEntity_engine_execution_subscribables, __verse_0x8A2FD5A2_PrePhysics) == 0x000028, "Member 'UEntity_engine_execution_subscribables::__verse_0x8A2FD5A2_PrePhysics' has a wrong offset!");
static_assert(offsetof(UEntity_engine_execution_subscribables, __verse_0x64E0C2D3_StartPhysics) == 0x000030, "Member 'UEntity_engine_execution_subscribables::__verse_0x64E0C2D3_StartPhysics' has a wrong offset!");
static_assert(offsetof(UEntity_engine_execution_subscribables, __verse_0x2CC1E195_DuringPhysics) == 0x000038, "Member 'UEntity_engine_execution_subscribables::__verse_0x2CC1E195_DuringPhysics' has a wrong offset!");
static_assert(offsetof(UEntity_engine_execution_subscribables, __verse_0xA3739C71_EndPhysics) == 0x000040, "Member 'UEntity_engine_execution_subscribables::__verse_0xA3739C71_EndPhysics' has a wrong offset!");
static_assert(offsetof(UEntity_engine_execution_subscribables, __verse_0xF70848B2_PostPhysics) == 0x000048, "Member 'UEntity_engine_execution_subscribables::__verse_0xF70848B2_PostPhysics' has a wrong offset!");
static_assert(offsetof(UEntity_engine_execution_subscribables, __verse_0xDA501C13_EndFrame) == 0x000050, "Member 'UEntity_engine_execution_subscribables::__verse_0xDA501C13_EndFrame' has a wrong offset!");

// VerseClass Entity.Entity_entity_prefab
// 0x0000 (0x00C8 - 0x00C8)
class UEntity_entity_prefab final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity_entity_prefab">();
	}
	static class UEntity_entity_prefab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_entity_prefab>();
	}
};
static_assert(alignof(UEntity_entity_prefab) == 0x000008, "Wrong alignment on UEntity_entity_prefab");
static_assert(sizeof(UEntity_entity_prefab) == 0x0000C8, "Wrong size on UEntity_entity_prefab");

// VerseClass Entity.Entity_entity
// 0x00A8 (0x0130 - 0x0088)
class UEntity_entity : public UBaseEntity
{
public:
	FVerseFunctionProperty_                       __verse_0x6A127A57__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetOwner; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x31D766D4__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetEntities; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA1AC8BB5__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RAddEntity_L_Nentity_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x99EAA54A__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RRemoveEntity_L_Nentity_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5328D3E4__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RAddComponent_L_Ncomponent_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEB78254A__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x657B992E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetComponentByType_L_NComponentType_20where_20ComponentType_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x55B9FC25__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RDispose; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCEFEC034__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RIsDisposed; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_118[0x18];                                     // 0x0118(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RAddComponent_L_Ncomponent_R(class UEntity_component* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RAddEntity_L_Nentity_R(class UEntity_entity* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RDispose(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntity_component*, true> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetComponentByType_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	TArray<class UEntity_entity*> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetEntities(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntity_entity*, true> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetOwner(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RIsDisposed(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R(class UEntity_component* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RRemoveEntity_L_Nentity_R(class UEntity_entity* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity_entity">();
	}
	static class UEntity_entity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_entity>();
	}
};
static_assert(alignof(UEntity_entity) == 0x000008, "Wrong alignment on UEntity_entity");
static_assert(sizeof(UEntity_entity) == 0x000130, "Wrong size on UEntity_entity");
static_assert(offsetof(UEntity_entity, __verse_0x6A127A57__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetOwner) == 0x000088, "Member 'UEntity_entity::__verse_0x6A127A57__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetOwner' has a wrong offset!");
static_assert(offsetof(UEntity_entity, __verse_0x31D766D4__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetEntities) == 0x000098, "Member 'UEntity_entity::__verse_0x31D766D4__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetEntities' has a wrong offset!");
static_assert(offsetof(UEntity_entity, __verse_0xA1AC8BB5__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RAddEntity_L_Nentity_R) == 0x0000A8, "Member 'UEntity_entity::__verse_0xA1AC8BB5__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RAddEntity_L_Nentity_R' has a wrong offset!");
static_assert(offsetof(UEntity_entity, __verse_0x99EAA54A__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RRemoveEntity_L_Nentity_R) == 0x0000B8, "Member 'UEntity_entity::__verse_0x99EAA54A__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RRemoveEntity_L_Nentity_R' has a wrong offset!");
static_assert(offsetof(UEntity_entity, __verse_0x5328D3E4__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RAddComponent_L_Ncomponent_R) == 0x0000C8, "Member 'UEntity_entity::__verse_0x5328D3E4__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RAddComponent_L_Ncomponent_R' has a wrong offset!");
static_assert(offsetof(UEntity_entity, __verse_0xEB78254A__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R) == 0x0000D8, "Member 'UEntity_entity::__verse_0xEB78254A__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RRemoveComponent_L_Ncomponent_R' has a wrong offset!");
static_assert(offsetof(UEntity_entity, __verse_0x657B992E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetComponentByType_L_NComponentType_20where_20ComponentType_R) == 0x0000E8, "Member 'UEntity_entity::__verse_0x657B992E__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RGetComponentByType_L_NComponentType_20where_20ComponentType_R' has a wrong offset!");
static_assert(offsetof(UEntity_entity, __verse_0x55B9FC25__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RDispose) == 0x0000F8, "Member 'UEntity_entity::__verse_0x55B9FC25__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RDispose' has a wrong offset!");
static_assert(offsetof(UEntity_entity, __verse_0xCEFEC034__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RIsDisposed) == 0x000108, "Member 'UEntity_entity::__verse_0xCEFEC034__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fentity_N_RIsDisposed' has a wrong offset!");

// VerseClass Entity.Entity_transform_component
// 0x00F8 (0x01B0 - 0x00B8)
class UEntity_transform_component final : public UEntity_component
{
public:
	FVerseFunctionProperty_                       __verse_0x29905BCB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_RSetTransform_L_Ntransform_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x32F72DD8__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_ROnRep__Transform; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 __verse_0x61C3007D_Transform;                      // 0x00E0(0x0060)(Net, InstancedReference, NoDestructor)
	struct FSpatialMath_transform                 __verse_0xEA0A1CBC_InitialRelativeTransform;       // 0x0140(0x0060)(Edit, InstancedReference, SaveGame, NoDestructor)
	uint8                                         Pad_1A0[0x10];                                     // 0x01A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RInitialize(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RIsAllowedOnClient(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RUninitialize(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_ROnRep__Transform(const struct Entity_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_RSetTransform_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity_transform_component">();
	}
	static class UEntity_transform_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_transform_component>();
	}
};
static_assert(alignof(UEntity_transform_component) == 0x000010, "Wrong alignment on UEntity_transform_component");
static_assert(sizeof(UEntity_transform_component) == 0x0001B0, "Wrong size on UEntity_transform_component");
static_assert(offsetof(UEntity_transform_component, __verse_0x29905BCB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_RSetTransform_L_Ntransform_R) == 0x0000B8, "Member 'UEntity_transform_component::__verse_0x29905BCB__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_RSetTransform_L_Ntransform_R' has a wrong offset!");
static_assert(offsetof(UEntity_transform_component, __verse_0x32F72DD8__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_ROnRep__Transform) == 0x0000C8, "Member 'UEntity_transform_component::__verse_0x32F72DD8__L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2ftransform__component_N_ROnRep__Transform' has a wrong offset!");
static_assert(offsetof(UEntity_transform_component, __verse_0x61C3007D_Transform) == 0x0000E0, "Member 'UEntity_transform_component::__verse_0x61C3007D_Transform' has a wrong offset!");
static_assert(offsetof(UEntity_transform_component, __verse_0xEA0A1CBC_InitialRelativeTransform) == 0x000140, "Member 'UEntity_transform_component::__verse_0xEA0A1CBC_InitialRelativeTransform' has a wrong offset!");

// VerseClass Entity.Entity_typed_element_component
// 0x0000 (0x00B8 - 0x00B8)
class UEntity_typed_element_component final : public UEntity_component
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Entity_typed_element_component">();
	}
	static class UEntity_typed_element_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntity_typed_element_component>();
	}
};
static_assert(alignof(UEntity_typed_element_component) == 0x000008, "Wrong alignment on UEntity_typed_element_component");
static_assert(sizeof(UEntity_typed_element_component) == 0x0000B8, "Wrong size on UEntity_typed_element_component");

}

