#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlyingCodeRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class FlyingCodeRuntime.FortCameraMode_Flying
// 0x0010 (0x1CB0 - 0x1CA0)
class UFortCameraMode_Flying final : public UFortCameraMode_ThirdPerson
{
public:
	float                                         LastActiveTimeSeconds;                             // 0x1CA0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CA4[0xC];                                     // 0x1CA4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_ProcessViewRotation(const struct FRotator& InViewRotation, const struct FRotator& InDeltaRot, float DeltaTime, bool* bOutShouldOverride, struct FRotator* OutViewRotation, struct FRotator* OutDeltaRot) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraMode_Flying">();
	}
	static class UFortCameraMode_Flying* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraMode_Flying>();
	}
};
static_assert(alignof(UFortCameraMode_Flying) == 0x000010, "Wrong alignment on UFortCameraMode_Flying");
static_assert(sizeof(UFortCameraMode_Flying) == 0x001CB0, "Wrong size on UFortCameraMode_Flying");
static_assert(offsetof(UFortCameraMode_Flying, LastActiveTimeSeconds) == 0x001CA0, "Member 'UFortCameraMode_Flying::LastActiveTimeSeconds' has a wrong offset!");

// Class FlyingCodeRuntime.FortMovementMode_ExtLogicFlying
// 0x0000 (0x0120 - 0x0120)
class UFortMovementMode_ExtLogicFlying : public UFortMovementMode_BaseExtLogic
{
public:
	bool CanBeginFlying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicFlying">();
	}
	static class UFortMovementMode_ExtLogicFlying* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicFlying>();
	}
};
static_assert(alignof(UFortMovementMode_ExtLogicFlying) == 0x000008, "Wrong alignment on UFortMovementMode_ExtLogicFlying");
static_assert(sizeof(UFortMovementMode_ExtLogicFlying) == 0x000120, "Wrong size on UFortMovementMode_ExtLogicFlying");

}

