#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlyingCodeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FlyingCodeRuntime.FortCameraMode_Flying.BP_ProcessViewRotation
// 0x0068 (0x0068 - 0x0000)
struct FortCameraMode_Flying_BP_ProcessViewRotation final
{
public:
	struct FRotator                               InViewRotation;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               InDeltaRot;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutShouldOverride;                                // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OutViewRotation;                                   // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               OutDeltaRot;                                       // 0x0050(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCameraMode_Flying_BP_ProcessViewRotation) == 0x000008, "Wrong alignment on FortCameraMode_Flying_BP_ProcessViewRotation");
static_assert(sizeof(FortCameraMode_Flying_BP_ProcessViewRotation) == 0x000068, "Wrong size on FortCameraMode_Flying_BP_ProcessViewRotation");
static_assert(offsetof(FortCameraMode_Flying_BP_ProcessViewRotation, InViewRotation) == 0x000000, "Member 'FortCameraMode_Flying_BP_ProcessViewRotation::InViewRotation' has a wrong offset!");
static_assert(offsetof(FortCameraMode_Flying_BP_ProcessViewRotation, InDeltaRot) == 0x000018, "Member 'FortCameraMode_Flying_BP_ProcessViewRotation::InDeltaRot' has a wrong offset!");
static_assert(offsetof(FortCameraMode_Flying_BP_ProcessViewRotation, DeltaTime) == 0x000030, "Member 'FortCameraMode_Flying_BP_ProcessViewRotation::DeltaTime' has a wrong offset!");
static_assert(offsetof(FortCameraMode_Flying_BP_ProcessViewRotation, bOutShouldOverride) == 0x000034, "Member 'FortCameraMode_Flying_BP_ProcessViewRotation::bOutShouldOverride' has a wrong offset!");
static_assert(offsetof(FortCameraMode_Flying_BP_ProcessViewRotation, OutViewRotation) == 0x000038, "Member 'FortCameraMode_Flying_BP_ProcessViewRotation::OutViewRotation' has a wrong offset!");
static_assert(offsetof(FortCameraMode_Flying_BP_ProcessViewRotation, OutDeltaRot) == 0x000050, "Member 'FortCameraMode_Flying_BP_ProcessViewRotation::OutDeltaRot' has a wrong offset!");

// Function FlyingCodeRuntime.FortMovementMode_ExtLogicFlying.CanBeginFlying
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicFlying_CanBeginFlying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicFlying_CanBeginFlying) == 0x000001, "Wrong alignment on FortMovementMode_ExtLogicFlying_CanBeginFlying");
static_assert(sizeof(FortMovementMode_ExtLogicFlying_CanBeginFlying) == 0x000001, "Wrong size on FortMovementMode_ExtLogicFlying_CanBeginFlying");
static_assert(offsetof(FortMovementMode_ExtLogicFlying_CanBeginFlying, ReturnValue) == 0x000000, "Member 'FortMovementMode_ExtLogicFlying_CanBeginFlying::ReturnValue' has a wrong offset!");

}

