#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Base_3L_Head_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Fortnite_Base_3L_Head_AnimBP.Fortnite_Base_3L_Head_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Fortnite_Base_3L_Head_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Fortnite_Base_3L_Head_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Fortnite_Base_3L_Head_AnimBP_C_AnimGraph");
static_assert(sizeof(Fortnite_Base_3L_Head_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Fortnite_Base_3L_Head_AnimBP_C_AnimGraph");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Fortnite_Base_3L_Head_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Fortnite_Base_3L_Head_AnimBP.Fortnite_Base_3L_Head_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Fortnite_Base_3L_Head_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_Base_3L_Head_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Fortnite_Base_3L_Head_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Fortnite_Base_3L_Head_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Fortnite_Base_3L_Head_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Fortnite_Base_3L_Head_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Fortnite_Base_3L_Head_AnimBP.Fortnite_Base_3L_Head_AnimBP_C.ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP
// 0x0030 (0x0030 - 0x0000)
struct Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlaylistUsesCustomCharacterParts_ReturnValue; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP) == 0x000008, "Wrong alignment on Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP");
static_assert(sizeof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP) == 0x000030, "Wrong size on Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, EntryPoint) == 0x000000, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, CallFunc_GetPlaylistUsesCustomCharacterParts_ReturnValue) == 0x000005, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::CallFunc_GetPlaylistUsesCustomCharacterParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000010, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, CallFunc_GetCurveValue_ReturnValue) == 0x00001C, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, K2Node_Event_DeltaTimeX) == 0x000020, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000024, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'Fortnite_Base_3L_Head_AnimBP_C_ExecuteUbergraph_Fortnite_Base_3L_Head_AnimBP::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

