#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortCosmeticItemCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortCosmeticItemCard.FortCosmeticItemCard_C
// 0x0058 (0x03F0 - 0x0398)
class UFortCosmeticItemCard_C final : public UFortCosmeticItemCard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortItemDetailsVM*                     FortItemDetailsVM;                                 // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimMinusHoverMinusNoRarity;                       // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Archived;                                          // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimMinusHover;                                    // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageMaterial_NewItemCard;                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BaseIconScale;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimationIconScale;                                // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        InitialAngle;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InitialAngleOffset;                                // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRarityVisible;                                    // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ArchiveAnimation(bool IsArchived, bool UseAnimations);
	void ExecuteUbergraph_FortCosmeticItemCard(int32 EntryPoint);
	void HandleUpdateRarity(const struct FFortColorPalette& RarityColors);
	void HandleUpdateRarityVisibility(bool bIsVisible);
	void HandleUpdateVisuals(bool bIsItem, bool bIsBorderAnimated, bool IsHero, bool IsReward, bool IsShuffleItem, bool ShowAsArchived, bool UseAnimations);
	void On_Update_Icon_From_VM(TSoftObjectPtr<class UTexture2D> Icon);
	void OnHover();
	void OnLoaded_F401C39A4A1A6B59897302A9E954A326(class UObject* Loaded);
	void OnSizeChanged(float InCardWidth);
	void OnUnhover();
	void OnUpdateEnhanced(bool bEnhanced);
	void OnUpdateItemCardIcon(class UTexture2D* Icon, float IconScale);
	void OnUpdateItemCardMaterial(class UMaterialInterface* Material);
	void OnUpdateSeriesOrRarityColors(const struct FFortColorPalette& ColorPalette);
	void OnUpdateSeriesOrRarityVisibility(bool bIsVisible);
	void OnUpdateVisuals(bool bIsItem, bool bIsBorderAnimated, bool bIsHero, bool bReward, bool bIsShuffleItem, bool bShowAsArchived, bool bUseAnimations);
	void SequenceEvent__ENTRYPOINTFortCosmeticItemCard();
	void SequenceEvent__ENTRYPOINTFortCosmeticItemCard_0();
	void SetFortItemDetailsVM(class UFortItemDetailsVM* ViewModel);
	void Update_Icon(class UTexture2D* Icon, double Scale);
	void UpdateImageIconScale();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortCosmeticItemCard_C">();
	}
	static class UFortCosmeticItemCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticItemCard_C>();
	}
};
static_assert(alignof(UFortCosmeticItemCard_C) == 0x000008, "Wrong alignment on UFortCosmeticItemCard_C");
static_assert(sizeof(UFortCosmeticItemCard_C) == 0x0003F0, "Wrong size on UFortCosmeticItemCard_C");
static_assert(offsetof(UFortCosmeticItemCard_C, UberGraphFrame) == 0x000398, "Member 'UFortCosmeticItemCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, FortItemDetailsVM) == 0x0003A0, "Member 'UFortCosmeticItemCard_C::FortItemDetailsVM' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, AnimMinusHoverMinusNoRarity) == 0x0003A8, "Member 'UFortCosmeticItemCard_C::AnimMinusHoverMinusNoRarity' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, Archived) == 0x0003B0, "Member 'UFortCosmeticItemCard_C::Archived' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, AnimMinusHover) == 0x0003B8, "Member 'UFortCosmeticItemCard_C::AnimMinusHover' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, ImageMaterial_NewItemCard) == 0x0003C0, "Member 'UFortCosmeticItemCard_C::ImageMaterial_NewItemCard' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, BaseIconScale) == 0x0003C8, "Member 'UFortCosmeticItemCard_C::BaseIconScale' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, AnimationIconScale) == 0x0003D0, "Member 'UFortCosmeticItemCard_C::AnimationIconScale' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, InitialAngle) == 0x0003D8, "Member 'UFortCosmeticItemCard_C::InitialAngle' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, InitialAngleOffset) == 0x0003E0, "Member 'UFortCosmeticItemCard_C::InitialAngleOffset' has a wrong offset!");
static_assert(offsetof(UFortCosmeticItemCard_C, bRarityVisible) == 0x0003E8, "Member 'UFortCosmeticItemCard_C::bRarityVisible' has a wrong offset!");

}

