#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Ascender_Smash

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C.DoFailSafeUnholster
// 0x0003 (0x0003 - 0x0000)
struct GA_Athena_Ascender_Smash_C_DoFailSafeUnholster final
{
public:
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue_1; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Ascender_Smash_C_DoFailSafeUnholster) == 0x000001, "Wrong alignment on GA_Athena_Ascender_Smash_C_DoFailSafeUnholster");
static_assert(sizeof(GA_Athena_Ascender_Smash_C_DoFailSafeUnholster) == 0x000003, "Wrong size on GA_Athena_Ascender_Smash_C_DoFailSafeUnholster");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_DoFailSafeUnholster, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000000, "Member 'GA_Athena_Ascender_Smash_C_DoFailSafeUnholster::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_DoFailSafeUnholster, CallFunc_GetConsoleVariableBoolValue_ReturnValue_1) == 0x000001, "Member 'GA_Athena_Ascender_Smash_C_DoFailSafeUnholster::CallFunc_GetConsoleVariableBoolValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_DoFailSafeUnholster, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'GA_Athena_Ascender_Smash_C_DoFailSafeUnholster::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C.DoHolster
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Ascender_Smash_C_DoHolster final
{
public:
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Ascender_Smash_C_DoHolster) == 0x000001, "Wrong alignment on GA_Athena_Ascender_Smash_C_DoHolster");
static_assert(sizeof(GA_Athena_Ascender_Smash_C_DoHolster) == 0x000001, "Wrong size on GA_Athena_Ascender_Smash_C_DoHolster");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_DoHolster, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000000, "Member 'GA_Athena_Ascender_Smash_C_DoHolster::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");

// Function GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C.DoUnholster
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Ascender_Smash_C_DoUnholster final
{
public:
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Ascender_Smash_C_DoUnholster) == 0x000001, "Wrong alignment on GA_Athena_Ascender_Smash_C_DoUnholster");
static_assert(sizeof(GA_Athena_Ascender_Smash_C_DoUnholster) == 0x000001, "Wrong size on GA_Athena_Ascender_Smash_C_DoUnholster");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_DoUnholster, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000000, "Member 'GA_Athena_Ascender_Smash_C_DoUnholster::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");

// Function GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C.ExecuteUbergraph_GA_Athena_Ascender_Smash
// 0x0298 (0x0298 - 0x0000)
struct GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetAscenderMontage_Montage;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerUsingHandle_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerUsingHandle_ReturnValue_1;        // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData_2;                          // 0x0048(0x00B0)(ConstParm)
	struct FGameplayEventData                     K2Node_Event_EventData_1;                          // 0x00F8(0x00B0)(ConstParm)
	class AB_Athena_Zipline_Ascender_C*           K2Node_DynamicCast_AsB_Athena_Zipline_Ascender;    // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x01D8(0x00B0)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0288(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash) == 0x000008, "Wrong alignment on GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash");
static_assert(sizeof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash) == 0x000298, "Wrong size on GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, EntryPoint) == 0x000000, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_GetAscenderMontage_Montage) == 0x000008, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_GetAscenderMontage_Montage' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000010, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_IsPlayerUsingHandle_ReturnValue) == 0x000034, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_IsPlayerUsingHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_IsPlayerUsingHandle_ReturnValue_1) == 0x000035, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_IsPlayerUsingHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, K2Node_Event_EventData_2) == 0x000048, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::K2Node_Event_EventData_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, K2Node_Event_EventData_1) == 0x0000F8, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::K2Node_Event_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, K2Node_DynamicCast_AsB_Athena_Zipline_Ascender) == 0x0001A8, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::K2Node_DynamicCast_AsB_Athena_Zipline_Ascender' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0001B8, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0001C0, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0001C8, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x0001D0, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, K2Node_Event_EventData) == 0x0001D8, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, K2Node_CreateDelegate_OutputDelegate_3) == 0x000288, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000294, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash, CallFunc_IsValid_ReturnValue_1) == 0x000295, "Member 'GA_Athena_Ascender_Smash_C_ExecuteUbergraph_GA_Athena_Ascender_Smash::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C.GameplayTagEvent_ZiplineEnter
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineEnter final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineEnter) == 0x000008, "Wrong alignment on GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineEnter");
static_assert(sizeof(GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineEnter) == 0x0000B0, "Wrong size on GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineEnter");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineEnter, EventData) == 0x000000, "Member 'GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineEnter::EventData' has a wrong offset!");

// Function GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C.GameplayTagEvent_ZiplineExit
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineExit final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineExit) == 0x000008, "Wrong alignment on GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineExit");
static_assert(sizeof(GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineExit) == 0x0000B0, "Wrong size on GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineExit");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineExit, EventData) == 0x000000, "Member 'GA_Athena_Ascender_Smash_C_GameplayTagEvent_ZiplineExit::EventData' has a wrong offset!");

// Function GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C.GetAscenderMontage
// 0x0050 (0x0050 - 0x0000)
struct GA_Athena_Ascender_Smash_C_GetAscenderMontage final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerUsingHandle_ReturnValue;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPawnComponent_AscenderMontageProvider* CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EFortCustomGender                             CallFunc_GetCharacterGender_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetSuitableMontage_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerUsingHandle_ReturnValue_1;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerUsingHandle_ReturnValue_2;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default_2;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Ascender_Smash_C_GetAscenderMontage) == 0x000008, "Wrong alignment on GA_Athena_Ascender_Smash_C_GetAscenderMontage");
static_assert(sizeof(GA_Athena_Ascender_Smash_C_GetAscenderMontage) == 0x000050, "Wrong size on GA_Athena_Ascender_Smash_C_GetAscenderMontage");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, Montage) == 0x000000, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::Montage' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, Temp_bool_Variable) == 0x000008, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, Temp_bool_Variable_1) == 0x000009, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, Temp_byte_Variable) == 0x00000A, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, CallFunc_IsPlayerUsingHandle_ReturnValue) == 0x00000B, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::CallFunc_IsPlayerUsingHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, CallFunc_GetCharacterGender_ReturnValue) == 0x000018, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::CallFunc_GetCharacterGender_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, CallFunc_GetSuitableMontage_ReturnValue) == 0x000020, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::CallFunc_GetSuitableMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, CallFunc_IsPlayerUsingHandle_ReturnValue_1) == 0x000029, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::CallFunc_IsPlayerUsingHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, K2Node_Select_Default) == 0x000030, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, CallFunc_IsPlayerUsingHandle_ReturnValue_2) == 0x000038, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::CallFunc_IsPlayerUsingHandle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, K2Node_Select_Default_1) == 0x000040, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_GetAscenderMontage, K2Node_Select_Default_2) == 0x000048, "Member 'GA_Athena_Ascender_Smash_C_GetAscenderMontage::K2Node_Select_Default_2' has a wrong offset!");

// Function GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C.HandleGameplayEventTag
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_Ascender_Smash_C_HandleGameplayEventTag final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_Ascender_Smash_C_HandleGameplayEventTag) == 0x000008, "Wrong alignment on GA_Athena_Ascender_Smash_C_HandleGameplayEventTag");
static_assert(sizeof(GA_Athena_Ascender_Smash_C_HandleGameplayEventTag) == 0x0000B0, "Wrong size on GA_Athena_Ascender_Smash_C_HandleGameplayEventTag");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_HandleGameplayEventTag, EventData) == 0x000000, "Member 'GA_Athena_Ascender_Smash_C_HandleGameplayEventTag::EventData' has a wrong offset!");

// Function GA_Athena_Ascender_Smash.GA_Athena_Ascender_Smash_C.IsPlayerUsingHandle
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPawnUsingHandle_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle) == 0x000008, "Wrong alignment on GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle");
static_assert(sizeof(GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle) == 0x000018, "Wrong size on GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle, ReturnValue) == 0x000000, "Member 'GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle, CallFunc_GetPawnUsingHandle_ReturnValue) == 0x000008, "Member 'GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle::CallFunc_GetPawnUsingHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'GA_Athena_Ascender_Smash_C_IsPlayerUsingHandle::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

