#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GoalsPageGiftCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GoalsPageGiftCard.GoalsPageGiftCard_C
// 0x00F8 (0x04D0 - 0x03D8)
class UGoalsPageGiftCard_C final : public UAthenaGoalsPageGiftCard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               ActionContainer;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ChallengeDescription_Border;                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ChallengeDescription_Border2;                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ChallengeDescription_Border3;                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CompletionCheck_1;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       ContentSwitcher;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_140;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_717;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Disabled;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fade;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageContainer;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewBang;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Page_HasPendingQuests;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Page_NoPendingQuests;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Page_WaitTillTheEndOfTheMatch;                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PendingAmountBlock;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_HasNothingForDemand;                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_HasPendingQuestsForDemand;                // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_TimeForNextDemand;                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_WaitingMatchEnd;                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_StyleSize;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StatusContainer;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PendingGiftsAmount;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_QuestID;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Button_Regular_C*            WBP_UIKit_Button_Regular;                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             HoveredSound;                                      // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__GoalsPageGiftCard_WBP_UIKit_Button_Regular_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnSelectionChanged(const bool bSelected);
	void BP_SetDisabled(const bool bDisabled);
	void ExecuteUbergraph_GoalsPageGiftCard(int32 EntryPoint);
	void OnFailure_277DDB894DB25A16FC375A90CAF94631();
	void OnIgnored_277DDB894DB25A16FC375A90CAF94631();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnSuccess_277DDB894DB25A16FC375A90CAF94631();
	void PlaySelected();
	void PopulateHasAvailableQuests(const int32 PendingGiftsAmount);
	void PopulateJustCompletedQuestsDuringTheBattle();
	void PopulateNoAvailableQuests(const struct FTimespan& TimeRemainingForNextQuest);
	void PopulateWasDemandDuringTheBattle();
	void SequenceEvent__ENTRYPOINTGoalsPageGiftCard();
	void ShowNewBang(bool bEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GoalsPageGiftCard_C">();
	}
	static class UGoalsPageGiftCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGoalsPageGiftCard_C>();
	}
};
static_assert(alignof(UGoalsPageGiftCard_C) == 0x000008, "Wrong alignment on UGoalsPageGiftCard_C");
static_assert(sizeof(UGoalsPageGiftCard_C) == 0x0004D0, "Wrong size on UGoalsPageGiftCard_C");
static_assert(offsetof(UGoalsPageGiftCard_C, UberGraphFrame) == 0x0003D8, "Member 'UGoalsPageGiftCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Selected) == 0x0003E0, "Member 'UGoalsPageGiftCard_C::Selected' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Hovered) == 0x0003E8, "Member 'UGoalsPageGiftCard_C::Hovered' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, ActionContainer) == 0x0003F0, "Member 'UGoalsPageGiftCard_C::ActionContainer' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, ChallengeDescription_Border) == 0x0003F8, "Member 'UGoalsPageGiftCard_C::ChallengeDescription_Border' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, ChallengeDescription_Border2) == 0x000400, "Member 'UGoalsPageGiftCard_C::ChallengeDescription_Border2' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, ChallengeDescription_Border3) == 0x000408, "Member 'UGoalsPageGiftCard_C::ChallengeDescription_Border3' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, CompletionCheck_1) == 0x000410, "Member 'UGoalsPageGiftCard_C::CompletionCheck_1' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, ContentSwitcher) == 0x000418, "Member 'UGoalsPageGiftCard_C::ContentSwitcher' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Image) == 0x000420, "Member 'UGoalsPageGiftCard_C::Image' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Image_140) == 0x000428, "Member 'UGoalsPageGiftCard_C::Image_140' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Image_717) == 0x000430, "Member 'UGoalsPageGiftCard_C::Image_717' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Image_Disabled) == 0x000438, "Member 'UGoalsPageGiftCard_C::Image_Disabled' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Image_Fade) == 0x000440, "Member 'UGoalsPageGiftCard_C::Image_Fade' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, ImageContainer) == 0x000448, "Member 'UGoalsPageGiftCard_C::ImageContainer' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, NewBang) == 0x000450, "Member 'UGoalsPageGiftCard_C::NewBang' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Page_HasPendingQuests) == 0x000458, "Member 'UGoalsPageGiftCard_C::Page_HasPendingQuests' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Page_NoPendingQuests) == 0x000460, "Member 'UGoalsPageGiftCard_C::Page_NoPendingQuests' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Page_WaitTillTheEndOfTheMatch) == 0x000468, "Member 'UGoalsPageGiftCard_C::Page_WaitTillTheEndOfTheMatch' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, PendingAmountBlock) == 0x000470, "Member 'UGoalsPageGiftCard_C::PendingAmountBlock' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, RichText_HasNothingForDemand) == 0x000478, "Member 'UGoalsPageGiftCard_C::RichText_HasNothingForDemand' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, RichText_HasPendingQuestsForDemand) == 0x000480, "Member 'UGoalsPageGiftCard_C::RichText_HasPendingQuestsForDemand' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, RichText_TimeForNextDemand) == 0x000488, "Member 'UGoalsPageGiftCard_C::RichText_TimeForNextDemand' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, RichText_WaitingMatchEnd) == 0x000490, "Member 'UGoalsPageGiftCard_C::RichText_WaitingMatchEnd' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, SizeBox_StyleSize) == 0x000498, "Member 'UGoalsPageGiftCard_C::SizeBox_StyleSize' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, StatusContainer) == 0x0004A0, "Member 'UGoalsPageGiftCard_C::StatusContainer' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Text_PendingGiftsAmount) == 0x0004A8, "Member 'UGoalsPageGiftCard_C::Text_PendingGiftsAmount' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, Text_QuestID) == 0x0004B0, "Member 'UGoalsPageGiftCard_C::Text_QuestID' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, WBP_UIKit_Button_Regular) == 0x0004B8, "Member 'UGoalsPageGiftCard_C::WBP_UIKit_Button_Regular' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, NewVar) == 0x0004C0, "Member 'UGoalsPageGiftCard_C::NewVar' has a wrong offset!");
static_assert(offsetof(UGoalsPageGiftCard_C, HoveredSound) == 0x0004C8, "Member 'UGoalsPageGiftCard_C::HoveredSound' has a wrong offset!");

}

