#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HarmonixAudioReactivity

#include "Basic.hpp"

#include "HarmonixDsp_structs.hpp"


namespace SDK
{

// Enum HarmonixAudioReactivity.EHarmonixAudioAnalysisType
// NumValues: 0x0006
enum class EHarmonixAudioAnalysisType : uint8
{
	VUMeter                                  = 0,
	FFT                                      = 1,
	Waveform                                 = 2,
	Arbitrary                                = 3,
	Count                                    = 4,
	EHarmonixAudioAnalysisType_MAX           = 5,
};

// Enum HarmonixAudioReactivity.EHarmonixTextureFilterMode
// NumValues: 0x0005
enum class EHarmonixTextureFilterMode : uint8
{
	Point                                    = 0,
	Linear                                   = 1,
	Count                                    = 2,
	Invalid                                  = 3,
	EHarmonixTextureFilterMode_MAX           = 4,
};

// ScriptStruct HarmonixAudioReactivity.HarmonixAudioAnalyzerResults
// 0x0060 (0x0060 - 0x0000)
struct FHarmonixAudioAnalyzerResults final
{
public:
	struct FHarmonixVuMeterAnalyzerResults        VuMeterResults;                                    // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FHarmonixFFTAnalyzerResults            FFTResults;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FHarmonixWaveformAnalyzerResults       WaveformAnalyzerResults;                           // 0x0030(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<float>                                 ArbitraryTextureData;                              // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixAudioAnalyzerResults) == 0x000008, "Wrong alignment on FHarmonixAudioAnalyzerResults");
static_assert(sizeof(FHarmonixAudioAnalyzerResults) == 0x000060, "Wrong size on FHarmonixAudioAnalyzerResults");
static_assert(offsetof(FHarmonixAudioAnalyzerResults, VuMeterResults) == 0x000000, "Member 'FHarmonixAudioAnalyzerResults::VuMeterResults' has a wrong offset!");
static_assert(offsetof(FHarmonixAudioAnalyzerResults, FFTResults) == 0x000020, "Member 'FHarmonixAudioAnalyzerResults::FFTResults' has a wrong offset!");
static_assert(offsetof(FHarmonixAudioAnalyzerResults, WaveformAnalyzerResults) == 0x000030, "Member 'FHarmonixAudioAnalyzerResults::WaveformAnalyzerResults' has a wrong offset!");
static_assert(offsetof(FHarmonixAudioAnalyzerResults, ArbitraryTextureData) == 0x000050, "Member 'FHarmonixAudioAnalyzerResults::ArbitraryTextureData' has a wrong offset!");

// ScriptStruct HarmonixAudioReactivity.HarmonixAudioAnalyzerSettings
// 0x0050 (0x0050 - 0x0000)
struct FHarmonixAudioAnalyzerSettings final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHarmonixVuMeterAnalyzerSettings       VuMeterSettings;                                   // 0x0004(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FHarmonixFFTAnalyzerSettings           FFTAnalyzerSettings;                               // 0x001C(0x0024)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FHarmonixWaveformAnalyzerSettings      WaveformAnalyzerSettings;                          // 0x0040(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHarmonixAudioAnalyzerSettings) == 0x000004, "Wrong alignment on FHarmonixAudioAnalyzerSettings");
static_assert(sizeof(FHarmonixAudioAnalyzerSettings) == 0x000050, "Wrong size on FHarmonixAudioAnalyzerSettings");
static_assert(offsetof(FHarmonixAudioAnalyzerSettings, Name) == 0x000000, "Member 'FHarmonixAudioAnalyzerSettings::Name' has a wrong offset!");
static_assert(offsetof(FHarmonixAudioAnalyzerSettings, VuMeterSettings) == 0x000004, "Member 'FHarmonixAudioAnalyzerSettings::VuMeterSettings' has a wrong offset!");
static_assert(offsetof(FHarmonixAudioAnalyzerSettings, FFTAnalyzerSettings) == 0x00001C, "Member 'FHarmonixAudioAnalyzerSettings::FFTAnalyzerSettings' has a wrong offset!");
static_assert(offsetof(FHarmonixAudioAnalyzerSettings, WaveformAnalyzerSettings) == 0x000040, "Member 'FHarmonixAudioAnalyzerSettings::WaveformAnalyzerSettings' has a wrong offset!");

}

