#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoMusicRuntime

#include "Basic.hpp"

#include "MetasoundFrontend_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "JunoMusicRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class JunoMusicRuntime.ActiveJunoMusicPlayer
// 0x0188 (0x01B0 - 0x0028)
class UActiveJunoMusicPlayer final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CooldownTimer;                                     // 0x0088(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundBase*>                     LoadedMusicAssets;                                 // 0x00A0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UJunoMusicPlaylistDataAsset>> JunoMusicElementsToCreate;                         // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoActiveMusicElementController_Base* PlayingActiveMusicElementController;               // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoMusicPlaybackConditionsPool*       PlaybackConditionsPool;                            // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UJunoMusicPlaylistDataAsset*, struct FElementControllerArray> AllActiveMusicElementControllers;                  // 0x00F0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<class UJunoMusicPlaylistDataAsset*>    JunoMusicPlaylistCollection;                       // 0x0140(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UJunoActiveMusicCooldownGroup*> JunoMusicCooldownGroups;                           // 0x0160(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void OnActiveMusicElementControllerFinishedPlaying();
	void OnActiveMusicPlayerCooldownFinished();
	void OnDayNightPhaseChangeSignature(EFortDayPhase CurrentDayPhaseIn, EFortDayPhase PreviousDayPhaseIn, bool bAtCreationIn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActiveJunoMusicPlayer">();
	}
	static class UActiveJunoMusicPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveJunoMusicPlayer>();
	}
};
static_assert(alignof(UActiveJunoMusicPlayer) == 0x000008, "Wrong alignment on UActiveJunoMusicPlayer");
static_assert(sizeof(UActiveJunoMusicPlayer) == 0x0001B0, "Wrong size on UActiveJunoMusicPlayer");
static_assert(offsetof(UActiveJunoMusicPlayer, CooldownTimer) == 0x000088, "Member 'UActiveJunoMusicPlayer::CooldownTimer' has a wrong offset!");
static_assert(offsetof(UActiveJunoMusicPlayer, LoadedMusicAssets) == 0x0000A0, "Member 'UActiveJunoMusicPlayer::LoadedMusicAssets' has a wrong offset!");
static_assert(offsetof(UActiveJunoMusicPlayer, JunoMusicElementsToCreate) == 0x0000C0, "Member 'UActiveJunoMusicPlayer::JunoMusicElementsToCreate' has a wrong offset!");
static_assert(offsetof(UActiveJunoMusicPlayer, PlayingActiveMusicElementController) == 0x0000E0, "Member 'UActiveJunoMusicPlayer::PlayingActiveMusicElementController' has a wrong offset!");
static_assert(offsetof(UActiveJunoMusicPlayer, PlaybackConditionsPool) == 0x0000E8, "Member 'UActiveJunoMusicPlayer::PlaybackConditionsPool' has a wrong offset!");
static_assert(offsetof(UActiveJunoMusicPlayer, AllActiveMusicElementControllers) == 0x0000F0, "Member 'UActiveJunoMusicPlayer::AllActiveMusicElementControllers' has a wrong offset!");
static_assert(offsetof(UActiveJunoMusicPlayer, JunoMusicPlaylistCollection) == 0x000140, "Member 'UActiveJunoMusicPlayer::JunoMusicPlaylistCollection' has a wrong offset!");
static_assert(offsetof(UActiveJunoMusicPlayer, JunoMusicCooldownGroups) == 0x000160, "Member 'UActiveJunoMusicPlayer::JunoMusicCooldownGroups' has a wrong offset!");

// Class JunoMusicRuntime.GameFeatureAction_BindJunoMusicManagerToPostWorldInit
// 0x0010 (0x0038 - 0x0028)
class UGameFeatureAction_BindJunoMusicManagerToPostWorldInit final : public UGameFeatureAction
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_BindJunoMusicManagerToPostWorldInit">();
	}
	static class UGameFeatureAction_BindJunoMusicManagerToPostWorldInit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_BindJunoMusicManagerToPostWorldInit>();
	}
};
static_assert(alignof(UGameFeatureAction_BindJunoMusicManagerToPostWorldInit) == 0x000008, "Wrong alignment on UGameFeatureAction_BindJunoMusicManagerToPostWorldInit");
static_assert(sizeof(UGameFeatureAction_BindJunoMusicManagerToPostWorldInit) == 0x000038, "Wrong size on UGameFeatureAction_BindJunoMusicManagerToPostWorldInit");

// Class JunoMusicRuntime.GameFeatureAction_RegisterJunoMusicDataAggregatorSettings
// 0x0020 (0x0048 - 0x0028)
class UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings final : public UGameFeatureAction
{
public:
	TArray<struct FSoftObjectPath>                JunoMusicDataAggregatorSettings;                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterJunoMusicDataAggregatorSettings">();
	}
	static class UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings>();
	}
};
static_assert(alignof(UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings) == 0x000008, "Wrong alignment on UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings");
static_assert(sizeof(UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings) == 0x000048, "Wrong size on UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings");
static_assert(offsetof(UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings, JunoMusicDataAggregatorSettings) == 0x000028, "Member 'UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings::JunoMusicDataAggregatorSettings' has a wrong offset!");

// Class JunoMusicRuntime.GameFeatureAction_RegisterJunoMusicElementTable
// 0x0020 (0x0048 - 0x0028)
class UGameFeatureAction_RegisterJunoMusicElementTable final : public UGameFeatureAction
{
public:
	TArray<struct FSoftObjectPath>                JunoMusicElementDataTables;                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterJunoMusicElementTable">();
	}
	static class UGameFeatureAction_RegisterJunoMusicElementTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterJunoMusicElementTable>();
	}
};
static_assert(alignof(UGameFeatureAction_RegisterJunoMusicElementTable) == 0x000008, "Wrong alignment on UGameFeatureAction_RegisterJunoMusicElementTable");
static_assert(sizeof(UGameFeatureAction_RegisterJunoMusicElementTable) == 0x000048, "Wrong size on UGameFeatureAction_RegisterJunoMusicElementTable");
static_assert(offsetof(UGameFeatureAction_RegisterJunoMusicElementTable, JunoMusicElementDataTables) == 0x000028, "Member 'UGameFeatureAction_RegisterJunoMusicElementTable::JunoMusicElementDataTables' has a wrong offset!");

// Class JunoMusicRuntime.GameFeatureAction_RegisterJunoMusicPlayspaceProbes
// 0x0020 (0x0048 - 0x0028)
class UGameFeatureAction_RegisterJunoMusicPlayspaceProbes final : public UGameFeatureAction
{
public:
	TArray<struct FSoftObjectPath>                JunoMusicProbesDataAssets;                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterJunoMusicPlayspaceProbes">();
	}
	static class UGameFeatureAction_RegisterJunoMusicPlayspaceProbes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterJunoMusicPlayspaceProbes>();
	}
};
static_assert(alignof(UGameFeatureAction_RegisterJunoMusicPlayspaceProbes) == 0x000008, "Wrong alignment on UGameFeatureAction_RegisterJunoMusicPlayspaceProbes");
static_assert(sizeof(UGameFeatureAction_RegisterJunoMusicPlayspaceProbes) == 0x000048, "Wrong size on UGameFeatureAction_RegisterJunoMusicPlayspaceProbes");
static_assert(offsetof(UGameFeatureAction_RegisterJunoMusicPlayspaceProbes, JunoMusicProbesDataAssets) == 0x000028, "Member 'UGameFeatureAction_RegisterJunoMusicPlayspaceProbes::JunoMusicProbesDataAssets' has a wrong offset!");

// Class JunoMusicRuntime.JunoActiveMusicCue
// 0x0098 (0x00C0 - 0x0028)
class UJunoActiveMusicCue final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundBase*                             LoadedMusic;                                       // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetasoundGeneratorHandle*              MetasoundGeneratorHandle;                          // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x40];                                      // 0x0080(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicCue">();
	}
	static class UJunoActiveMusicCue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicCue>();
	}
};
static_assert(alignof(UJunoActiveMusicCue) == 0x000008, "Wrong alignment on UJunoActiveMusicCue");
static_assert(sizeof(UJunoActiveMusicCue) == 0x0000C0, "Wrong size on UJunoActiveMusicCue");
static_assert(offsetof(UJunoActiveMusicCue, AudioComponent) == 0x000058, "Member 'UJunoActiveMusicCue::AudioComponent' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicCue, LoadedMusic) == 0x000060, "Member 'UJunoActiveMusicCue::LoadedMusic' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicCue, MetasoundGeneratorHandle) == 0x000078, "Member 'UJunoActiveMusicCue::MetasoundGeneratorHandle' has a wrong offset!");

// Class JunoMusicRuntime.JunoActiveMusicCooldownGroup
// 0x0030 (0x0058 - 0x0028)
class UJunoActiveMusicCooldownGroup final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CooldownTimer;                                     // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicCooldownGroup">();
	}
	static class UJunoActiveMusicCooldownGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicCooldownGroup>();
	}
};
static_assert(alignof(UJunoActiveMusicCooldownGroup) == 0x000008, "Wrong alignment on UJunoActiveMusicCooldownGroup");
static_assert(sizeof(UJunoActiveMusicCooldownGroup) == 0x000058, "Wrong size on UJunoActiveMusicCooldownGroup");
static_assert(offsetof(UJunoActiveMusicCooldownGroup, CooldownTimer) == 0x000038, "Member 'UJunoActiveMusicCooldownGroup::CooldownTimer' has a wrong offset!");

// Class JunoMusicRuntime.JunoActiveMusicElement_Base
// 0x00C8 (0x00F0 - 0x0028)
class UJunoActiveMusicElement_Base : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoMusicPlaylistElement              JunoMusicPlaylistElement;                          // 0x0038(0x00B8)(Transient, NativeAccessSpecifierPublic)

public:
	void OnFinishedPlaying();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElement_Base">();
	}
	static class UJunoActiveMusicElement_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElement_Base>();
	}
};
static_assert(alignof(UJunoActiveMusicElement_Base) == 0x000008, "Wrong alignment on UJunoActiveMusicElement_Base");
static_assert(sizeof(UJunoActiveMusicElement_Base) == 0x0000F0, "Wrong size on UJunoActiveMusicElement_Base");
static_assert(offsetof(UJunoActiveMusicElement_Base, JunoMusicPlaylistElement) == 0x000038, "Member 'UJunoActiveMusicElement_Base::JunoMusicPlaylistElement' has a wrong offset!");

// Class JunoMusicRuntime.JunoActiveMusicElement_AudioComponent
// 0x0038 (0x0128 - 0x00F0)
class UJunoActiveMusicElement_AudioComponent final : public UJunoActiveMusicElement_Base
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             Music;                                             // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x18];                                     // 0x0100(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetasoundGeneratorHandle*              MetasoundGeneratorHandle;                          // 0x0118(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElement_AudioComponent">();
	}
	static class UJunoActiveMusicElement_AudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElement_AudioComponent>();
	}
};
static_assert(alignof(UJunoActiveMusicElement_AudioComponent) == 0x000008, "Wrong alignment on UJunoActiveMusicElement_AudioComponent");
static_assert(sizeof(UJunoActiveMusicElement_AudioComponent) == 0x000128, "Wrong size on UJunoActiveMusicElement_AudioComponent");
static_assert(offsetof(UJunoActiveMusicElement_AudioComponent, AudioComponent) == 0x0000F0, "Member 'UJunoActiveMusicElement_AudioComponent::AudioComponent' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicElement_AudioComponent, Music) == 0x0000F8, "Member 'UJunoActiveMusicElement_AudioComponent::Music' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicElement_AudioComponent, MetasoundGeneratorHandle) == 0x000118, "Member 'UJunoActiveMusicElement_AudioComponent::MetasoundGeneratorHandle' has a wrong offset!");

// Class JunoMusicRuntime.JunoActiveMusicElementController_Base
// 0x00E8 (0x0110 - 0x0028)
class UJunoActiveMusicElementController_Base : public UObject
{
public:
	struct FTimerHandle                           CooldownTimer;                                     // 0x0028(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SchedulingTimer;                                   // 0x0040(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             OnJunoActiveMusicElementControllerFinishedPlaying; // 0x0058(0x000C)(ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x1C];                                      // 0x0064(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	EJunoActiveMusicElementState                  JunoActiveMusicElementState;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoActiveMusicElement_Base*           JunoActiveMusicElement;                            // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UJunoMusicPlaybackCondition>> JunoMusicPlaybackConditions;                       // 0x0090(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CooldownGroups;                                    // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x40];                                      // 0x00D0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_Base">();
	}
	static class UJunoActiveMusicElementController_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_Base>();
	}
};
static_assert(alignof(UJunoActiveMusicElementController_Base) == 0x000008, "Wrong alignment on UJunoActiveMusicElementController_Base");
static_assert(sizeof(UJunoActiveMusicElementController_Base) == 0x000110, "Wrong size on UJunoActiveMusicElementController_Base");
static_assert(offsetof(UJunoActiveMusicElementController_Base, CooldownTimer) == 0x000028, "Member 'UJunoActiveMusicElementController_Base::CooldownTimer' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicElementController_Base, SchedulingTimer) == 0x000040, "Member 'UJunoActiveMusicElementController_Base::SchedulingTimer' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicElementController_Base, OnJunoActiveMusicElementControllerFinishedPlaying) == 0x000058, "Member 'UJunoActiveMusicElementController_Base::OnJunoActiveMusicElementControllerFinishedPlaying' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicElementController_Base, JunoActiveMusicElementState) == 0x000080, "Member 'UJunoActiveMusicElementController_Base::JunoActiveMusicElementState' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicElementController_Base, JunoActiveMusicElement) == 0x000088, "Member 'UJunoActiveMusicElementController_Base::JunoActiveMusicElement' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicElementController_Base, JunoMusicPlaybackConditions) == 0x000090, "Member 'UJunoActiveMusicElementController_Base::JunoMusicPlaybackConditions' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicElementController_Base, CooldownGroups) == 0x0000C0, "Member 'UJunoActiveMusicElementController_Base::CooldownGroups' has a wrong offset!");

// Class JunoMusicRuntime.JunoActiveMusicElementController_DayPhaseOffset
// 0x0000 (0x0110 - 0x0110)
class UJunoActiveMusicElementController_DayPhaseOffset final : public UJunoActiveMusicElementController_Base
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_DayPhaseOffset">();
	}
	static class UJunoActiveMusicElementController_DayPhaseOffset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_DayPhaseOffset>();
	}
};
static_assert(alignof(UJunoActiveMusicElementController_DayPhaseOffset) == 0x000008, "Wrong alignment on UJunoActiveMusicElementController_DayPhaseOffset");
static_assert(sizeof(UJunoActiveMusicElementController_DayPhaseOffset) == 0x000110, "Wrong size on UJunoActiveMusicElementController_DayPhaseOffset");

// Class JunoMusicRuntime.JunoActiveMusicElementController_RandomTimeInDayPhase
// 0x0000 (0x0110 - 0x0110)
class UJunoActiveMusicElementController_RandomTimeInDayPhase final : public UJunoActiveMusicElementController_Base
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_RandomTimeInDayPhase">();
	}
	static class UJunoActiveMusicElementController_RandomTimeInDayPhase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_RandomTimeInDayPhase>();
	}
};
static_assert(alignof(UJunoActiveMusicElementController_RandomTimeInDayPhase) == 0x000008, "Wrong alignment on UJunoActiveMusicElementController_RandomTimeInDayPhase");
static_assert(sizeof(UJunoActiveMusicElementController_RandomTimeInDayPhase) == 0x000110, "Wrong size on UJunoActiveMusicElementController_RandomTimeInDayPhase");

// Class JunoMusicRuntime.JunoActiveMusicElementController_RandomTimeInDay
// 0x0010 (0x0120 - 0x0110)
class UJunoActiveMusicElementController_RandomTimeInDay final : public UJunoActiveMusicElementController_Base
{
public:
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_RandomTimeInDay">();
	}
	static class UJunoActiveMusicElementController_RandomTimeInDay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_RandomTimeInDay>();
	}
};
static_assert(alignof(UJunoActiveMusicElementController_RandomTimeInDay) == 0x000008, "Wrong alignment on UJunoActiveMusicElementController_RandomTimeInDay");
static_assert(sizeof(UJunoActiveMusicElementController_RandomTimeInDay) == 0x000120, "Wrong size on UJunoActiveMusicElementController_RandomTimeInDay");

// Class JunoMusicRuntime.JunoActiveMusicElementController_CustomBPCondition
// 0x0030 (0x0140 - 0x0110)
class UJunoActiveMusicElementController_CustomBPCondition final : public UJunoActiveMusicElementController_Base
{
public:
	struct FTimerHandle                           UpdateTimerHandle;                                 // 0x0110(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x20];                                     // 0x0118(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          RandomStream;                                      // 0x0138(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_CustomBPCondition">();
	}
	static class UJunoActiveMusicElementController_CustomBPCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_CustomBPCondition>();
	}
};
static_assert(alignof(UJunoActiveMusicElementController_CustomBPCondition) == 0x000008, "Wrong alignment on UJunoActiveMusicElementController_CustomBPCondition");
static_assert(sizeof(UJunoActiveMusicElementController_CustomBPCondition) == 0x000140, "Wrong size on UJunoActiveMusicElementController_CustomBPCondition");
static_assert(offsetof(UJunoActiveMusicElementController_CustomBPCondition, UpdateTimerHandle) == 0x000110, "Member 'UJunoActiveMusicElementController_CustomBPCondition::UpdateTimerHandle' has a wrong offset!");
static_assert(offsetof(UJunoActiveMusicElementController_CustomBPCondition, RandomStream) == 0x000138, "Member 'UJunoActiveMusicElementController_CustomBPCondition::RandomStream' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicControllerSubsystem
// 0x0040 (0x0070 - 0x0030)
class UJunoMusicControllerSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoMusicElementController*            MusicCueController;                                // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoMusicDataAggregator*               JunoMusicDataAggregator;                           // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PushMusicState(const struct FGameplayTag& InState);
	void PushMusicStates(const struct FGameplayTagContainer& InStates);
	void RemoveMusicState(const struct FGameplayTag& InState);

	bool GetCollectedBool(class FName ParameterName, ESetParamResult* Result) const;
	float GetCollectedFloat(class FName ParameterName, ESetParamResult* Result) const;
	int32 GetCollectedInt(class FName ParameterName, ESetParamResult* Result) const;
	class FString GetCollectedString(class FName ParameterName, ESetParamResult* Result) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicControllerSubsystem">();
	}
	static class UJunoMusicControllerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicControllerSubsystem>();
	}
};
static_assert(alignof(UJunoMusicControllerSubsystem) == 0x000008, "Wrong alignment on UJunoMusicControllerSubsystem");
static_assert(sizeof(UJunoMusicControllerSubsystem) == 0x000070, "Wrong size on UJunoMusicControllerSubsystem");
static_assert(offsetof(UJunoMusicControllerSubsystem, MusicCueController) == 0x000058, "Member 'UJunoMusicControllerSubsystem::MusicCueController' has a wrong offset!");
static_assert(offsetof(UJunoMusicControllerSubsystem, JunoMusicDataAggregator) == 0x000060, "Member 'UJunoMusicControllerSubsystem::JunoMusicDataAggregator' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicDataCollector
// 0x0000 (0x0028 - 0x0028)
class UJunoMusicDataCollector : public UObject
{
public:
	void BP_OnRegistered(class UMetasoundParameterPack* AggregatedData);
	void BP_OnUnregistered();
	void BP_OnUpdate(float DeltaSeconds, class UMetasoundParameterPack* AggregatedData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicDataCollector">();
	}
	static class UJunoMusicDataCollector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicDataCollector>();
	}
};
static_assert(alignof(UJunoMusicDataCollector) == 0x000008, "Wrong alignment on UJunoMusicDataCollector");
static_assert(sizeof(UJunoMusicDataCollector) == 0x000028, "Wrong size on UJunoMusicDataCollector");

// Class JunoMusicRuntime.JunoMusicDataAggregatorConfig
// 0x0010 (0x0040 - 0x0030)
class UJunoMusicDataAggregatorConfig final : public UPrimaryDataAsset
{
public:
	struct FJunoMusicDataAggregatorSettings       DataAggregatorSettings;                            // 0x0030(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicDataAggregatorConfig">();
	}
	static class UJunoMusicDataAggregatorConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicDataAggregatorConfig>();
	}
};
static_assert(alignof(UJunoMusicDataAggregatorConfig) == 0x000008, "Wrong alignment on UJunoMusicDataAggregatorConfig");
static_assert(sizeof(UJunoMusicDataAggregatorConfig) == 0x000040, "Wrong size on UJunoMusicDataAggregatorConfig");
static_assert(offsetof(UJunoMusicDataAggregatorConfig, DataAggregatorSettings) == 0x000030, "Member 'UJunoMusicDataAggregatorConfig::DataAggregatorSettings' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicDataAggregator
// 0x0038 (0x0060 - 0x0028)
class UJunoMusicDataAggregator final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoMusicDataCollector*>        DataCollectors;                                    // 0x0048(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMetasoundParameterPack*                AggregatedData;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicDataAggregator">();
	}
	static class UJunoMusicDataAggregator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicDataAggregator>();
	}
};
static_assert(alignof(UJunoMusicDataAggregator) == 0x000008, "Wrong alignment on UJunoMusicDataAggregator");
static_assert(sizeof(UJunoMusicDataAggregator) == 0x000060, "Wrong size on UJunoMusicDataAggregator");
static_assert(offsetof(UJunoMusicDataAggregator, DataCollectors) == 0x000048, "Member 'UJunoMusicDataAggregator::DataCollectors' has a wrong offset!");
static_assert(offsetof(UJunoMusicDataAggregator, AggregatedData) == 0x000058, "Member 'UJunoMusicDataAggregator::AggregatedData' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicDataCollector_Combat
// 0x0028 (0x0050 - 0x0028)
class UJunoMusicDataCollector_Combat final : public UJunoMusicDataCollector
{
public:
	TArray<class UFortGameplayDataTrackerComponent*> RegisteredDataTrackerComponents;                   // 0x0028(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           NumAggressiveEnemiesTag;                           // 0x0038(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IsInCombatParameterName;                           // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CombatThreatLevelParameterName;                    // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDebug;                                            // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetThreatLevelMultiplier(const float InThreatLevelMultiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicDataCollector_Combat">();
	}
	static class UJunoMusicDataCollector_Combat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicDataCollector_Combat>();
	}
};
static_assert(alignof(UJunoMusicDataCollector_Combat) == 0x000008, "Wrong alignment on UJunoMusicDataCollector_Combat");
static_assert(sizeof(UJunoMusicDataCollector_Combat) == 0x000050, "Wrong size on UJunoMusicDataCollector_Combat");
static_assert(offsetof(UJunoMusicDataCollector_Combat, RegisteredDataTrackerComponents) == 0x000028, "Member 'UJunoMusicDataCollector_Combat::RegisteredDataTrackerComponents' has a wrong offset!");
static_assert(offsetof(UJunoMusicDataCollector_Combat, NumAggressiveEnemiesTag) == 0x000038, "Member 'UJunoMusicDataCollector_Combat::NumAggressiveEnemiesTag' has a wrong offset!");
static_assert(offsetof(UJunoMusicDataCollector_Combat, IsInCombatParameterName) == 0x00003C, "Member 'UJunoMusicDataCollector_Combat::IsInCombatParameterName' has a wrong offset!");
static_assert(offsetof(UJunoMusicDataCollector_Combat, CombatThreatLevelParameterName) == 0x000040, "Member 'UJunoMusicDataCollector_Combat::CombatThreatLevelParameterName' has a wrong offset!");
static_assert(offsetof(UJunoMusicDataCollector_Combat, bDebug) == 0x000048, "Member 'UJunoMusicDataCollector_Combat::bDebug' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicElementController
// 0x0100 (0x0128 - 0x0028)
class UJunoMusicElementController final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDataTable*>                     ElementTables;                                     // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UJunoActiveMusicCue*> ActiveMusicElements;                               // 0x0048(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x90];                                      // 0x0098(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicElementController">();
	}
	static class UJunoMusicElementController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicElementController>();
	}
};
static_assert(alignof(UJunoMusicElementController) == 0x000008, "Wrong alignment on UJunoMusicElementController");
static_assert(sizeof(UJunoMusicElementController) == 0x000128, "Wrong size on UJunoMusicElementController");
static_assert(offsetof(UJunoMusicElementController, ElementTables) == 0x000038, "Member 'UJunoMusicElementController::ElementTables' has a wrong offset!");
static_assert(offsetof(UJunoMusicElementController, ActiveMusicElements) == 0x000048, "Member 'UJunoMusicElementController::ActiveMusicElements' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicManager
// 0x0168 (0x0198 - 0x0030)
class UJunoMusicManager final : public UGameInstanceSubsystem
{
public:
	TArray<class UJunoMusicPlaylistDataAsset*>    JunoMusicPlaylistCollections;                      // 0x0030(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class UWorld*, struct FJunoWorldMusicSystem> WorldMusicSystems;                                 // 0x0040(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x108];                                     // 0x0090(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddJunoMusicPlaylist(class UJunoMusicPlaylistDataAsset* JunoMusicPlaylist);
	void RemoveJunoMusicPlaylist(class UJunoMusicPlaylistDataAsset* JunoMusicPlaylist);
	void SetActiveJunoMusicManagerData(const struct FActiveJunoMusicManagerData& ActiveJunoMusicManagerDataIn);
	void SetSuspendActiveMusicPlayback(bool bSuspendPlayback, bool bStopCurrentlyPlayingMusic);
	void SetSuspendWorldActiveMusicPlayback(class UWorld* World, bool bSuspendPlayback, bool bStopCurrentlyPlayingMusic);
	void StartWorldMusicSystem(class UWorld* World);
	void StopWorldMusicSystem(class UWorld* World);

	bool GetCollectedBool(class UObject* WorldContextObject, class FName ParameterName, ESetParamResult* Result) const;
	float GetCollectedFloat(class UObject* WorldContextObject, class FName ParameterName, ESetParamResult* Result) const;
	int32 GetCollectedInt(class UObject* WorldContextObject, class FName ParameterName, ESetParamResult* Result) const;
	class FString GetCollectedString(class UObject* WorldContextObject, class FName ParameterName, ESetParamResult* Result) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicManager">();
	}
	static class UJunoMusicManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicManager>();
	}
};
static_assert(alignof(UJunoMusicManager) == 0x000008, "Wrong alignment on UJunoMusicManager");
static_assert(sizeof(UJunoMusicManager) == 0x000198, "Wrong size on UJunoMusicManager");
static_assert(offsetof(UJunoMusicManager, JunoMusicPlaylistCollections) == 0x000030, "Member 'UJunoMusicManager::JunoMusicPlaylistCollections' has a wrong offset!");
static_assert(offsetof(UJunoMusicManager, WorldMusicSystems) == 0x000040, "Member 'UJunoMusicManager::WorldMusicSystems' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicPlaybackConditionsPool
// 0x0010 (0x0038 - 0x0028)
class UJunoMusicPlaybackConditionsPool final : public UObject
{
public:
	TArray<class UJunoMusicPlaybackCondition*>    CachedPlaybackConditions;                          // 0x0028(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlaybackConditionsPool">();
	}
	static class UJunoMusicPlaybackConditionsPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlaybackConditionsPool>();
	}
};
static_assert(alignof(UJunoMusicPlaybackConditionsPool) == 0x000008, "Wrong alignment on UJunoMusicPlaybackConditionsPool");
static_assert(sizeof(UJunoMusicPlaybackConditionsPool) == 0x000038, "Wrong size on UJunoMusicPlaybackConditionsPool");
static_assert(offsetof(UJunoMusicPlaybackConditionsPool, CachedPlaybackConditions) == 0x000028, "Member 'UJunoMusicPlaybackConditionsPool::CachedPlaybackConditions' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicPlaybackCondition
// 0x0008 (0x0030 - 0x0028)
class UJunoMusicPlaybackCondition final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnRegistered();
	void BP_OnUnregistered();
	bool BP_ShouldPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlaybackCondition">();
	}
	static class UJunoMusicPlaybackCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlaybackCondition>();
	}
};
static_assert(alignof(UJunoMusicPlaybackCondition) == 0x000008, "Wrong alignment on UJunoMusicPlaybackCondition");
static_assert(sizeof(UJunoMusicPlaybackCondition) == 0x000030, "Wrong size on UJunoMusicPlaybackCondition");

// Class JunoMusicRuntime.JunoMusicPlaylistDataAsset
// 0x0078 (0x00A8 - 0x0030)
class UJunoMusicPlaylistDataAsset final : public UPrimaryDataAsset
{
public:
	struct FJunoMusicPlaylist                     JunoMusicPlaylist;                                 // 0x0030(0x0078)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlaylistDataAsset">();
	}
	static class UJunoMusicPlaylistDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlaylistDataAsset>();
	}
};
static_assert(alignof(UJunoMusicPlaylistDataAsset) == 0x000008, "Wrong alignment on UJunoMusicPlaylistDataAsset");
static_assert(sizeof(UJunoMusicPlaylistDataAsset) == 0x0000A8, "Wrong size on UJunoMusicPlaylistDataAsset");
static_assert(offsetof(UJunoMusicPlaylistDataAsset, JunoMusicPlaylist) == 0x000030, "Member 'UJunoMusicPlaylistDataAsset::JunoMusicPlaylist' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicPlayspaceProbe
// 0x0000 (0x0028 - 0x0028)
class UJunoMusicPlayspaceProbe : public UObject
{
public:
	void BP_OnRegistered();
	void BP_OnUnregistered();
	void BP_OnUpdate(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbe">();
	}
	static class UJunoMusicPlayspaceProbe* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbe>();
	}
};
static_assert(alignof(UJunoMusicPlayspaceProbe) == 0x000008, "Wrong alignment on UJunoMusicPlayspaceProbe");
static_assert(sizeof(UJunoMusicPlayspaceProbe) == 0x000028, "Wrong size on UJunoMusicPlayspaceProbe");

// Class JunoMusicRuntime.JunoMusicPlayspaceProbeSubsystem
// 0x0038 (0x0068 - 0x0030)
class UJunoMusicPlayspaceProbeSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoMusicPlayspaceProbe*>       DataProbes;                                        // 0x0058(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbeSubsystem">();
	}
	static class UJunoMusicPlayspaceProbeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbeSubsystem>();
	}
};
static_assert(alignof(UJunoMusicPlayspaceProbeSubsystem) == 0x000008, "Wrong alignment on UJunoMusicPlayspaceProbeSubsystem");
static_assert(sizeof(UJunoMusicPlayspaceProbeSubsystem) == 0x000068, "Wrong size on UJunoMusicPlayspaceProbeSubsystem");
static_assert(offsetof(UJunoMusicPlayspaceProbeSubsystem, DataProbes) == 0x000058, "Member 'UJunoMusicPlayspaceProbeSubsystem::DataProbes' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicPlayspaceProbeDataAsset
// 0x0010 (0x0040 - 0x0030)
class UJunoMusicPlayspaceProbeDataAsset final : public UPrimaryDataAsset
{
public:
	struct FJunoMusicPlayspaceProbeData           JunoMusicProbes;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbeDataAsset">();
	}
	static class UJunoMusicPlayspaceProbeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbeDataAsset>();
	}
};
static_assert(alignof(UJunoMusicPlayspaceProbeDataAsset) == 0x000008, "Wrong alignment on UJunoMusicPlayspaceProbeDataAsset");
static_assert(sizeof(UJunoMusicPlayspaceProbeDataAsset) == 0x000040, "Wrong size on UJunoMusicPlayspaceProbeDataAsset");
static_assert(offsetof(UJunoMusicPlayspaceProbeDataAsset, JunoMusicProbes) == 0x000030, "Member 'UJunoMusicPlayspaceProbeDataAsset::JunoMusicProbes' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicPlayspaceProbe_Combat
// 0x0010 (0x0038 - 0x0028)
class UJunoMusicPlayspaceProbe_Combat final : public UJunoMusicPlayspaceProbe
{
public:
	class FName                                   IsInCombatParameterName;                           // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           CombatMusicStateTag;                               // 0x002C(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbe_Combat">();
	}
	static class UJunoMusicPlayspaceProbe_Combat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbe_Combat>();
	}
};
static_assert(alignof(UJunoMusicPlayspaceProbe_Combat) == 0x000008, "Wrong alignment on UJunoMusicPlayspaceProbe_Combat");
static_assert(sizeof(UJunoMusicPlayspaceProbe_Combat) == 0x000038, "Wrong size on UJunoMusicPlayspaceProbe_Combat");
static_assert(offsetof(UJunoMusicPlayspaceProbe_Combat, IsInCombatParameterName) == 0x000028, "Member 'UJunoMusicPlayspaceProbe_Combat::IsInCombatParameterName' has a wrong offset!");
static_assert(offsetof(UJunoMusicPlayspaceProbe_Combat, CombatMusicStateTag) == 0x00002C, "Member 'UJunoMusicPlayspaceProbe_Combat::CombatMusicStateTag' has a wrong offset!");

// Class JunoMusicRuntime.JunoMusicPlayspaceProbe_Environment
// 0x0070 (0x0098 - 0x0028)
class UJunoMusicPlayspaceProbe_Environment final : public UJunoMusicPlayspaceProbe
{
public:
	uint8                                         Pad_28[0x70];                                      // 0x0028(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CacheFortPlayerPawn(class AFortPawn* NewPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbe_Environment">();
	}
	static class UJunoMusicPlayspaceProbe_Environment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbe_Environment>();
	}
};
static_assert(alignof(UJunoMusicPlayspaceProbe_Environment) == 0x000008, "Wrong alignment on UJunoMusicPlayspaceProbe_Environment");
static_assert(sizeof(UJunoMusicPlayspaceProbe_Environment) == 0x000098, "Wrong size on UJunoMusicPlayspaceProbe_Environment");

// Class JunoMusicRuntime.GameFeatureAction_AddJunoMusicPlaylist
// 0x0028 (0x0050 - 0x0028)
class UGameFeatureAction_AddJunoMusicPlaylist final : public UGameFeatureAction
{
public:
	struct FSoftObjectPath                        JunoMusicPlaylist;                                 // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddJunoMusicPlaylist">();
	}
	static class UGameFeatureAction_AddJunoMusicPlaylist* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddJunoMusicPlaylist>();
	}
};
static_assert(alignof(UGameFeatureAction_AddJunoMusicPlaylist) == 0x000008, "Wrong alignment on UGameFeatureAction_AddJunoMusicPlaylist");
static_assert(sizeof(UGameFeatureAction_AddJunoMusicPlaylist) == 0x000050, "Wrong size on UGameFeatureAction_AddJunoMusicPlaylist");
static_assert(offsetof(UGameFeatureAction_AddJunoMusicPlaylist, JunoMusicPlaylist) == 0x000028, "Member 'UGameFeatureAction_AddJunoMusicPlaylist::JunoMusicPlaylist' has a wrong offset!");

// Class JunoMusicRuntime.GameFeatureAction_SetActiveJunoMusicManagerData
// 0x0010 (0x0038 - 0x0028)
class UGameFeatureAction_SetActiveJunoMusicManagerData final : public UGameFeatureAction
{
public:
	struct FActiveJunoMusicManagerData            ActiveJunoMusicManagerData;                        // 0x0028(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_SetActiveJunoMusicManagerData">();
	}
	static class UGameFeatureAction_SetActiveJunoMusicManagerData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_SetActiveJunoMusicManagerData>();
	}
};
static_assert(alignof(UGameFeatureAction_SetActiveJunoMusicManagerData) == 0x000008, "Wrong alignment on UGameFeatureAction_SetActiveJunoMusicManagerData");
static_assert(sizeof(UGameFeatureAction_SetActiveJunoMusicManagerData) == 0x000038, "Wrong size on UGameFeatureAction_SetActiveJunoMusicManagerData");
static_assert(offsetof(UGameFeatureAction_SetActiveJunoMusicManagerData, ActiveJunoMusicManagerData) == 0x000028, "Member 'UGameFeatureAction_SetActiveJunoMusicManagerData::ActiveJunoMusicManagerData' has a wrong offset!");

}

