#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoBuildingCosmeticsUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "JunoBuildingCosmeticsUI_structs.hpp"


namespace SDK
{

// Class JunoBuildingCosmeticsUI.JunoBuildSetLockerCategoryConfig
// 0x0000 (0x0180 - 0x0180)
class UJunoBuildSetLockerCategoryConfig final : public UAthenaLockerCategoryConfig
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildSetLockerCategoryConfig">();
	}
	static class UJunoBuildSetLockerCategoryConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildSetLockerCategoryConfig>();
	}
};
static_assert(alignof(UJunoBuildSetLockerCategoryConfig) == 0x000008, "Wrong alignment on UJunoBuildSetLockerCategoryConfig");
static_assert(sizeof(UJunoBuildSetLockerCategoryConfig) == 0x000180, "Wrong size on UJunoBuildSetLockerCategoryConfig");

// Class JunoBuildingCosmeticsUI.JunoPropBundleLockerCategoryConfig
// 0x0000 (0x0180 - 0x0180)
class UJunoPropBundleLockerCategoryConfig final : public UAthenaLockerCategoryConfig
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPropBundleLockerCategoryConfig">();
	}
	static class UJunoPropBundleLockerCategoryConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPropBundleLockerCategoryConfig>();
	}
};
static_assert(alignof(UJunoPropBundleLockerCategoryConfig) == 0x000008, "Wrong alignment on UJunoPropBundleLockerCategoryConfig");
static_assert(sizeof(UJunoPropBundleLockerCategoryConfig) == 0x000180, "Wrong size on UJunoPropBundleLockerCategoryConfig");

// Class JunoBuildingCosmeticsUI.JunoLockerCategoryVM
// 0x0000 (0x01B0 - 0x01B0)
class UJunoLockerCategoryVM final : public UAthenaLockerCategoryVM
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLockerCategoryVM">();
	}
	static class UJunoLockerCategoryVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLockerCategoryVM>();
	}
};
static_assert(alignof(UJunoLockerCategoryVM) == 0x000008, "Wrong alignment on UJunoLockerCategoryVM");
static_assert(sizeof(UJunoLockerCategoryVM) == 0x0001B0, "Wrong size on UJunoLockerCategoryVM");

// Class JunoBuildingCosmeticsUI.JunoShopBuildSetVM
// 0x0000 (0x0110 - 0x0110)
class UJunoShopBuildSetVM final : public UAthenaItemVM
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoShopBuildSetVM">();
	}
	static class UJunoShopBuildSetVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoShopBuildSetVM>();
	}
};
static_assert(alignof(UJunoShopBuildSetVM) == 0x000008, "Wrong alignment on UJunoShopBuildSetVM");
static_assert(sizeof(UJunoShopBuildSetVM) == 0x000110, "Wrong size on UJunoShopBuildSetVM");

// Class JunoBuildingCosmeticsUI.JunoShopBuildSetItemDetailsVM
// 0x0040 (0x0400 - 0x03C0)
class UJunoShopBuildSetItemDetailsVM final : public UAthenaItemDetailsVM
{
public:
	uint8                                         Pad_3B8[0x20];                                     // 0x03B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoShopBuildPartInfo>         Parts;                                             // 0x03D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJunoShopBuildResourceRequirement> ResourceRequirements;                              // 0x03E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ForceUpdateItemDetails();

	TArray<class FText> GetFormattedPartList() const;
	int32 GetTotalPartCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoShopBuildSetItemDetailsVM">();
	}
	static class UJunoShopBuildSetItemDetailsVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoShopBuildSetItemDetailsVM>();
	}
};
static_assert(alignof(UJunoShopBuildSetItemDetailsVM) == 0x000010, "Wrong alignment on UJunoShopBuildSetItemDetailsVM");
static_assert(sizeof(UJunoShopBuildSetItemDetailsVM) == 0x000400, "Wrong size on UJunoShopBuildSetItemDetailsVM");
static_assert(offsetof(UJunoShopBuildSetItemDetailsVM, Parts) == 0x0003D8, "Member 'UJunoShopBuildSetItemDetailsVM::Parts' has a wrong offset!");
static_assert(offsetof(UJunoShopBuildSetItemDetailsVM, ResourceRequirements) == 0x0003E8, "Member 'UJunoShopBuildSetItemDetailsVM::ResourceRequirements' has a wrong offset!");

// Class JunoBuildingCosmeticsUI.JunoShopPropBundleVM
// 0x0000 (0x0110 - 0x0110)
class UJunoShopPropBundleVM final : public UAthenaItemVM
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoShopPropBundleVM">();
	}
	static class UJunoShopPropBundleVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoShopPropBundleVM>();
	}
};
static_assert(alignof(UJunoShopPropBundleVM) == 0x000008, "Wrong alignment on UJunoShopPropBundleVM");
static_assert(sizeof(UJunoShopPropBundleVM) == 0x000110, "Wrong size on UJunoShopPropBundleVM");

// Class JunoBuildingCosmeticsUI.JunoShopPropBundleItemDetailsVM
// 0x0020 (0x03E0 - 0x03C0)
class UJunoShopPropBundleItemDetailsVM final : public UAthenaItemDetailsVM
{
public:
	TArray<struct FJunoShopPropInfo>              Props;                                             // 0x03B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJunoShopBuildResourceRequirement> ResourceRequirements;                              // 0x03C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FText> GetPropNames() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoShopPropBundleItemDetailsVM">();
	}
	static class UJunoShopPropBundleItemDetailsVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoShopPropBundleItemDetailsVM>();
	}
};
static_assert(alignof(UJunoShopPropBundleItemDetailsVM) == 0x000010, "Wrong alignment on UJunoShopPropBundleItemDetailsVM");
static_assert(sizeof(UJunoShopPropBundleItemDetailsVM) == 0x0003E0, "Wrong size on UJunoShopPropBundleItemDetailsVM");
static_assert(offsetof(UJunoShopPropBundleItemDetailsVM, Props) == 0x0003B8, "Member 'UJunoShopPropBundleItemDetailsVM::Props' has a wrong offset!");
static_assert(offsetof(UJunoShopPropBundleItemDetailsVM, ResourceRequirements) == 0x0003C8, "Member 'UJunoShopPropBundleItemDetailsVM::ResourceRequirements' has a wrong offset!");

}

