#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoWheelsDemoRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AttachableWheelsRuntime_structs.hpp"
#include "AttachableWheelsRuntime_classes.hpp"


namespace SDK
{

// Class JunoWheelsDemoRuntime.JunoWheelActor
// 0x0150 (0x0478 - 0x0328)
class AJunoWheelActor final : public AAttachableWheel
{
public:
	uint8                                         Pad_328[0x88];                                     // 0x0328(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxSteerAngle;                                     // 0x03B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTorque;                                         // 0x03B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngularVelocity;                                // 0x03B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHealthSet*                         HealthSet;                                         // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAbilitySystemComponent*            AbilitySystemComponent;                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D0[0x18];                                     // 0x03D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  WheelGuid;                                         // 0x03E8(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemDefinitionBase*                    AssociatedItem;                                    // 0x0400(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAttachableWheelAttachData             LocalAttachData;                                   // 0x0408(0x0058)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ControlChannelTag_Steering;                        // 0x0460(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ControlChannelTag_Velocity;                        // 0x0464(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoControlChannelComponent*           ControlChannelComponent;                           // 0x0468(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 ActorRef;                                          // 0x0470(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool AttachToUsingCachedData(class UPrimitiveComponent* InAttachComponent);
	class AActor* GetActorRef();
	void HandleDamaged(float Damage, const struct FGameplayTagContainer& InTags, const struct FGameplayEffectContextHandle& EffectContext, class AController* EventInstigator, class AActor* DamageCauser);
	void HandleOutOfHealth(const float InDamage, const struct FGameplayTagContainer& InTags, const struct FGameplayEffectContextHandle& InEffectContext, class AController* InEventInstigator, class AActor* InDamageCauser);
	void OnHeldObjectPickedUp();
	void SetActorRef(class AActor* NewActorRef);
	void SetAngularVelocity(const float AngularVelocityPercent);
	void SetAssociatedItem(const class UItemDefinitionBase* ItemDefinition);
	void SetControlChannel_AngularVelocity(const struct FGameplayTag& InChannelTag);
	void SetControlChannel_SteerAngle(const struct FGameplayTag& InChannelTag);
	void SetSteerAngle(const float SteerAnglePercent);

	float GetHealth() const;
	float GetMaxHealth() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWheelActor">();
	}
	static class AJunoWheelActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoWheelActor>();
	}
};
static_assert(alignof(AJunoWheelActor) == 0x000008, "Wrong alignment on AJunoWheelActor");
static_assert(sizeof(AJunoWheelActor) == 0x000478, "Wrong size on AJunoWheelActor");
static_assert(offsetof(AJunoWheelActor, MaxSteerAngle) == 0x0003B0, "Member 'AJunoWheelActor::MaxSteerAngle' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, MaxTorque) == 0x0003B4, "Member 'AJunoWheelActor::MaxTorque' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, MaxAngularVelocity) == 0x0003B8, "Member 'AJunoWheelActor::MaxAngularVelocity' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, HealthSet) == 0x0003C0, "Member 'AJunoWheelActor::HealthSet' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, AbilitySystemComponent) == 0x0003C8, "Member 'AJunoWheelActor::AbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, WheelGuid) == 0x0003E8, "Member 'AJunoWheelActor::WheelGuid' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, AssociatedItem) == 0x000400, "Member 'AJunoWheelActor::AssociatedItem' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, LocalAttachData) == 0x000408, "Member 'AJunoWheelActor::LocalAttachData' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, ControlChannelTag_Steering) == 0x000460, "Member 'AJunoWheelActor::ControlChannelTag_Steering' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, ControlChannelTag_Velocity) == 0x000464, "Member 'AJunoWheelActor::ControlChannelTag_Velocity' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, ControlChannelComponent) == 0x000468, "Member 'AJunoWheelActor::ControlChannelComponent' has a wrong offset!");
static_assert(offsetof(AJunoWheelActor, ActorRef) == 0x000470, "Member 'AJunoWheelActor::ActorRef' has a wrong offset!");

}

