#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoBuildingCosmeticsUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function JunoBuildingCosmeticsUI.JunoShopBuildSetItemDetailsVM.GetFormattedPartList
// 0x0010 (0x0010 - 0x0000)
struct JunoShopBuildSetItemDetailsVM_GetFormattedPartList final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoShopBuildSetItemDetailsVM_GetFormattedPartList) == 0x000008, "Wrong alignment on JunoShopBuildSetItemDetailsVM_GetFormattedPartList");
static_assert(sizeof(JunoShopBuildSetItemDetailsVM_GetFormattedPartList) == 0x000010, "Wrong size on JunoShopBuildSetItemDetailsVM_GetFormattedPartList");
static_assert(offsetof(JunoShopBuildSetItemDetailsVM_GetFormattedPartList, ReturnValue) == 0x000000, "Member 'JunoShopBuildSetItemDetailsVM_GetFormattedPartList::ReturnValue' has a wrong offset!");

// Function JunoBuildingCosmeticsUI.JunoShopBuildSetItemDetailsVM.GetTotalPartCount
// 0x0004 (0x0004 - 0x0000)
struct JunoShopBuildSetItemDetailsVM_GetTotalPartCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoShopBuildSetItemDetailsVM_GetTotalPartCount) == 0x000004, "Wrong alignment on JunoShopBuildSetItemDetailsVM_GetTotalPartCount");
static_assert(sizeof(JunoShopBuildSetItemDetailsVM_GetTotalPartCount) == 0x000004, "Wrong size on JunoShopBuildSetItemDetailsVM_GetTotalPartCount");
static_assert(offsetof(JunoShopBuildSetItemDetailsVM_GetTotalPartCount, ReturnValue) == 0x000000, "Member 'JunoShopBuildSetItemDetailsVM_GetTotalPartCount::ReturnValue' has a wrong offset!");

// Function JunoBuildingCosmeticsUI.JunoShopPropBundleItemDetailsVM.GetPropNames
// 0x0010 (0x0010 - 0x0000)
struct JunoShopPropBundleItemDetailsVM_GetPropNames final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JunoShopPropBundleItemDetailsVM_GetPropNames) == 0x000008, "Wrong alignment on JunoShopPropBundleItemDetailsVM_GetPropNames");
static_assert(sizeof(JunoShopPropBundleItemDetailsVM_GetPropNames) == 0x000010, "Wrong size on JunoShopPropBundleItemDetailsVM_GetPropNames");
static_assert(offsetof(JunoShopPropBundleItemDetailsVM_GetPropNames, ReturnValue) == 0x000000, "Member 'JunoShopPropBundleItemDetailsVM_GetPropNames::ReturnValue' has a wrong offset!");

}

