#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoBuildingCosmeticsUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK
{

// ScriptStruct JunoBuildingCosmeticsUI.JunoShopBuildPartInfo
// 0x0020 (0x0020 - 0x0000)
struct FJunoShopBuildPartInfo final
{
public:
	class FText                                   PartName;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         PartQuantity;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJunoShopBuildPartInfo) == 0x000008, "Wrong alignment on FJunoShopBuildPartInfo");
static_assert(sizeof(FJunoShopBuildPartInfo) == 0x000020, "Wrong size on FJunoShopBuildPartInfo");
static_assert(offsetof(FJunoShopBuildPartInfo, PartName) == 0x000000, "Member 'FJunoShopBuildPartInfo::PartName' has a wrong offset!");
static_assert(offsetof(FJunoShopBuildPartInfo, PartQuantity) == 0x000018, "Member 'FJunoShopBuildPartInfo::PartQuantity' has a wrong offset!");

// ScriptStruct JunoBuildingCosmeticsUI.JunoShopPropInfo
// 0x0020 (0x0020 - 0x0000)
struct FJunoShopPropInfo final
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          IsInteractable;                                    // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJunoShopPropInfo) == 0x000008, "Wrong alignment on FJunoShopPropInfo");
static_assert(sizeof(FJunoShopPropInfo) == 0x000020, "Wrong size on FJunoShopPropInfo");
static_assert(offsetof(FJunoShopPropInfo, DisplayName) == 0x000000, "Member 'FJunoShopPropInfo::DisplayName' has a wrong offset!");
static_assert(offsetof(FJunoShopPropInfo, IsInteractable) == 0x000018, "Member 'FJunoShopPropInfo::IsInteractable' has a wrong offset!");

// ScriptStruct JunoBuildingCosmeticsUI.JunoShopBuildResourceRequirement
// 0x0040 (0x0040 - 0x0000)
struct FJunoShopBuildResourceRequirement final
{
public:
	TSoftObjectPtr<class UTexture2D>              ResourceImage;                                     // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ResourceName;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         ResourceQuantity;                                  // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortRarity                                   ResourceRarity;                                    // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJunoShopBuildResourceRequirement) == 0x000008, "Wrong alignment on FJunoShopBuildResourceRequirement");
static_assert(sizeof(FJunoShopBuildResourceRequirement) == 0x000040, "Wrong size on FJunoShopBuildResourceRequirement");
static_assert(offsetof(FJunoShopBuildResourceRequirement, ResourceImage) == 0x000000, "Member 'FJunoShopBuildResourceRequirement::ResourceImage' has a wrong offset!");
static_assert(offsetof(FJunoShopBuildResourceRequirement, ResourceName) == 0x000020, "Member 'FJunoShopBuildResourceRequirement::ResourceName' has a wrong offset!");
static_assert(offsetof(FJunoShopBuildResourceRequirement, ResourceQuantity) == 0x000038, "Member 'FJunoShopBuildResourceRequirement::ResourceQuantity' has a wrong offset!");
static_assert(offsetof(FJunoShopBuildResourceRequirement, ResourceRarity) == 0x00003C, "Member 'FJunoShopBuildResourceRequirement::ResourceRarity' has a wrong offset!");

}

