#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LearningAgents

#include "Basic.hpp"

#include "LearningAgents_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LearningAgents.LearningAgentsActions.GetAngleAction
// 0x0080 (0x0080 - 0x0000)
struct LearningAgentsActions_GetAngleAction final
{
public:
	float                                         OutAngle;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelativeAngle;                                     // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleScale;                                        // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualLoggerEnabled;                              // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULearningAgentsManagerListener*         VisualLoggerListener;                              // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisualLoggerAgentId;                               // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VisualLoggerAngleLocation;                         // 0x0038(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VisualLoggerLocation;                              // 0x0050(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VisualLoggerColor;                                 // 0x0068(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetAngleAction) == 0x000008, "Wrong alignment on LearningAgentsActions_GetAngleAction");
static_assert(sizeof(LearningAgentsActions_GetAngleAction) == 0x000080, "Wrong size on LearningAgentsActions_GetAngleAction");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, OutAngle) == 0x000000, "Member 'LearningAgentsActions_GetAngleAction::OutAngle' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, Object) == 0x000008, "Member 'LearningAgentsActions_GetAngleAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, Element) == 0x000010, "Member 'LearningAgentsActions_GetAngleAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, RelativeAngle) == 0x000018, "Member 'LearningAgentsActions_GetAngleAction::RelativeAngle' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, AngleScale) == 0x00001C, "Member 'LearningAgentsActions_GetAngleAction::AngleScale' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, Tag) == 0x000020, "Member 'LearningAgentsActions_GetAngleAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, bVisualLoggerEnabled) == 0x000024, "Member 'LearningAgentsActions_GetAngleAction::bVisualLoggerEnabled' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, VisualLoggerListener) == 0x000028, "Member 'LearningAgentsActions_GetAngleAction::VisualLoggerListener' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, VisualLoggerAgentId) == 0x000030, "Member 'LearningAgentsActions_GetAngleAction::VisualLoggerAgentId' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, VisualLoggerAngleLocation) == 0x000038, "Member 'LearningAgentsActions_GetAngleAction::VisualLoggerAngleLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, VisualLoggerLocation) == 0x000050, "Member 'LearningAgentsActions_GetAngleAction::VisualLoggerLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, VisualLoggerColor) == 0x000068, "Member 'LearningAgentsActions_GetAngleAction::VisualLoggerColor' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleAction, ReturnValue) == 0x000078, "Member 'LearningAgentsActions_GetAngleAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetAngleActionRadians
// 0x0080 (0x0080 - 0x0000)
struct LearningAgentsActions_GetAngleActionRadians final
{
public:
	float                                         OutAngle;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelativeAngle;                                     // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleScale;                                        // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualLoggerEnabled;                              // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULearningAgentsManagerListener*         VisualLoggerListener;                              // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisualLoggerAgentId;                               // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VisualLoggerAngleLocation;                         // 0x0038(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VisualLoggerLocation;                              // 0x0050(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VisualLoggerColor;                                 // 0x0068(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetAngleActionRadians) == 0x000008, "Wrong alignment on LearningAgentsActions_GetAngleActionRadians");
static_assert(sizeof(LearningAgentsActions_GetAngleActionRadians) == 0x000080, "Wrong size on LearningAgentsActions_GetAngleActionRadians");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, OutAngle) == 0x000000, "Member 'LearningAgentsActions_GetAngleActionRadians::OutAngle' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, Object) == 0x000008, "Member 'LearningAgentsActions_GetAngleActionRadians::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, Element) == 0x000010, "Member 'LearningAgentsActions_GetAngleActionRadians::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, RelativeAngle) == 0x000018, "Member 'LearningAgentsActions_GetAngleActionRadians::RelativeAngle' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, AngleScale) == 0x00001C, "Member 'LearningAgentsActions_GetAngleActionRadians::AngleScale' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, Tag) == 0x000020, "Member 'LearningAgentsActions_GetAngleActionRadians::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, bVisualLoggerEnabled) == 0x000024, "Member 'LearningAgentsActions_GetAngleActionRadians::bVisualLoggerEnabled' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, VisualLoggerListener) == 0x000028, "Member 'LearningAgentsActions_GetAngleActionRadians::VisualLoggerListener' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, VisualLoggerAgentId) == 0x000030, "Member 'LearningAgentsActions_GetAngleActionRadians::VisualLoggerAgentId' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, VisualLoggerAngleLocation) == 0x000038, "Member 'LearningAgentsActions_GetAngleActionRadians::VisualLoggerAngleLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, VisualLoggerLocation) == 0x000050, "Member 'LearningAgentsActions_GetAngleActionRadians::VisualLoggerLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, VisualLoggerColor) == 0x000068, "Member 'LearningAgentsActions_GetAngleActionRadians::VisualLoggerColor' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetAngleActionRadians, ReturnValue) == 0x000078, "Member 'LearningAgentsActions_GetAngleActionRadians::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetBitmaskAction
// 0x0068 (0x0068 - 0x0000)
struct LearningAgentsActions_GetBitmaskAction final
{
public:
	int32                                         OutBitmaskValue;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UEnum*                            Enum;                                              // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualLoggerEnabled;                              // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULearningAgentsManagerListener*         VisualLoggerListener;                              // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisualLoggerAgentId;                               // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VisualLoggerLocation;                              // 0x0038(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VisualLoggerColor;                                 // 0x0050(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetBitmaskAction) == 0x000008, "Wrong alignment on LearningAgentsActions_GetBitmaskAction");
static_assert(sizeof(LearningAgentsActions_GetBitmaskAction) == 0x000068, "Wrong size on LearningAgentsActions_GetBitmaskAction");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, OutBitmaskValue) == 0x000000, "Member 'LearningAgentsActions_GetBitmaskAction::OutBitmaskValue' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, Object) == 0x000008, "Member 'LearningAgentsActions_GetBitmaskAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, Element) == 0x000010, "Member 'LearningAgentsActions_GetBitmaskAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, Enum) == 0x000018, "Member 'LearningAgentsActions_GetBitmaskAction::Enum' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, Tag) == 0x000020, "Member 'LearningAgentsActions_GetBitmaskAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, bVisualLoggerEnabled) == 0x000024, "Member 'LearningAgentsActions_GetBitmaskAction::bVisualLoggerEnabled' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, VisualLoggerListener) == 0x000028, "Member 'LearningAgentsActions_GetBitmaskAction::VisualLoggerListener' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, VisualLoggerAgentId) == 0x000030, "Member 'LearningAgentsActions_GetBitmaskAction::VisualLoggerAgentId' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, VisualLoggerLocation) == 0x000038, "Member 'LearningAgentsActions_GetBitmaskAction::VisualLoggerLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, VisualLoggerColor) == 0x000050, "Member 'LearningAgentsActions_GetBitmaskAction::VisualLoggerColor' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBitmaskAction, ReturnValue) == 0x000060, "Member 'LearningAgentsActions_GetBitmaskAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetBoolAction
// 0x0060 (0x0060 - 0x0000)
struct LearningAgentsActions_GetBoolAction final
{
public:
	bool                                          bOutValue;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualLoggerEnabled;                              // 0x001C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULearningAgentsManagerListener*         VisualLoggerListener;                              // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisualLoggerAgentId;                               // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VisualLoggerLocation;                              // 0x0030(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VisualLoggerColor;                                 // 0x0048(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetBoolAction) == 0x000008, "Wrong alignment on LearningAgentsActions_GetBoolAction");
static_assert(sizeof(LearningAgentsActions_GetBoolAction) == 0x000060, "Wrong size on LearningAgentsActions_GetBoolAction");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, bOutValue) == 0x000000, "Member 'LearningAgentsActions_GetBoolAction::bOutValue' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, Object) == 0x000008, "Member 'LearningAgentsActions_GetBoolAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, Element) == 0x000010, "Member 'LearningAgentsActions_GetBoolAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, Tag) == 0x000018, "Member 'LearningAgentsActions_GetBoolAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, bVisualLoggerEnabled) == 0x00001C, "Member 'LearningAgentsActions_GetBoolAction::bVisualLoggerEnabled' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, VisualLoggerListener) == 0x000020, "Member 'LearningAgentsActions_GetBoolAction::VisualLoggerListener' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, VisualLoggerAgentId) == 0x000028, "Member 'LearningAgentsActions_GetBoolAction::VisualLoggerAgentId' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, VisualLoggerLocation) == 0x000030, "Member 'LearningAgentsActions_GetBoolAction::VisualLoggerLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, VisualLoggerColor) == 0x000048, "Member 'LearningAgentsActions_GetBoolAction::VisualLoggerColor' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetBoolAction, ReturnValue) == 0x000058, "Member 'LearningAgentsActions_GetBoolAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetContinuousAction
// 0x0068 (0x0068 - 0x0000)
struct LearningAgentsActions_GetContinuousAction final
{
public:
	TArray<float>                                 OutValues;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class ULearningAgentsActionObject*      Object;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0018(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualLoggerEnabled;                              // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULearningAgentsManagerListener*         VisualLoggerListener;                              // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisualLoggerAgentId;                               // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VisualLoggerLocation;                              // 0x0038(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VisualLoggerColor;                                 // 0x0050(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetContinuousAction) == 0x000008, "Wrong alignment on LearningAgentsActions_GetContinuousAction");
static_assert(sizeof(LearningAgentsActions_GetContinuousAction) == 0x000068, "Wrong size on LearningAgentsActions_GetContinuousAction");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, OutValues) == 0x000000, "Member 'LearningAgentsActions_GetContinuousAction::OutValues' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, Object) == 0x000010, "Member 'LearningAgentsActions_GetContinuousAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, Element) == 0x000018, "Member 'LearningAgentsActions_GetContinuousAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, Tag) == 0x000020, "Member 'LearningAgentsActions_GetContinuousAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, bVisualLoggerEnabled) == 0x000024, "Member 'LearningAgentsActions_GetContinuousAction::bVisualLoggerEnabled' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, VisualLoggerListener) == 0x000028, "Member 'LearningAgentsActions_GetContinuousAction::VisualLoggerListener' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, VisualLoggerAgentId) == 0x000030, "Member 'LearningAgentsActions_GetContinuousAction::VisualLoggerAgentId' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, VisualLoggerLocation) == 0x000038, "Member 'LearningAgentsActions_GetContinuousAction::VisualLoggerLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, VisualLoggerColor) == 0x000050, "Member 'LearningAgentsActions_GetContinuousAction::VisualLoggerColor' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousAction, ReturnValue) == 0x000060, "Member 'LearningAgentsActions_GetContinuousAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetContinuousActionNum
// 0x0020 (0x0020 - 0x0000)
struct LearningAgentsActions_GetContinuousActionNum final
{
public:
	int32                                         OutNum;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetContinuousActionNum) == 0x000008, "Wrong alignment on LearningAgentsActions_GetContinuousActionNum");
static_assert(sizeof(LearningAgentsActions_GetContinuousActionNum) == 0x000020, "Wrong size on LearningAgentsActions_GetContinuousActionNum");
static_assert(offsetof(LearningAgentsActions_GetContinuousActionNum, OutNum) == 0x000000, "Member 'LearningAgentsActions_GetContinuousActionNum::OutNum' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousActionNum, Object) == 0x000008, "Member 'LearningAgentsActions_GetContinuousActionNum::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousActionNum, Element) == 0x000010, "Member 'LearningAgentsActions_GetContinuousActionNum::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousActionNum, Tag) == 0x000018, "Member 'LearningAgentsActions_GetContinuousActionNum::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetContinuousActionNum, ReturnValue) == 0x00001C, "Member 'LearningAgentsActions_GetContinuousActionNum::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetDirectionAction
// 0x00F0 (0x00F0 - 0x0000)
struct LearningAgentsActions_GetDirectionAction final
{
public:
	struct FVector                                OutDirection;                                      // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULearningAgentsActionObject*      Object;                                            // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0020(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x0030(0x0060)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0090(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualLoggerEnabled;                              // 0x0094(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULearningAgentsManagerListener*         VisualLoggerListener;                              // 0x0098(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisualLoggerAgentId;                               // 0x00A0(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VisualLoggerDirectionLocation;                     // 0x00A8(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VisualLoggerLocation;                              // 0x00C0(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VisualLoggerArrowLength;                           // 0x00D8(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VisualLoggerColor;                                 // 0x00DC(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00EC(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetDirectionAction) == 0x000010, "Wrong alignment on LearningAgentsActions_GetDirectionAction");
static_assert(sizeof(LearningAgentsActions_GetDirectionAction) == 0x0000F0, "Wrong size on LearningAgentsActions_GetDirectionAction");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, OutDirection) == 0x000000, "Member 'LearningAgentsActions_GetDirectionAction::OutDirection' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, Object) == 0x000018, "Member 'LearningAgentsActions_GetDirectionAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, Element) == 0x000020, "Member 'LearningAgentsActions_GetDirectionAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, RelativeTransform) == 0x000030, "Member 'LearningAgentsActions_GetDirectionAction::RelativeTransform' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, Tag) == 0x000090, "Member 'LearningAgentsActions_GetDirectionAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, bVisualLoggerEnabled) == 0x000094, "Member 'LearningAgentsActions_GetDirectionAction::bVisualLoggerEnabled' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, VisualLoggerListener) == 0x000098, "Member 'LearningAgentsActions_GetDirectionAction::VisualLoggerListener' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, VisualLoggerAgentId) == 0x0000A0, "Member 'LearningAgentsActions_GetDirectionAction::VisualLoggerAgentId' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, VisualLoggerDirectionLocation) == 0x0000A8, "Member 'LearningAgentsActions_GetDirectionAction::VisualLoggerDirectionLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, VisualLoggerLocation) == 0x0000C0, "Member 'LearningAgentsActions_GetDirectionAction::VisualLoggerLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, VisualLoggerArrowLength) == 0x0000D8, "Member 'LearningAgentsActions_GetDirectionAction::VisualLoggerArrowLength' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, VisualLoggerColor) == 0x0000DC, "Member 'LearningAgentsActions_GetDirectionAction::VisualLoggerColor' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetDirectionAction, ReturnValue) == 0x0000EC, "Member 'LearningAgentsActions_GetDirectionAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetEitherAction
// 0x0028 (0x0028 - 0x0000)
struct LearningAgentsActions_GetEitherAction final
{
public:
	ELearningAgentsEitherAction                   OutEither;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLearningAgentsActionObjectElement     OutElement;                                        // 0x0004(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0018(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetEitherAction) == 0x000008, "Wrong alignment on LearningAgentsActions_GetEitherAction");
static_assert(sizeof(LearningAgentsActions_GetEitherAction) == 0x000028, "Wrong size on LearningAgentsActions_GetEitherAction");
static_assert(offsetof(LearningAgentsActions_GetEitherAction, OutEither) == 0x000000, "Member 'LearningAgentsActions_GetEitherAction::OutEither' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEitherAction, OutElement) == 0x000004, "Member 'LearningAgentsActions_GetEitherAction::OutElement' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEitherAction, Object) == 0x000010, "Member 'LearningAgentsActions_GetEitherAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEitherAction, Element) == 0x000018, "Member 'LearningAgentsActions_GetEitherAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEitherAction, Tag) == 0x000020, "Member 'LearningAgentsActions_GetEitherAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEitherAction, ReturnValue) == 0x000024, "Member 'LearningAgentsActions_GetEitherAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetEncodingAction
// 0x0020 (0x0020 - 0x0000)
struct LearningAgentsActions_GetEncodingAction final
{
public:
	struct FLearningAgentsActionObjectElement     OutElement;                                        // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULearningAgentsActionObject*      Object;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetEncodingAction) == 0x000008, "Wrong alignment on LearningAgentsActions_GetEncodingAction");
static_assert(sizeof(LearningAgentsActions_GetEncodingAction) == 0x000020, "Wrong size on LearningAgentsActions_GetEncodingAction");
static_assert(offsetof(LearningAgentsActions_GetEncodingAction, OutElement) == 0x000000, "Member 'LearningAgentsActions_GetEncodingAction::OutElement' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEncodingAction, Object) == 0x000008, "Member 'LearningAgentsActions_GetEncodingAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEncodingAction, Element) == 0x000010, "Member 'LearningAgentsActions_GetEncodingAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEncodingAction, Tag) == 0x000018, "Member 'LearningAgentsActions_GetEncodingAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEncodingAction, ReturnValue) == 0x00001C, "Member 'LearningAgentsActions_GetEncodingAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetEnumAction
// 0x0068 (0x0068 - 0x0000)
struct LearningAgentsActions_GetEnumAction final
{
public:
	uint8                                         OutEnumValue;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UEnum*                            Enum;                                              // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualLoggerEnabled;                              // 0x0024(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULearningAgentsManagerListener*         VisualLoggerListener;                              // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisualLoggerAgentId;                               // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VisualLoggerLocation;                              // 0x0038(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VisualLoggerColor;                                 // 0x0050(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetEnumAction) == 0x000008, "Wrong alignment on LearningAgentsActions_GetEnumAction");
static_assert(sizeof(LearningAgentsActions_GetEnumAction) == 0x000068, "Wrong size on LearningAgentsActions_GetEnumAction");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, OutEnumValue) == 0x000000, "Member 'LearningAgentsActions_GetEnumAction::OutEnumValue' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, Object) == 0x000008, "Member 'LearningAgentsActions_GetEnumAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, Element) == 0x000010, "Member 'LearningAgentsActions_GetEnumAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, Enum) == 0x000018, "Member 'LearningAgentsActions_GetEnumAction::Enum' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, Tag) == 0x000020, "Member 'LearningAgentsActions_GetEnumAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, bVisualLoggerEnabled) == 0x000024, "Member 'LearningAgentsActions_GetEnumAction::bVisualLoggerEnabled' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, VisualLoggerListener) == 0x000028, "Member 'LearningAgentsActions_GetEnumAction::VisualLoggerListener' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, VisualLoggerAgentId) == 0x000030, "Member 'LearningAgentsActions_GetEnumAction::VisualLoggerAgentId' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, VisualLoggerLocation) == 0x000038, "Member 'LearningAgentsActions_GetEnumAction::VisualLoggerLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, VisualLoggerColor) == 0x000050, "Member 'LearningAgentsActions_GetEnumAction::VisualLoggerColor' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetEnumAction, ReturnValue) == 0x000060, "Member 'LearningAgentsActions_GetEnumAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetExclusiveDiscreteAction
// 0x0060 (0x0060 - 0x0000)
struct LearningAgentsActions_GetExclusiveDiscreteAction final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualLoggerEnabled;                              // 0x001C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULearningAgentsManagerListener*         VisualLoggerListener;                              // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisualLoggerAgentId;                               // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VisualLoggerLocation;                              // 0x0030(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VisualLoggerColor;                                 // 0x0048(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetExclusiveDiscreteAction) == 0x000008, "Wrong alignment on LearningAgentsActions_GetExclusiveDiscreteAction");
static_assert(sizeof(LearningAgentsActions_GetExclusiveDiscreteAction) == 0x000060, "Wrong size on LearningAgentsActions_GetExclusiveDiscreteAction");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, OutIndex) == 0x000000, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::OutIndex' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, Object) == 0x000008, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, Element) == 0x000010, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, Tag) == 0x000018, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, bVisualLoggerEnabled) == 0x00001C, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::bVisualLoggerEnabled' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, VisualLoggerListener) == 0x000020, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::VisualLoggerListener' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, VisualLoggerAgentId) == 0x000028, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::VisualLoggerAgentId' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, VisualLoggerLocation) == 0x000030, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::VisualLoggerLocation' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, VisualLoggerColor) == 0x000048, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::VisualLoggerColor' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveDiscreteAction, ReturnValue) == 0x000058, "Member 'LearningAgentsActions_GetExclusiveDiscreteAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetExclusiveUnionAction
// 0x0028 (0x0028 - 0x0000)
struct LearningAgentsActions_GetExclusiveUnionAction final
{
public:
	class FName                                   OutElementName;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     OutElement;                                        // 0x0004(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0018(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LearningAgentsActions_GetExclusiveUnionAction) == 0x000008, "Wrong alignment on LearningAgentsActions_GetExclusiveUnionAction");
static_assert(sizeof(LearningAgentsActions_GetExclusiveUnionAction) == 0x000028, "Wrong size on LearningAgentsActions_GetExclusiveUnionAction");
static_assert(offsetof(LearningAgentsActions_GetExclusiveUnionAction, OutElementName) == 0x000000, "Member 'LearningAgentsActions_GetExclusiveUnionAction::OutElementName' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveUnionAction, OutElement) == 0x000004, "Member 'LearningAgentsActions_GetExclusiveUnionAction::OutElement' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveUnionAction, Object) == 0x000010, "Member 'LearningAgentsActions_GetExclusiveUnionAction::Object' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveUnionAction, Element) == 0x000018, "Member 'LearningAgentsActions_GetExclusiveUnionAction::Element' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveUnionAction, Tag) == 0x000020, "Member 'LearningAgentsActions_GetExclusiveUnionAction::Tag' has a wrong offset!");
static_assert(offsetof(LearningAgentsActions_GetExclusiveUnionAction, ReturnValue) == 0x000024, "Member 'LearningAgentsActions_GetExclusiveUnionAction::ReturnValue' has a wrong offset!");

// Function LearningAgents.LearningAgentsActions.GetFloatAction
// 0x0068 (0x0068 - 0x0000)
struct LearningAgentsActions_GetFloatAction final
{
public:
	float                                         OutValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULearningAgentsActionObject*      Object;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLearningAgentsActionObjectElement     Element;                                           // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatScale;                                        // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
