#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Learning

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Learning.LearningNeuralNetworkData
// 0x0038 (0x0060 - 0x0028)
class ULearningNeuralNetworkData final : public UObject
{
public:
	int32                                         InputSize;                                         // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         OutputSize;                                        // 0x002C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CompatibilityHash;                                 // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 FileData;                                          // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UNNEModelData*                          ModelData;                                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LearningNeuralNetworkData">();
	}
	static class ULearningNeuralNetworkData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULearningNeuralNetworkData>();
	}
};
static_assert(alignof(ULearningNeuralNetworkData) == 0x000008, "Wrong alignment on ULearningNeuralNetworkData");
static_assert(sizeof(ULearningNeuralNetworkData) == 0x000060, "Wrong size on ULearningNeuralNetworkData");
static_assert(offsetof(ULearningNeuralNetworkData, InputSize) == 0x000028, "Member 'ULearningNeuralNetworkData::InputSize' has a wrong offset!");
static_assert(offsetof(ULearningNeuralNetworkData, OutputSize) == 0x00002C, "Member 'ULearningNeuralNetworkData::OutputSize' has a wrong offset!");
static_assert(offsetof(ULearningNeuralNetworkData, CompatibilityHash) == 0x000030, "Member 'ULearningNeuralNetworkData::CompatibilityHash' has a wrong offset!");
static_assert(offsetof(ULearningNeuralNetworkData, FileData) == 0x000038, "Member 'ULearningNeuralNetworkData::FileData' has a wrong offset!");
static_assert(offsetof(ULearningNeuralNetworkData, ModelData) == 0x000048, "Member 'ULearningNeuralNetworkData::ModelData' has a wrong offset!");

}

