#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LearningAgents

#include "Basic.hpp"


namespace SDK
{

// Enum LearningAgents.ELearningAgentsEitherAction
// NumValues: 0x0003
enum class ELearningAgentsEitherAction : uint8
{
	A                                        = 0,
	B                                        = 1,
	ELearningAgentsEitherAction_MAX          = 2,
};

// Enum LearningAgents.ELearningAgentsOptionalAction
// NumValues: 0x0003
enum class ELearningAgentsOptionalAction : uint8
{
	Null                                     = 0,
	Valid                                    = 1,
	ELearningAgentsOptionalAction_MAX        = 2,
};

// Enum LearningAgents.ELearningAgentsActivationFunction
// NumValues: 0x0004
enum class ELearningAgentsActivationFunction : uint8
{
	ReLU                                     = 0,
	ELU                                      = 1,
	TanH                                     = 2,
	ELearningAgentsActivationFunction_MAX    = 3,
};

// Enum LearningAgents.ELearningAgentsEitherObservation
// NumValues: 0x0003
enum class ELearningAgentsEitherObservation : uint8
{
	A                                        = 0,
	B                                        = 1,
	ELearningAgentsEitherObservation_MAX     = 2,
};

// Enum LearningAgents.ELearningAgentsOptionalObservation
// NumValues: 0x0003
enum class ELearningAgentsOptionalObservation : uint8
{
	Null                                     = 0,
	Valid                                    = 1,
	ELearningAgentsOptionalObservation_MAX   = 2,
};

// ScriptStruct LearningAgents.LearningAgentsActionSchemaElement
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FLearningAgentsActionSchemaElement final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLearningAgentsActionSchemaElement) == 0x000004, "Wrong alignment on FLearningAgentsActionSchemaElement");
static_assert(sizeof(FLearningAgentsActionSchemaElement) == 0x000008, "Wrong size on FLearningAgentsActionSchemaElement");

// ScriptStruct LearningAgents.LearningAgentsActionObjectElement
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FLearningAgentsActionObjectElement final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLearningAgentsActionObjectElement) == 0x000004, "Wrong alignment on FLearningAgentsActionObjectElement");
static_assert(sizeof(FLearningAgentsActionObjectElement) == 0x000008, "Wrong size on FLearningAgentsActionObjectElement");

// ScriptStruct LearningAgents.LearningAgentsCriticSettings
// 0x000C (0x000C - 0x0000)
struct FLearningAgentsCriticSettings final
{
public:
	int32                                         HiddenLayerNum;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HiddenLayerSize;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELearningAgentsActivationFunction             ActivationFunction;                                // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLearningAgentsCriticSettings) == 0x000004, "Wrong alignment on FLearningAgentsCriticSettings");
static_assert(sizeof(FLearningAgentsCriticSettings) == 0x00000C, "Wrong size on FLearningAgentsCriticSettings");
static_assert(offsetof(FLearningAgentsCriticSettings, HiddenLayerNum) == 0x000000, "Member 'FLearningAgentsCriticSettings::HiddenLayerNum' has a wrong offset!");
static_assert(offsetof(FLearningAgentsCriticSettings, HiddenLayerSize) == 0x000004, "Member 'FLearningAgentsCriticSettings::HiddenLayerSize' has a wrong offset!");
static_assert(offsetof(FLearningAgentsCriticSettings, ActivationFunction) == 0x000008, "Member 'FLearningAgentsCriticSettings::ActivationFunction' has a wrong offset!");

// ScriptStruct LearningAgents.LearningAgentsObservationSchemaElement
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FLearningAgentsObservationSchemaElement final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLearningAgentsObservationSchemaElement) == 0x000004, "Wrong alignment on FLearningAgentsObservationSchemaElement");
static_assert(sizeof(FLearningAgentsObservationSchemaElement) == 0x000008, "Wrong size on FLearningAgentsObservationSchemaElement");

// ScriptStruct LearningAgents.LearningAgentsObservationObjectElement
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FLearningAgentsObservationObjectElement final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLearningAgentsObservationObjectElement) == 0x000004, "Wrong alignment on FLearningAgentsObservationObjectElement");
static_assert(sizeof(FLearningAgentsObservationObjectElement) == 0x000008, "Wrong size on FLearningAgentsObservationObjectElement");

// ScriptStruct LearningAgents.LearningAgentsPolicySettings
// 0x0018 (0x0018 - 0x0000)
struct FLearningAgentsPolicySettings final
{
public:
	int32                                         HiddenLayerNum;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HiddenLayerSize;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMemory;                                        // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MemoryStateSize;                                   // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialEncodedActionScale;                         // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELearningAgentsActivationFunction             ActivationFunction;                                // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLearningAgentsPolicySettings) == 0x000004, "Wrong alignment on FLearningAgentsPolicySettings");
static_assert(sizeof(FLearningAgentsPolicySettings) == 0x000018, "Wrong size on FLearningAgentsPolicySettings");
static_assert(offsetof(FLearningAgentsPolicySettings, HiddenLayerNum) == 0x000000, "Member 'FLearningAgentsPolicySettings::HiddenLayerNum' has a wrong offset!");
static_assert(offsetof(FLearningAgentsPolicySettings, HiddenLayerSize) == 0x000004, "Member 'FLearningAgentsPolicySettings::HiddenLayerSize' has a wrong offset!");
static_assert(offsetof(FLearningAgentsPolicySettings, bUseMemory) == 0x000008, "Member 'FLearningAgentsPolicySettings::bUseMemory' has a wrong offset!");
static_assert(offsetof(FLearningAgentsPolicySettings, MemoryStateSize) == 0x00000C, "Member 'FLearningAgentsPolicySettings::MemoryStateSize' has a wrong offset!");
static_assert(offsetof(FLearningAgentsPolicySettings, InitialEncodedActionScale) == 0x000010, "Member 'FLearningAgentsPolicySettings::InitialEncodedActionScale' has a wrong offset!");
static_assert(offsetof(FLearningAgentsPolicySettings, ActivationFunction) == 0x000014, "Member 'FLearningAgentsPolicySettings::ActivationFunction' has a wrong offset!");

}

