#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LearningAgentsTraining

#include "Basic.hpp"

#include "LearningAgentsTraining_structs.hpp"
#include "Engine_classes.hpp"
#include "LearningAgents_classes.hpp"


namespace SDK
{

// Class LearningAgentsTraining.LearningAgentsCompletions
// 0x0000 (0x0028 - 0x0028)
class ULearningAgentsCompletions final : public UBlueprintFunctionLibrary
{
public:
	static ELearningAgentsCompletion CompletionAnd(ELearningAgentsCompletion A, ELearningAgentsCompletion B);
	static ELearningAgentsCompletion CompletionNot(ELearningAgentsCompletion A, ELearningAgentsCompletion NotRunningType);
	static ELearningAgentsCompletion CompletionOr(ELearningAgentsCompletion A, ELearningAgentsCompletion B);
	static bool IsCompletionCompleted(const ELearningAgentsCompletion Completion);
	static bool IsCompletionRunning(const ELearningAgentsCompletion Completion);
	static bool IsCompletionTermination(const ELearningAgentsCompletion Completion);
	static bool IsCompletionTruncation(const ELearningAgentsCompletion Completion);
	static ELearningAgentsCompletion MakeCompletion(const ELearningAgentsCompletion CompletionType, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static ELearningAgentsCompletion MakeCompletionOnCondition(const bool bCondition, const ELearningAgentsCompletion CompletionType, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static ELearningAgentsCompletion MakeCompletionOnEpisodeStepsRecorded(const int32 EpisodeSteps, const int32 MaxEpisodeSteps, const ELearningAgentsCompletion CompletionType, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static ELearningAgentsCompletion MakeCompletionOnLocationDifferenceAboveThreshold(const struct FVector& LocationA, const struct FVector& LocationB, const float DistanceThreshold, const ELearningAgentsCompletion CompletionType, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static ELearningAgentsCompletion MakeCompletionOnLocationDifferenceBelowThreshold(const struct FVector& LocationA, const struct FVector& LocationB, const float DistanceThreshold, const ELearningAgentsCompletion CompletionType, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static ELearningAgentsCompletion MakeCompletionOnLocationOutsideBounds(const struct FVector& Location, const struct FTransform& BoundsTransform, const struct FVector& BoundsMins, const struct FVector& BoundsMaxs, const ELearningAgentsCompletion CompletionType, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static ELearningAgentsCompletion MakeCompletionOnTimeElapsed(const float Time, const float TimeThreshold, const ELearningAgentsCompletion CompletionType, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LearningAgentsCompletions">();
	}
	static class ULearningAgentsCompletions* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULearningAgentsCompletions>();
	}
};
static_assert(alignof(ULearningAgentsCompletions) == 0x000008, "Wrong alignment on ULearningAgentsCompletions");
static_assert(sizeof(ULearningAgentsCompletions) == 0x000028, "Wrong size on ULearningAgentsCompletions");

// Class LearningAgentsTraining.LearningAgentsImitationTrainer
// 0x0020 (0x00A8 - 0x0088)
class ULearningAgentsImitationTrainer final : public ULearningAgentsManagerListener
{
public:
	class ULearningAgentsInteractor*              Interactor;                                        // 0x0088(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULearningAgentsPolicy*                  Policy;                                            // 0x0090(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsTraining;                                       // 0x0098(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasTrainingFailed;                                // 0x0099(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9A[0xE];                                       // 0x009A(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULearningAgentsImitationTrainer* MakeImitationTrainer(class ULearningAgentsManager* InManager, class ULearningAgentsInteractor* InInteractor, class ULearningAgentsPolicy* InPolicy, TSubclassOf<class ULearningAgentsImitationTrainer> Class_0);

	void BeginTraining(const class ULearningAgentsRecording* Recording, const struct FLearningAgentsImitationTrainerSettings& ImitationTrainerSettings, const struct FLearningAgentsImitationTrainerTrainingSettings& ImitationTrainerTrainingSettings, const struct FLearningAgentsTrainerPathSettings& ImitationTrainerPathSettings);
	void EndTraining();
	void IterateTraining();
	void RunTraining(const class ULearningAgentsRecording* Recording, const struct FLearningAgentsImitationTrainerSettings& ImitationTrainerSettings, const struct FLearningAgentsImitationTrainerTrainingSettings& ImitationTrainerTrainingSettings, const struct FLearningAgentsTrainerPathSettings& ImitationTrainerPathSettings);

	bool HasTrainingFailed() const;
	bool IsTraining() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LearningAgentsImitationTrainer">();
	}
	static class ULearningAgentsImitationTrainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULearningAgentsImitationTrainer>();
	}
};
static_assert(alignof(ULearningAgentsImitationTrainer) == 0x000008, "Wrong alignment on ULearningAgentsImitationTrainer");
static_assert(sizeof(ULearningAgentsImitationTrainer) == 0x0000A8, "Wrong size on ULearningAgentsImitationTrainer");
static_assert(offsetof(ULearningAgentsImitationTrainer, Interactor) == 0x000088, "Member 'ULearningAgentsImitationTrainer::Interactor' has a wrong offset!");
static_assert(offsetof(ULearningAgentsImitationTrainer, Policy) == 0x000090, "Member 'ULearningAgentsImitationTrainer::Policy' has a wrong offset!");
static_assert(offsetof(ULearningAgentsImitationTrainer, bIsTraining) == 0x000098, "Member 'ULearningAgentsImitationTrainer::bIsTraining' has a wrong offset!");
static_assert(offsetof(ULearningAgentsImitationTrainer, bHasTrainingFailed) == 0x000099, "Member 'ULearningAgentsImitationTrainer::bHasTrainingFailed' has a wrong offset!");

// Class LearningAgentsTraining.LearningAgentsRecorder
// 0x4638 (0x46C0 - 0x0088)
class ULearningAgentsRecorder final : public ULearningAgentsManagerListener
{
public:
	class ULearningAgentsInteractor*              Interactor;                                        // 0x0088(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULearningAgentsRecording*               Recording;                                         // 0x0090(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsRecording;                                      // 0x0098(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_99[0x4627];                                    // 0x0099(0x4627)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULearningAgentsRecorder* MakeRecorder(class ULearningAgentsManager* InManager, class ULearningAgentsInteractor* InInteractor, TSubclassOf<class ULearningAgentsRecorder> Class_0, const class FName Name_0, const struct FLearningAgentsRecorderPathSettings& RecorderPathSettings, class ULearningAgentsRecording* RecordingAsset, bool bReinitializeRecording);

	void AddExperience();
	void BeginRecording();
	void EndRecording();
	void EndRecordingAndDiscard();
	void SetupRecorder(class ULearningAgentsManager* InManager, class ULearningAgentsInteractor* InInteractor, const struct FLearningAgentsRecorderPathSettings& RecorderPathSettings, class ULearningAgentsRecording* RecordingAsset, bool bReinitializeRecording);

	const class ULearningAgentsRecording* GetRecordingAsset() const;
	bool IsRecording() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LearningAgentsRecorder">();
	}
	static class ULearningAgentsRecorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULearningAgentsRecorder>();
	}
};
static_assert(alignof(ULearningAgentsRecorder) == 0x000008, "Wrong alignment on ULearningAgentsRecorder");
static_assert(sizeof(ULearningAgentsRecorder) == 0x0046C0, "Wrong size on ULearningAgentsRecorder");
static_assert(offsetof(ULearningAgentsRecorder, Interactor) == 0x000088, "Member 'ULearningAgentsRecorder::Interactor' has a wrong offset!");
static_assert(offsetof(ULearningAgentsRecorder, Recording) == 0x000090, "Member 'ULearningAgentsRecorder::Recording' has a wrong offset!");
static_assert(offsetof(ULearningAgentsRecorder, bIsRecording) == 0x000098, "Member 'ULearningAgentsRecorder::bIsRecording' has a wrong offset!");

// Class LearningAgentsTraining.LearningAgentsRecording
// 0x0010 (0x0040 - 0x0030)
class ULearningAgentsRecording final : public UDataAsset
{
public:
	TArray<struct FLearningAgentsRecord>          Records;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)

public:
	void AppendRecordingFromFile(const struct FFilePath& File);
	void AppendRecordingToAsset(class ULearningAgentsRecording* RecordingAsset);
	void GetActionVector(TArray<float>* OutActionVector, int32* OutActionCompatibilityHash, const int32 Record, const int32 Step);
	void GetObservationVector(TArray<float>* OutObservationVector, int32* OutObservationCompatibilityHash, const int32 Record, const int32 Step);
	void LoadRecordingFromAsset(class ULearningAgentsRecording* RecordingAsset);
	void LoadRecordingFromFile(const struct FFilePath& File);
	void ResetRecording();
	void SaveRecordingToAsset(class ULearningAgentsRecording* RecordingAsset);

	int32 GetRecordNum() const;
	int32 GetRecordStepNum(const int32 Record) const;
	void SaveRecordingToFile(const struct FFilePath& File) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LearningAgentsRecording">();
	}
	static class ULearningAgentsRecording* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULearningAgentsRecording>();
	}
};
static_assert(alignof(ULearningAgentsRecording) == 0x000008, "Wrong alignment on ULearningAgentsRecording");
static_assert(sizeof(ULearningAgentsRecording) == 0x000040, "Wrong size on ULearningAgentsRecording");
static_assert(offsetof(ULearningAgentsRecording, Records) == 0x000030, "Member 'ULearningAgentsRecording::Records' has a wrong offset!");

// Class LearningAgentsTraining.LearningAgentsRewards
// 0x0000 (0x0028 - 0x0028)
class ULearningAgentsRewards final : public UBlueprintFunctionLibrary
{
public:
	static float MakeReward(const float RewardValue, const float RewardScale, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static float MakeRewardFromAngleSimilarity(const float AngleA, const float AngleB, const float RewardScale, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerAngleLocationA, const struct FVector& VisualLoggerAngleLocationB, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static float MakeRewardFromDirectionSimilarity(const struct FVector& DirectionA, const struct FVector& DirectionB, const float RewardScale, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerDirectionLocationA, const struct FVector& VisualLoggerDirectionLocationB, const struct FVector& VisualLoggerLocation, const float VisualLoggerArrowLength, const struct FLinearColor& VisualLoggerColor);
	static float MakeRewardFromLocationSimilarity(const struct FVector& LocationA, const struct FVector& LocationB, const float LocationScale, const float RewardScale, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static float MakeRewardFromRotationSimilarity(const struct FRotator& RotationA, const struct FRotator& RotationB, const float RewardScale, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerRotationLocationA, const struct FVector& VisualLoggerRotationLocationB, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static float MakeRewardFromRotationSimilarityAsQuats(const struct FQuat& RotationA, const struct FQuat& RotationB, const float RewardScale, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerRotationLocationA, const struct FVector& VisualLoggerRotationLocationB, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static float MakeRewardFromVelocityAlongSpline(const class USplineComponent* SplineComponent, const struct FVector& Location, const struct FVector& Velocity, const float VelocityScale, const float RewardScale, const float FiniteDifferenceDelta, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static float MakeRewardOnCondition(const bool bCondition, const float RewardScale, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static float MakeRewardOnLocationDifferenceAboveThreshold(const struct FVector& LocationA, const struct FVector& LocationB, const float DistanceThreshold, const float RewardScale, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);
	static float MakeRewardOnLocationDifferenceBelowThreshold(const struct FVector& LocationA, const struct FVector& LocationB, const float DistanceThreshold, const float RewardScale, const class FName Tag, const bool bVisualLoggerEnabled, class ULearningAgentsManagerListener* VisualLoggerListener, const int32 VisualLoggerAgentId, const struct FVector& VisualLoggerLocation, const struct FLinearColor& VisualLoggerColor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LearningAgentsRewards">();
	}
	static class ULearningAgentsRewards* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULearningAgentsRewards>();
	}
};
static_assert(alignof(ULearningAgentsRewards) == 0x000008, "Wrong alignment on ULearningAgentsRewards");
static_assert(sizeof(ULearningAgentsRewards) == 0x000028, "Wrong size on ULearningAgentsRewards");

// Class LearningAgentsTraining.LearningAgentsTrainer
// 0x0348 (0x03D0 - 0x0088)
class ULearningAgentsTrainer final : public ULearningAgentsManagerListener
{
public:
	class ULearningAgentsInteractor*              Interactor;                                        // 0x0088(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULearningAgentsPolicy*                  Policy;                                            // 0x0090(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULearningAgentsCritic*                  Critic;                                            // 0x0098(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsTraining;                                       // 0x00A0(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasTrainingFailed;                                // 0x00A1(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A2[0x32E];                                     // 0x00A2(0x032E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULearningAgentsTrainer* MakeTrainer(class ULearningAgentsManager* InManager, class ULearningAgentsInteractor* InInteractor, class ULearningAgentsPolicy* InPolicy, class ULearningAgentsCritic* InCritic, TSubclassOf<class ULearningAgentsTrainer> Class_0, const class FName Name_0, const struct FLearningAgentsTrainerSettings& TrainerSettings);

	void BeginTraining(const struct FLearningAgentsTrainerTrainingSettings& TrainerTrainingSettings, const struct FLearningAgentsTrainerGameSettings& TrainerGameSettings, const struct FLearningAgentsTrainerPathSettings& TrainerPathSettings, const bool bResetAgentsOnBegin);
	void EndTraining();
	void GatherAgentCompletion(ELearningAgentsCompletion* OutCompletion, const int32 AgentId);
	void GatherAgentCompletions(TArray<ELearningAgentsCompletion>* OutCompletions, const TArray<int32>& AgentIds);
	void GatherAgentReward(float* OutReward, const int32 AgentId);
	void GatherAgentRewards(TArray<float>* OutRewards, const TArray<int32>& AgentIds);
	void GatherCompletions();
	void GatherRewards();
	void ProcessExperience(const bool bResetAgentsOnUpdate);
	void ResetAgentEpisode(const int32 AgentId);
	void ResetAgentEpisodes(const TArray<int32>& AgentIds);
	void RunTraining(const struct FLearningAgentsTrainerTrainingSettings& TrainerTrainingSettings, const struct FLearningAgentsTrainerGameSettings& TrainerGameSettings, const struct FLearningAgentsTrainerPathSettings& TrainerPathSettings, const bool bResetAgentsOnBegin, const bool bResetAgentsOnUpdate);
	void SetupTrainer(class ULearningAgentsManager* InManager, class ULearningAgentsInteractor* InInteractor, class ULearningAgentsPolicy* InPolicy, class ULearningAgentsCritic* InCritic, const struct FLearningAgentsTrainerSettings& TrainerSettings);

	ELearningAgentsCompletion GetCompletion(const int32 AgentId) const;
	int32 GetEpisodeStepNum(const int32 AgentId) const;
	float GetEpisodeTime(const int32 AgentId) const;
	float GetReward(const int32 AgentId) const;
	bool HasCompletion(const int32 AgentId) const;
	bool HasReward(const int32 AgentId) const;
	bool HasTrainingFailed() const;
	const bool IsTraining() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LearningAgentsTrainer">();
	}
	static class ULearningAgentsTrainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULearningAgentsTrainer>();
	}
};
static_assert(alignof(ULearningAgentsTrainer) == 0x000008, "Wrong alignment on ULearningAgentsTrainer");
static_assert(sizeof(ULearningAgentsTrainer) == 0x0003D0, "Wrong size on ULearningAgentsTrainer");
static_assert(offsetof(ULearningAgentsTrainer, Interactor) == 0x000088, "Member 'ULearningAgentsTrainer::Interactor' has a wrong offset!");
static_assert(offsetof(ULearningAgentsTrainer, Policy) == 0x000090, "Member 'ULearningAgentsTrainer::Policy' has a wrong offset!");
static_assert(offsetof(ULearningAgentsTrainer, Critic) == 0x000098, "Member 'ULearningAgentsTrainer::Critic' has a wrong offset!");
static_assert(offsetof(ULearningAgentsTrainer, bIsTraining) == 0x0000A0, "Member 'ULearningAgentsTrainer::bIsTraining' has a wrong offset!");
static_assert(offsetof(ULearningAgentsTrainer, bHasTrainingFailed) == 0x0000A1, "Member 'ULearningAgentsTrainer::bHasTrainingFailed' has a wrong offset!");

}

