#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveLinkHubMessaging

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum LiveLinkHubMessaging.ELiveLinkHubTimecodeSource
// NumValues: 0x0004
enum class ELiveLinkHubTimecodeSource : uint32
{
	NotDefined                               = 0,
	SystemTimeEditor                         = 1,
	UseSubjectName                           = 2,
	ELiveLinkHubTimecodeSource_MAX           = 3,
};

// Enum LiveLinkHubMessaging.ELiveLinkClientStatus
// NumValues: 0x0004
enum class ELiveLinkClientStatus : uint32
{
	Connected                                = 0,
	Disconnected                             = 1,
	Recording                                = 2,
	ELiveLinkClientStatus_MAX                = 3,
};

// ScriptStruct LiveLinkHubMessaging.LiveLinkHubTimecodeSettings
// 0x0010 (0x0010 - 0x0000)
struct FLiveLinkHubTimecodeSettings final
{
public:
	ELiveLinkHubTimecodeSource                    Source;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SubjectName;                                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             DesiredFrameRate;                                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLiveLinkHubTimecodeSettings) == 0x000004, "Wrong alignment on FLiveLinkHubTimecodeSettings");
static_assert(sizeof(FLiveLinkHubTimecodeSettings) == 0x000010, "Wrong size on FLiveLinkHubTimecodeSettings");
static_assert(offsetof(FLiveLinkHubTimecodeSettings, Source) == 0x000000, "Member 'FLiveLinkHubTimecodeSettings::Source' has a wrong offset!");
static_assert(offsetof(FLiveLinkHubTimecodeSettings, SubjectName) == 0x000004, "Member 'FLiveLinkHubTimecodeSettings::SubjectName' has a wrong offset!");
static_assert(offsetof(FLiveLinkHubTimecodeSettings, DesiredFrameRate) == 0x000008, "Member 'FLiveLinkHubTimecodeSettings::DesiredFrameRate' has a wrong offset!");

// ScriptStruct LiveLinkHubMessaging.LiveLinkClientInfoMessage
// 0x0050 (0x0050 - 0x0000)
struct FLiveLinkClientInfoMessage final
{
public:
	class FString                                 LongName;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELiveLinkClientStatus                         Status;                                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HostName;                                          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectName;                                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentLevel;                                      // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LiveLinkVersion;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLiveLinkClientInfoMessage) == 0x000008, "Wrong alignment on FLiveLinkClientInfoMessage");
static_assert(sizeof(FLiveLinkClientInfoMessage) == 0x000050, "Wrong size on FLiveLinkClientInfoMessage");
static_assert(offsetof(FLiveLinkClientInfoMessage, LongName) == 0x000000, "Member 'FLiveLinkClientInfoMessage::LongName' has a wrong offset!");
static_assert(offsetof(FLiveLinkClientInfoMessage, Status) == 0x000010, "Member 'FLiveLinkClientInfoMessage::Status' has a wrong offset!");
static_assert(offsetof(FLiveLinkClientInfoMessage, HostName) == 0x000018, "Member 'FLiveLinkClientInfoMessage::HostName' has a wrong offset!");
static_assert(offsetof(FLiveLinkClientInfoMessage, ProjectName) == 0x000028, "Member 'FLiveLinkClientInfoMessage::ProjectName' has a wrong offset!");
static_assert(offsetof(FLiveLinkClientInfoMessage, CurrentLevel) == 0x000038, "Member 'FLiveLinkClientInfoMessage::CurrentLevel' has a wrong offset!");
static_assert(offsetof(FLiveLinkClientInfoMessage, LiveLinkVersion) == 0x000048, "Member 'FLiveLinkClientInfoMessage::LiveLinkVersion' has a wrong offset!");

// ScriptStruct LiveLinkHubMessaging.LiveLinkHubConnectMessage
// 0x0050 (0x0050 - 0x0000)
struct FLiveLinkHubConnectMessage final
{
public:
	struct FLiveLinkClientInfoMessage             ClientInfo;                                        // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FLiveLinkHubConnectMessage) == 0x000008, "Wrong alignment on FLiveLinkHubConnectMessage");
static_assert(sizeof(FLiveLinkHubConnectMessage) == 0x000050, "Wrong size on FLiveLinkHubConnectMessage");
static_assert(offsetof(FLiveLinkHubConnectMessage, ClientInfo) == 0x000000, "Member 'FLiveLinkHubConnectMessage::ClientInfo' has a wrong offset!");

}

