#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuScreen_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct MenuScreen_Athena.MenuScreen_Athena_C.AnimBlueprintGeneratedConstantData
// 0x28A7 (0x28A8 - 0x0001)
struct MenuScreen_Athena::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1658;                               // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1659;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1660;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1661;                               // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1662;                               // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1663;                               // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1664;                               // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1665;                               // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1666;                               // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1667;                              // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1668;                              // 0x0038(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1669;                               // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1670;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1671;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1672;                              // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1673;                              // 0x0068(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1674;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1675;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1676;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1677;                               // 0x0084(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1678;                              // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1679;                              // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_1680;                               // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputScaleBiasClampConstants          __StructProperty_1681;                             // 0x00A4(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1682;                              // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1683;                               // 0x00D4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1684;                               // 0x00D5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_1685;                               // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1686;                                 // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_1687;                               // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1688;                               // 0x00E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1689;                               // 0x00EA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1690;                              // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_1691;                              // 0x0100(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1692;                               // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1693;                               // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1694;                                // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1695;                             // 0x0120(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1696;                               // 0x0138(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1697;                               // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0140(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_10;                         // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_9;                          // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_8;                          // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                              // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_7;                          // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK_2;                             // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_17;                    // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_6;                          // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_5;                          // 0x0358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;                        // 0x0388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;                   // 0x03B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve;                         // 0x03E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_4;                          // 0x0418(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;                        // 0x0448(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                        // 0x0478(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_3;                          // 0x04A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;                   // 0x04D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;                   // 0x0508(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;                   // 0x0538(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_16;                    // 0x0568(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;                   // 0x0598(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;                    // 0x05C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_2;                          // 0x05F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x0628(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_56;                 // 0x0658(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_55;                 // 0x0688(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_54;                 // 0x06B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_53;                 // 0x06E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_52;                 // 0x0718(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_34;                  // 0x0748(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_33;                  // 0x0778(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_32;                  // 0x07A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_16;                      // 0x07D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_13;                     // 0x0808(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_51;                 // 0x0838(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_50;                 // 0x0868(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_49;                 // 0x0898(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_48;                 // 0x08C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_47;                 // 0x08F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_46;                 // 0x0928(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_45;                 // 0x0958(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_44;                 // 0x0988(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_43;                 // 0x09B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_42;                 // 0x09E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;                         // 0x0A18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_31;                  // 0x0A48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_30;                  // 0x0A78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_29;                  // 0x0AA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_28;                  // 0x0AD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_27;                  // 0x0B08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_26;                  // 0x0B38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_15;                      // 0x0B68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_12;                     // 0x0B98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_15;                    // 0x0BC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_14;                    // 0x0BF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_41;                 // 0x0C28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_14;                      // 0x0C58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_40;                 // 0x0C88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_39;                 // 0x0CB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_38;                 // 0x0CE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_37;                 // 0x0D18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_25;                  // 0x0D48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_24;                  // 0x0D78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_23;                  // 0x0DA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_36;                 // 0x0DD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_13;                      // 0x0E08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_11;                     // 0x0E38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_35;                 // 0x0E68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_34;                 // 0x0E98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_33;                 // 0x0EC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_32;                 // 0x0EF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_22;                  // 0x0F28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_21;                  // 0x0F58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_31;                 // 0x0F88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_20;                  // 0x0FB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_12;                      // 0x0FE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_10;                     // 0x1018(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_13;                    // 0x1048(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_30;                 // 0x1078(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_12;                    // 0x10A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;                      // 0x10D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_9;                      // 0x1108(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_11;                    // 0x1138(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x1168(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_29;                 // 0x1198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;                      // 0x11C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_8;                      // 0x11F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_10;                    // 0x1228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_9;                     // 0x1258(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;                   // 0x1288(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_8;                     // 0x12B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_28;                 // 0x12E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_7;                     // 0x1318(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_27;                 // 0x1348(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_26;                 // 0x1378(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;                       // 0x13A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_6;                     // 0x13D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_25;                 // 0x1408(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_24;                 // 0x1438(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_19;                  // 0x1468(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_5;                     // 0x1498(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_23;                 // 0x14C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_22;                 // 0x14F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;                       // 0x1528(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_7;                      // 0x1558(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;                   // 0x1588(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;                   // 0x15B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;                   // 0x15E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;                   // 0x1618(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;                   // 0x1648(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_18;                  // 0x1678(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_17;                  // 0x16A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_16;                  // 0x16D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;                       // 0x1708(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_6;                      // 0x1738(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_15;                  // 0x1768(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x1798(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_21;                 // 0x17C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_20;                 // 0x17F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_19;                 // 0x1828(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_18;                 // 0x1858(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_17;                 // 0x1888(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_14;                  // 0x18B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_13;                  // 0x18E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_12;                  // 0x1918(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;                       // 0x1948(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_5;                      // 0x1978(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_16;                 // 0x19A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_15;                 // 0x19D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_14;                 // 0x1A08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_13;                 // 0x1A38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_12;                 // 0x1A68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_11;                  // 0x1A98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_10;                  // 0x1AC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_9;                   // 0x1AF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                       // 0x1B28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_4;                      // 0x1B58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_4;                     // 0x1B88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_3;                     // 0x1BB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_11;                 // 0x1BE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                       // 0x1C18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_10;                 // 0x1C48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_9;                  // 0x1C78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_8;                  // 0x1CA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_7;                  // 0x1CD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_8;                   // 0x1D08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_7;                   // 0x1D38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_6;                  // 0x1D68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_6;                   // 0x1D98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x1DC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_3;                      // 0x1DF8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_5;                  // 0x1E28(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_4;                  // 0x1E58(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_3;                  // 0x1E88(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;                  // 0x1EB8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_5;                   // 0x1EE8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_4;                   // 0x1F18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_3;                   // 0x1F48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;                  // 0x1F78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x1FA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;                      // 0x1FD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_2;                     // 0x2008(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x2038(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                     // 0x2068(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x2098(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                      // 0x20C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;                    // 0x20F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone_1;                          // 0x2128(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;                    // 0x2158(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;                     // 0x2188(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;                     // 0x21B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_CopyBone;                            // 0x21E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                              // 0x2218(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x2248(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                              // 0x2278(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x22A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;               // 0x22D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x2308(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                      // 0x2338(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                     // 0x2368(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                     // 0x2398(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                       // 0x23C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;                    // 0x23F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization;                     // 0x2428(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;                    // 0x2458(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt_3;                    // 0x2488(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt_2;                    // 0x24B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;                    // 0x24E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;                    // 0x2518(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;                    // 0x2548(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x2578(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_2;                   // 0x25A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;                   // 0x25D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt_1;                    // 0x2608(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt;                      // 0x2638(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x2668(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x2698(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x26C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x26F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;                     // 0x2728(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x2758(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x2788(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK_1;                             // 0x27B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                          // 0x27E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LegIK;                               // 0x2818(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;               // 0x2848(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x2878(0x0030)()
};
static_assert(alignof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on MenuScreen_Athena::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData) == 0x0028A8, "Wrong size on MenuScreen_Athena::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1658) == 0x000004, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1658' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1659) == 0x000008, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1659' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1660) == 0x00000C, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1660' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ByteProperty_1661) == 0x000010, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ByteProperty_1661' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1662) == 0x000014, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1662' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1663) == 0x000018, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1663' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ByteProperty_1664) == 0x000019, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ByteProperty_1664' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1665) == 0x00001C, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1665' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1666) == 0x000020, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1666' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1667) == 0x000028, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1667' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1668) == 0x000038, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1668' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1669) == 0x000048, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1669' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1670) == 0x00004C, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1670' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1671) == 0x000050, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1671' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1672) == 0x000058, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1672' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1673) == 0x000068, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1673' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1674) == 0x000078, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1674' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1675) == 0x00007C, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1675' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __IntProperty_1676) == 0x000080, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__IntProperty_1676' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1677) == 0x000084, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1677' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __FloatProperty_1678) == 0x000088, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__FloatProperty_1678' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1679) == 0x000090, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1679' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __BoolProperty_1680) == 0x0000A0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__BoolProperty_1680' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __StructProperty_1681) == 0x0000A4, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__StructProperty_1681' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __FloatProperty_1682) == 0x0000D0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__FloatProperty_1682' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1683) == 0x0000D4, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1683' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ByteProperty_1684) == 0x0000D5, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ByteProperty_1684' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __BlendProfile_1685) == 0x0000D8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__BlendProfile_1685' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __CurveFloat_1686) == 0x0000E0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__CurveFloat_1686' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __BoolProperty_1687) == 0x0000E8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__BoolProperty_1687' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1688) == 0x0000E9, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1688' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __EnumProperty_1689) == 0x0000EA, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__EnumProperty_1689' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1690) == 0x0000F0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1690' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1691) == 0x000100, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1691' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1692) == 0x000110, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1692' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1693) == 0x000114, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1693' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __IntProperty_1694) == 0x000118, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__IntProperty_1694' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __StructProperty_1695) == 0x000120, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__StructProperty_1695' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1696) == 0x000138, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1696' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, __NameProperty_1697) == 0x00013C, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::__NameProperty_1697' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000140, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C0, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_10) == 0x0001D8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_10' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_9) == 0x000208, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_9' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_8) == 0x000238, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_8' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_3) == 0x000268, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_7) == 0x000298, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_7' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LegIK_2) == 0x0002C8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LegIK_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_17) == 0x0002F8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_17' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_6) == 0x000328, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_6' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_5) == 0x000358, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_5' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_3) == 0x000388, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_18) == 0x0003B8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyCurve) == 0x0003E8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyCurve' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_4) == 0x000418, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_4' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_2) == 0x000448, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x000478, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_3) == 0x0004A8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_3' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x0004D8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_17) == 0x000508, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_16) == 0x000538, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_16) == 0x000568, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_16' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000598, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_3) == 0x0005C8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_CopyBone_2) == 0x0005F8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_CopyBone_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x000628, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_56) == 0x000658, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_56' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_55) == 0x000688, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_55' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_54) == 0x0006B8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_54' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_53) == 0x0006E8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_53' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_52) == 0x000718, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_52' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_34) == 0x000748, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_34' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_33) == 0x000778, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_33' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_32) == 0x0007A8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_32' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_16) == 0x0007D8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_16' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_13) == 0x000808, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_13' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_51) == 0x000838, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_51' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_50) == 0x000868, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_50' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_49) == 0x000898, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_49' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_48) == 0x0008C8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_48' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_47) == 0x0008F8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_47' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_46) == 0x000928, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_46' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_45) == 0x000958, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_45' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_44) == 0x000988, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_44' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_43) == 0x0009B8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_43' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_42) == 0x0009E8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_42' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TwoWayBlend) == 0x000A18, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_31) == 0x000A48, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_31' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_30) == 0x000A78, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_30' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_29) == 0x000AA8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_29' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_28) == 0x000AD8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_28' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_27) == 0x000B08, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_27' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_26) == 0x000B38, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_26' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_15) == 0x000B68, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_15' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_12) == 0x000B98, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_12' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_15) == 0x000BC8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_15' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_14) == 0x000BF8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_14' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_41) == 0x000C28, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_41' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_14) == 0x000C58, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_14' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_40) == 0x000C88, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_40' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_39) == 0x000CB8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_39' has a wrong offset!");
static_assert(offsetof(MenuScreen_Athena::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_38) == 0x000CE8, "Member 'MenuScreen_Athena::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_38' has a wrong offset!");
