#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mover

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Mover.ELayeredMove_ConstantVelocitySettingsFlags
// NumValues: 0x0004
enum class ELayeredMove_ConstantVelocitySettingsFlags : uint8
{
	NoFlags                                  = 0,
	VelocityStartRelative                    = 1,
	VelocityAlwaysRelative                   = 2,
	ELayeredMove_MAX                         = 3,
};

// Enum Mover.ELayeredMoveFinishVelocityMode
// NumValues: 0x0004
enum class ELayeredMoveFinishVelocityMode : uint8
{
	MaintainLastRootMotionVelocity           = 0,
	SetVelocity                              = 1,
	ClampVelocity                            = 2,
	ELayeredMoveFinishVelocityMode_MAX       = 3,
};

// Enum Mover.EMoveMixMode
// NumValues: 0x0004
enum class EMoveMixMode : uint8
{
	AdditiveVelocity                         = 0,
	OverrideVelocity                         = 1,
	OverrideAll                              = 2,
	EMoveMixMode_MAX                         = 3,
};

// Enum Mover.EMoveInputType
// NumValues: 0x0004
enum class EMoveInputType : uint8
{
	Invalid                                  = 0,
	DirectionalIntent                        = 1,
	Velocity                                 = 2,
	EMoveInputType_MAX                       = 3,
};

// ScriptStruct Mover.FreeMoveParams
// 0x0080 (0x0080 - 0x0000)
struct FFreeMoveParams final
{
public:
	EMoveInputType                                MoveInputType;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MoveInput;                                         // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OrientationIntent;                                 // 0x0020(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                PriorVelocity;                                     // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PriorOrientation;                                  // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Deceleration;                                      // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningBoost;                                      // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningRate;                                       // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFreeMoveParams) == 0x000008, "Wrong alignment on FFreeMoveParams");
static_assert(sizeof(FFreeMoveParams) == 0x000080, "Wrong size on FFreeMoveParams");
static_assert(offsetof(FFreeMoveParams, MoveInputType) == 0x000000, "Member 'FFreeMoveParams::MoveInputType' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, MoveInput) == 0x000008, "Member 'FFreeMoveParams::MoveInput' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, OrientationIntent) == 0x000020, "Member 'FFreeMoveParams::OrientationIntent' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, PriorVelocity) == 0x000038, "Member 'FFreeMoveParams::PriorVelocity' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, PriorOrientation) == 0x000050, "Member 'FFreeMoveParams::PriorOrientation' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, MaxSpeed) == 0x000068, "Member 'FFreeMoveParams::MaxSpeed' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, Acceleration) == 0x00006C, "Member 'FFreeMoveParams::Acceleration' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, Deceleration) == 0x000070, "Member 'FFreeMoveParams::Deceleration' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, TurningBoost) == 0x000074, "Member 'FFreeMoveParams::TurningBoost' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, TurningRate) == 0x000078, "Member 'FFreeMoveParams::TurningRate' has a wrong offset!");
static_assert(offsetof(FFreeMoveParams, DeltaSeconds) == 0x00007C, "Member 'FFreeMoveParams::DeltaSeconds' has a wrong offset!");

// ScriptStruct Mover.MoverAuxStateContext
// 0x0001 (0x0001 - 0x0000)
struct FMoverAuxStateContext final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMoverAuxStateContext) == 0x000001, "Wrong alignment on FMoverAuxStateContext");
static_assert(sizeof(FMoverAuxStateContext) == 0x000001, "Wrong size on FMoverAuxStateContext");

// ScriptStruct Mover.WaterMoveParams
// 0x00A8 (0x00A8 - 0x0000)
struct FWaterMoveParams final
{
public:
	EMoveInputType                                MoveInputType;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MoveInput;                                         // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OrientationIntent;                                 // 0x0020(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                PriorVelocity;                                     // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PriorOrientation;                                  // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Deceleration;                                      // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningRate;                                       // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningBoost;                                      // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MoveAcceleration;                                  // 0x0088(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveSpeed;                                         // 0x00A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWaterMoveParams) == 0x000008, "Wrong alignment on FWaterMoveParams");
static_assert(sizeof(FWaterMoveParams) == 0x0000A8, "Wrong size on FWaterMoveParams");
static_assert(offsetof(FWaterMoveParams, MoveInputType) == 0x000000, "Member 'FWaterMoveParams::MoveInputType' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, MoveInput) == 0x000008, "Member 'FWaterMoveParams::MoveInput' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, OrientationIntent) == 0x000020, "Member 'FWaterMoveParams::OrientationIntent' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, PriorVelocity) == 0x000038, "Member 'FWaterMoveParams::PriorVelocity' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, PriorOrientation) == 0x000050, "Member 'FWaterMoveParams::PriorOrientation' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, MaxSpeed) == 0x000068, "Member 'FWaterMoveParams::MaxSpeed' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, Acceleration) == 0x00006C, "Member 'FWaterMoveParams::Acceleration' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, Deceleration) == 0x000070, "Member 'FWaterMoveParams::Deceleration' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, Friction) == 0x000074, "Member 'FWaterMoveParams::Friction' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, TurningRate) == 0x000078, "Member 'FWaterMoveParams::TurningRate' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, TurningBoost) == 0x00007C, "Member 'FWaterMoveParams::TurningBoost' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, DeltaSeconds) == 0x000080, "Member 'FWaterMoveParams::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, MoveAcceleration) == 0x000088, "Member 'FWaterMoveParams::MoveAcceleration' has a wrong offset!");
static_assert(offsetof(FWaterMoveParams, MoveSpeed) == 0x0000A0, "Member 'FWaterMoveParams::MoveSpeed' has a wrong offset!");

// ScriptStruct Mover.MoverDataCollection
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FMoverDataCollection final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMoverDataCollection) == 0x000008, "Wrong alignment on FMoverDataCollection");
static_assert(sizeof(FMoverDataCollection) == 0x000018, "Wrong size on FMoverDataCollection");

// ScriptStruct Mover.MoverSyncState
// 0x0018 (0x0018 - 0x0000)
struct FMoverSyncState final
{
public:
	struct FMoverDataCollection                   SyncStateCollection;                               // 0x0000(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMoverSyncState) == 0x000008, "Wrong alignment on FMoverSyncState");
static_assert(sizeof(FMoverSyncState) == 0x000018, "Wrong size on FMoverSyncState");
static_assert(offsetof(FMoverSyncState, SyncStateCollection) == 0x000000, "Member 'FMoverSyncState::SyncStateCollection' has a wrong offset!");

// ScriptStruct Mover.LayeredMoveFinishVelocitySettings
// 0x0030 (0x0030 - 0x0000)
struct FLayeredMoveFinishVelocitySettings final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ELayeredMoveFinishVelocityMode                FinishVelocityMode;                                // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SetVelocity;                                       // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClampVelocity;                                     // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLayeredMoveFinishVelocitySettings) == 0x000008, "Wrong alignment on FLayeredMoveFinishVelocitySettings");
static_assert(sizeof(FLayeredMoveFinishVelocitySettings) == 0x000030, "Wrong size on FLayeredMoveFinishVelocitySettings");
static_assert(offsetof(FLayeredMoveFinishVelocitySettings, FinishVelocityMode) == 0x000008, "Member 'FLayeredMoveFinishVelocitySettings::FinishVelocityMode' has a wrong offset!");
static_assert(offsetof(FLayeredMoveFinishVelocitySettings, SetVelocity) == 0x000010, "Member 'FLayeredMoveFinishVelocitySettings::SetVelocity' has a wrong offset!");
static_assert(offsetof(FLayeredMoveFinishVelocitySettings, ClampVelocity) == 0x000028, "Member 'FLayeredMoveFinishVelocitySettings::ClampVelocity' has a wrong offset!");

// ScriptStruct Mover.LayeredMoveBase
// 0x0048 (0x0048 - 0x0000)
struct FLayeredMoveBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EMoveMixMode                                  MixMode;                                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Priority;                                          // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DurationMs;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartSimTimeMs;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLayeredMoveFinishVelocitySettings     FinishVelocitySettings;                            // 0x0018(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLayeredMoveBase) == 0x000008, "Wrong alignment on FLayeredMoveBase");
static_assert(sizeof(FLayeredMoveBase) == 0x000048, "Wrong size on FLayeredMoveBase");
static_assert(offsetof(FLayeredMoveBase, MixMode) == 0x000008, "Member 'FLayeredMoveBase::MixMode' has a wrong offset!");
static_assert(offsetof(FLayeredMoveBase, Priority) == 0x000009, "Member 'FLayeredMoveBase::Priority' has a wrong offset!");
static_assert(offsetof(FLayeredMoveBase, DurationMs) == 0x00000C, "Member 'FLayeredMoveBase::DurationMs' has a wrong offset!");
static_assert(offsetof(FLayeredMoveBase, StartSimTimeMs) == 0x000010, "Member 'FLayeredMoveBase::StartSimTimeMs' has a wrong offset!");
static_assert(offsetof(FLayeredMoveBase, FinishVelocitySettings) == 0x000018, "Member 'FLayeredMoveBase::FinishVelocitySettings' has a wrong offset!");

// ScriptStruct Mover.MoverTimeStep
// 0x0010 (0x0010 - 0x0000)
struct FMoverTimeStep final
{
public:
	int32                                         ServerFrame;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseSimTimeMs;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepMs;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMoverTimeStep) == 0x000004, "Wrong alignment on FMoverTimeStep");
static_assert(sizeof(FMoverTimeStep) == 0x000010, "Wrong size on FMoverTimeStep");
static_assert(offsetof(FMoverTimeStep, ServerFrame) == 0x000000, "Member 'FMoverTimeStep::ServerFrame' has a wrong offset!");
static_assert(offsetof(FMoverTimeStep, BaseSimTimeMs) == 0x000004, "Member 'FMoverTimeStep::BaseSimTimeMs' has a wrong offset!");
static_assert(offsetof(FMoverTimeStep, StepMs) == 0x000008, "Member 'FMoverTimeStep::StepMs' has a wrong offset!");

// ScriptStruct Mover.MoverInputCmdContext
// 0x0018 (0x0018 - 0x0000)
struct FMoverInputCmdContext final
{
public:
	struct FMoverDataCollection                   InputCollection;                                   // 0x0000(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMoverInputCmdContext) == 0x000008, "Wrong alignment on FMoverInputCmdContext");
static_assert(sizeof(FMoverInputCmdContext) == 0x000018, "Wrong size on FMoverInputCmdContext");
static_assert(offsetof(FMoverInputCmdContext, InputCollection) == 0x000000, "Member 'FMoverInputCmdContext::InputCollection' has a wrong offset!");

// ScriptStruct Mover.LayeredMove_AnimRootMotion
// 0x0010 (0x0058 - 0x0048)
struct FLayeredMove_AnimRootMotion final : public FLayeredMoveBase
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartingMontagePosition;                           // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLayeredMove_AnimRootMotion) == 0x000008, "Wrong alignment on FLayeredMove_AnimRootMotion");
static_assert(sizeof(FLayeredMove_AnimRootMotion) == 0x000058, "Wrong size on FLayeredMove_AnimRootMotion");
static_assert(offsetof(FLayeredMove_AnimRootMotion, Montage) == 0x000048, "Member 'FLayeredMove_AnimRootMotion::Montage' has a wrong offset!");
static_assert(offsetof(FLayeredMove_AnimRootMotion, StartingMontagePosition) == 0x000050, "Member 'FLayeredMove_AnimRootMotion::StartingMontagePosition' has a wrong offset!");
static_assert(offsetof(FLayeredMove_AnimRootMotion, PlayRate) == 0x000054, "Member 'FLayeredMove_AnimRootMotion::PlayRate' has a wrong offset!");

// ScriptStruct Mover.LayeredMove_LinearVelocity
// 0x0028 (0x0070 - 0x0048)
struct FLayeredMove_LinearVelocity final : public FLayeredMoveBase
{
public:
	struct FVector                                Velocity;                                          // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            MagnitudeOverTime;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SettingsFlags;                                     // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLayeredMove_LinearVelocity) == 0x000008, "Wrong alignment on FLayeredMove_LinearVelocity");
static_assert(sizeof(FLayeredMove_LinearVelocity) == 0x000070, "Wrong size on FLayeredMove_LinearVelocity");
static_assert(offsetof(FLayeredMove_LinearVelocity, Velocity) == 0x000048, "Member 'FLayeredMove_LinearVelocity::Velocity' has a wrong offset!");
static_assert(offsetof(FLayeredMove_LinearVelocity, MagnitudeOverTime) == 0x000060, "Member 'FLayeredMove_LinearVelocity::MagnitudeOverTime' has a wrong offset!");
static_assert(offsetof(FLayeredMove_LinearVelocity, SettingsFlags) == 0x000068, "Member 'FLayeredMove_LinearVelocity::SettingsFlags' has a wrong offset!");

// ScriptStruct Mover.LayeredMove_JumpImpulse
// 0x0008 (0x0050 - 0x0048)
struct FLayeredMove_JumpImpulse final : public FLayeredMoveBase
{
public:
	float                                         UpwardsSpeed;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLayeredMove_JumpImpulse) == 0x000008, "Wrong alignment on FLayeredMove_JumpImpulse");
static_assert(sizeof(FLayeredMove_JumpImpulse) == 0x000050, "Wrong size on FLayeredMove_JumpImpulse");
static_assert(offsetof(FLayeredMove_JumpImpulse, UpwardsSpeed) == 0x000048, "Member 'FLayeredMove_JumpImpulse::UpwardsSpeed' has a wrong offset!");

// ScriptStruct Mover.LayeredMove_JumpTo
// 0x0038 (0x0080 - 0x0048)
struct FLayeredMove_JumpTo final : public FLayeredMoveBase
{
public:
	float                                         JumpDistance;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpHeight;                                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseActorRotation;                                 // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               JumpRotation;                                      // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UCurveVector*                           PathOffsetCurve;                                   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            TimeMappingCurve;                                  // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLayeredMove_JumpTo) == 0x000008, "Wrong alignment on FLayeredMove_JumpTo");
static_assert(sizeof(FLayeredMove_JumpTo) == 0x000080, "Wrong size on FLayeredMove_JumpTo");
static_assert(offsetof(FLayeredMove_JumpTo, JumpDistance) == 0x000048, "Member 'FLayeredMove_JumpTo::JumpDistance' has a wrong offset!");
static_assert(offsetof(FLayeredMove_JumpTo, JumpHeight) == 0x00004C, "Member 'FLayeredMove_JumpTo::JumpHeight' has a wrong offset!");
static_assert(offsetof(FLayeredMove_JumpTo, bUseActorRotation) == 0x000050, "Member 'FLayeredMove_JumpTo::bUseActorRotation' has a wrong offset!");
static_assert(offsetof(FLayeredMove_JumpTo, JumpRotation) == 0x000058, "Member 'FLayeredMove_JumpTo::JumpRotation' has a wrong offset!");
static_assert(offsetof(FLayeredMove_JumpTo, PathOffsetCurve) == 0x000070, "Member 'FLayeredMove_JumpTo::PathOffsetCurve' has a wrong offset!");
static_assert(offsetof(FLayeredMove_JumpTo, TimeMappingCurve) == 0x000078, "Member 'FLayeredMove_JumpTo::TimeMappingCurve' has a wrong offset!");

// ScriptStruct Mover.LayeredMove_Teleport
// 0x0018 (0x0060 - 0x0048)
struct FLayeredMove_Teleport final : public FLayeredMoveBase
{
public:
	struct FVector                                TargetLocation;                                    // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLayeredMove_Teleport) == 0x000008, "Wrong alignment on FLayeredMove_Teleport");
static_assert(sizeof(FLayeredMove_Teleport) == 0x000060, "Wrong size on FLayeredMove_Teleport");
static_assert(offsetof(FLayeredMove_Teleport, TargetLocation) == 0x000048, "Member 'FLayeredMove_Teleport::TargetLocation' has a wrong offset!");

// ScriptStruct Mover.LayeredMove_MoveTo
// 0x0048 (0x0090 - 0x0048)
struct FLayeredMove_MoveTo : public FLayeredMoveBase
{
public:
	struct FVector                                StartLocation;                                     // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestrictSpeedToExpected;                          // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           PathOffsetCurve;                                   // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            TimeMappingCurve;                                  // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLayeredMove_MoveTo) == 0x000008, "Wrong alignment on FLayeredMove_MoveTo");
static_assert(sizeof(FLayeredMove_MoveTo) == 0x000090, "Wrong size on FLayeredMove_MoveTo");
static_assert(offsetof(FLayeredMove_MoveTo, StartLocation) == 0x000048, "Member 'FLayeredMove_MoveTo::StartLocation' has a wrong offset!");
static_assert(offsetof(FLayeredMove_MoveTo, TargetLocation) == 0x000060, "Member 'FLayeredMove_MoveTo::TargetLocation' has a wrong offset!");
static_assert(offsetof(FLayeredMove_MoveTo, bRestrictSpeedToExpected) == 0x000078, "Member 'FLayeredMove_MoveTo::bRestrictSpeedToExpected' has a wrong offset!");
static_assert(offsetof(FLayeredMove_MoveTo, PathOffsetCurve) == 0x000080, "Member 'FLayeredMove_MoveTo::PathOffsetCurve' has a wrong offset!");
static_assert(offsetof(FLayeredMove_MoveTo, TimeMappingCurve) == 0x000088, "Member 'FLayeredMove_MoveTo::TimeMappingCurve' has a wrong offset!");

// ScriptStruct Mover.LayeredMove_MoveToDynamic
// 0x0008 (0x0098 - 0x0090)
struct FLayeredMove_MoveToDynamic final : public FLayeredMove_MoveTo
{
public:
	class AActor*                                 LocationActor;                                     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLayeredMove_MoveToDynamic) == 0x000008, "Wrong alignment on FLayeredMove_MoveToDynamic");
static_assert(sizeof(FLayeredMove_MoveToDynamic) == 0x000098, "Wrong size on FLayeredMove_MoveToDynamic");
static_assert(offsetof(FLayeredMove_MoveToDynamic, LocationActor) == 0x000090, "Member 'FLayeredMove_MoveToDynamic::LocationActor' has a wrong offset!");

// ScriptStruct Mover.LayeredMove_RadialImpulse
// 0x0060 (0x00A8 - 0x0048)
struct FLayeredMove_RadialImpulse final : public FLayeredMoveBase
{
public:
	struct FVector                                Location;                                          // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 LocationActor;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPush;                                           // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoVerticalVelocity;                               // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DistanceFalloff;                                   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            MagnitudeOverTime;                                 // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFixedWorldDirection;                           // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               FixedWorldDirection;                               // 0x0090(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLayeredMove_RadialImpulse) == 0x000008, "Wrong alignment on FLayeredMove_RadialImpulse");
static_assert(sizeof(FLayeredMove_RadialImpulse) == 0x0000A8, "Wrong size on FLayeredMove_RadialImpulse");
static_assert(offsetof(FLayeredMove_RadialImpulse, Location) == 0x000048, "Member 'FLayeredMove_RadialImpulse::Location' has a wrong offset!");
static_assert(offsetof(FLayeredMove_RadialImpulse, LocationActor) == 0x000060, "Member 'FLayeredMove_RadialImpulse::LocationActor' has a wrong offset!");
static_assert(offsetof(FLayeredMove_RadialImpulse, Radius) == 0x000068, "Member 'FLayeredMove_RadialImpulse::Radius' has a wrong offset!");
static_assert(offsetof(FLayeredMove_RadialImpulse, Magnitude) == 0x00006C, "Member 'FLayeredMove_RadialImpulse::Magnitude' has a wrong offset!");
static_assert(offsetof(FLayeredMove_RadialImpulse, bIsPush) == 0x000070, "Member 'FLayeredMove_RadialImpulse::bIsPush' has a wrong offset!");
static_assert(offsetof(FLayeredMove_RadialImpulse, bNoVerticalVelocity) == 0x000071, "Member 'FLayeredMove_RadialImpulse::bNoVerticalVelocity' has a wrong offset!");
static_assert(offsetof(FLayeredMove_RadialImpulse, DistanceFalloff) == 0x000078, "Member 'FLayeredMove_RadialImpulse::DistanceFalloff' has a wrong offset!");
static_assert(offsetof(FLayeredMove_RadialImpulse, MagnitudeOverTime) == 0x000080, "Member 'FLayeredMove_RadialImpulse::MagnitudeOverTime' has a wrong offset!");
static_assert(offsetof(FLayeredMove_RadialImpulse, bUseFixedWorldDirection) == 0x000088, "Member 'FLayeredMove_RadialImpulse::bUseFixedWorldDirection' has a wrong offset!");
static_assert(offsetof(FLayeredMove_RadialImpulse, FixedWorldDirection) == 0x000090, "Member 'FLayeredMove_RadialImpulse::FixedWorldDirection' has a wrong offset!");

// ScriptStruct Mover.FloorCheckResult
// 0x00F8 (0x00F8 - 0x0000)
struct FFloorCheckResult final
{
public:
	uint8                                         bBlockingHit : 1;                                  // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWalkableFloor : 1;                                // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLineTrace : 1;                                    // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LineDist;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloorDist;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x0010(0x00E8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFloorCheckResult) == 0x000008, "Wrong alignment on FFloorCheckResult");
static_assert(sizeof(FFloorCheckResult) == 0x0000F8, "Wrong size on FFloorCheckResult");
static_assert(offsetof(FFloorCheckResult, LineDist) == 0x000004, "Member 'FFloorCheckResult::LineDist' has a wrong offset!");
static_assert(offsetof(FFloorCheckResult, FloorDist) == 0x000008, "Member 'FFloorCheckResult::FloorDist' has a wrong offset!");
static_assert(offsetof(FFloorCheckResult, HitResult) == 0x000010, "Member 'FFloorCheckResult::HitResult' has a wrong offset!");

// ScriptStruct Mover.GroundMoveParams
// 0x00A0 (0x00A0 - 0x0000)
struct FGroundMoveParams final
{
public:
	EMoveInputType                                MoveInputType;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MoveInput;                                         // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OrientationIntent;                                 // 0x0020(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                PriorVelocity;                                     // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PriorOrientation;                                  // 0x0050(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Deceleration;                                      // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningRate;                                       // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningBoost;                                      // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GroundNormal;                                      // 0x0080(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0098(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGroundMoveParams) == 0x000008, "Wrong alignment on FGroundMoveParams");
static_assert(sizeof(FGroundMoveParams) == 0x0000A0, "Wrong size on FGroundMoveParams");
static_assert(offsetof(FGroundMoveParams, MoveInputType) == 0x000000, "Member 'FGroundMoveParams::MoveInputType' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, MoveInput) == 0x000008, "Member 'FGroundMoveParams::MoveInput' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, OrientationIntent) == 0x000020, "Member 'FGroundMoveParams::OrientationIntent' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, PriorVelocity) == 0x000038, "Member 'FGroundMoveParams::PriorVelocity' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, PriorOrientation) == 0x000050, "Member 'FGroundMoveParams::PriorOrientation' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, MaxSpeed) == 0x000068, "Member 'FGroundMoveParams::MaxSpeed' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, Acceleration) == 0x00006C, "Member 'FGroundMoveParams::Acceleration' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, Deceleration) == 0x000070, "Member 'FGroundMoveParams::Deceleration' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, Friction) == 0x000074, "Member 'FGroundMoveParams::Friction' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, TurningRate) == 0x000078, "Member 'FGroundMoveParams::TurningRate' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, TurningBoost) == 0x00007C, "Member 'FGroundMoveParams::TurningBoost' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, GroundNormal) == 0x000080, "Member 'FGroundMoveParams::GroundNormal' has a wrong offset!");
static_assert(offsetof(FGroundMoveParams, DeltaSeconds) == 0x000098, "Member 'FGroundMoveParams::DeltaSeconds' has a wrong offset!");

// ScriptStruct Mover.LayeredMove_Launch
// 0x0020 (0x0068 - 0x0048)
struct FLayeredMove_Launch final : public FLayeredMoveBase
{
public:
	struct FVector                                LaunchVelocity;                                    // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ForceMovementMode;                                 // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLayeredMove_Launch) == 0x000008, "Wrong alignment on FLayeredMove_Launch");
static_assert(sizeof(FLayeredMove_Launch) == 0x000068, "Wrong size on FLayeredMove_Launch");
static_assert(offsetof(FLayeredMove_Launch, LaunchVelocity) == 0x000048, "Member 'FLayeredMove_Launch::LaunchVelocity' has a wrong offset!");
static_assert(offsetof(FLayeredMove_Launch, ForceMovementMode) == 0x000060, "Member 'FLayeredMove_Launch::ForceMovementMode' has a wrong offset!");

// ScriptStruct Mover.LayeredMoveGroup
// 0x0050 (0x0050 - 0x0000)
struct FLayeredMoveGroup final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bApplyResidualVelocity;                            // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ResidualVelocity;                                  // 0x0010(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResidualClamping;                                  // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x24];                                      // 0x002C(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLayeredMoveGroup) == 0x000008, "Wrong alignment on FLayeredMoveGroup");
static_assert(sizeof(FLayeredMoveGroup) == 0x000050, "Wrong size on FLayeredMoveGroup");
static_assert(offsetof(FLayeredMoveGroup, bApplyResidualVelocity) == 0x000008, "Member 'FLayeredMoveGroup::bApplyResidualVelocity' has a wrong offset!");
static_assert(offsetof(FLayeredMoveGroup, ResidualVelocity) == 0x000010, "Member 'FLayeredMoveGroup::ResidualVelocity' has a wrong offset!");
static_assert(offsetof(FLayeredMoveGroup, ResidualClamping) == 0x000028, "Member 'FLayeredMoveGroup::ResidualClamping' has a wrong offset!");

// ScriptStruct Mover.MovementSubstep
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FMovementSubstep final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMovementSubstep) == 0x000008, "Wrong alignment on FMovementSubstep");
static_assert(sizeof(FMovementSubstep) == 0x000028, "Wrong size on FMovementSubstep");

// ScriptStruct Mover.MovementRecord
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FMovementRecord final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMovementRecord) == 0x000008, "Wrong alignment on FMovementRecord");
static_assert(sizeof(FMovementRecord) == 0x000048, "Wrong size on FMovementRecord");

// ScriptStruct Mover.ProposedMove
// 0x0088 (0x0088 - 0x0000)
struct FProposedMove final
{
public:
	EMoveMixMode                                  MixMode;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PreferredMode;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasDirIntent : 1;                                 // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasTargetLocation : 1;                            // 0x0008(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DirectionIntent;                                   // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearVelocity;                                    // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               AngularVelocity;                                   // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                MovePlaneVelocity;                                 // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProposedMove) == 0x000008, "Wrong alignment on FProposedMove");
static_assert(sizeof(FProposedMove) == 0x000088, "Wrong size on FProposedMove");
static_assert(offsetof(FProposedMove, MixMode) == 0x000000, "Member 'FProposedMove::MixMode' has a wrong offset!");
static_assert(offsetof(FProposedMove, PreferredMode) == 0x000004, "Member 'FProposedMove::PreferredMode' has a wrong offset!");
static_assert(offsetof(FProposedMove, DirectionIntent) == 0x000010, "Member 'FProposedMove::DirectionIntent' has a wrong offset!");
static_assert(offsetof(FProposedMove, LinearVelocity) == 0x000028, "Member 'FProposedMove::LinearVelocity' has a wrong offset!");
static_assert(offsetof(FProposedMove, AngularVelocity) == 0x000040, "Member 'FProposedMove::AngularVelocity' has a wrong offset!");
static_assert(offsetof(FProposedMove, MovePlaneVelocity) == 0x000058, "Member 'FProposedMove::MovePlaneVelocity' has a wrong offset!");
static_assert(offsetof(FProposedMove, TargetLocation) == 0x000070, "Member 'FProposedMove::TargetLocation' has a wrong offset!");

// ScriptStruct Mover.MoverDataStructBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FMoverDataStructBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMoverDataStructBase) == 0x000008, "Wrong alignment on FMoverDataStructBase");
static_assert(sizeof(FMoverDataStructBase) == 0x000008, "Wrong size on FMoverDataStructBase");

// ScriptStruct Mover.CharacterDefaultInputs
// 0x0068 (0x0070 - 0x0008)
struct FCharacterDefaultInputs final : public FMoverDataStructBase
{
public:
	EMoveInputType                                MoveInputType;                                     // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MoveInput;                                         // 0x0010(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                OrientationIntent;                                 // 0x0028(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ControlRotation;                                   // 0x0040(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SuggestedMovementMode;                             // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsingMovementBase;                                // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    MovementBase;                                      // 0x0060(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MovementBaseBoneName;                              // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpJustPressed;                                // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpPressed;                                    // 0x006D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCharacterDefaultInputs) == 0x000008, "Wrong alignment on FCharacterDefaultInputs");
static_assert(sizeof(FCharacterDefaultInputs) == 0x000070, "Wrong size on FCharacterDefaultInputs");
static_assert(offsetof(FCharacterDefaultInputs, MoveInputType) == 0x000008, "Member 'FCharacterDefaultInputs::MoveInputType' has a wrong offset!");
static_assert(offsetof(FCharacterDefaultInputs, MoveInput) == 0x000010, "Member 'FCharacterDefaultInputs::MoveInput' has a wrong offset!");
static_assert(offsetof(FCharacterDefaultInputs, OrientationIntent) == 0x000028, "Member 'FCharacterDefaultInputs::OrientationIntent' has a wrong offset!");
static_assert(offsetof(FCharacterDefaultInputs, ControlRotation) == 0x000040, "Member 'FCharacterDefaultInputs::ControlRotation' has a wrong offset!");
static_assert(offsetof(FCharacterDefaultInputs, SuggestedMovementMode) == 0x000058, "Member 'FCharacterDefaultInputs::SuggestedMovementMode' has a wrong offset!");
static_assert(offsetof(FCharacterDefaultInputs, bUsingMovementBase) == 0x00005C, "Member 'FCharacterDefaultInputs::bUsingMovementBase' has a wrong offset!");
static_assert(offsetof(FCharacterDefaultInputs, MovementBase) == 0x000060, "Member 'FCharacterDefaultInputs::MovementBase' has a wrong offset!");
static_assert(offsetof(FCharacterDefaultInputs, MovementBaseBoneName) == 0x000068, "Member 'FCharacterDefaultInputs::MovementBaseBoneName' has a wrong offset!");
static_assert(offsetof(FCharacterDefaultInputs, bIsJumpJustPressed) == 0x00006C, "Member 'FCharacterDefaultInputs::bIsJumpJustPressed' has a wrong offset!");
static_assert(offsetof(FCharacterDefaultInputs, bIsJumpPressed) == 0x00006D, "Member 'FCharacterDefaultInputs::bIsJumpPressed' has a wrong offset!");

// ScriptStruct Mover.MoverDefaultSyncState
// 0x0108 (0x0110 - 0x0008)
struct FMoverDefaultSyncState final : public FMoverDataStructBase
{
public:
	struct FVector                                Location;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               Orientation;                                       // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                Velocity;                                          // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                MoveDirectionIntent;                               // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MovementMode;                                      // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    MovementBase;                                      // 0x0070(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MovementBaseBoneName;                              // 0x0078(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
