#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestNeighborModel

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct NearestNeighborModel.NearestNeighborNetworkParameter
// 0x0020 (0x0020 - 0x0000)
struct FNearestNeighborNetworkParameter final
{
public:
	TArray<float>                                 Values;                                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Shape;                                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNearestNeighborNetworkParameter) == 0x000008, "Wrong alignment on FNearestNeighborNetworkParameter");
static_assert(sizeof(FNearestNeighborNetworkParameter) == 0x000020, "Wrong size on FNearestNeighborNetworkParameter");
static_assert(offsetof(FNearestNeighborNetworkParameter, Values) == 0x000000, "Member 'FNearestNeighborNetworkParameter::Values' has a wrong offset!");
static_assert(offsetof(FNearestNeighborNetworkParameter, Shape) == 0x000010, "Member 'FNearestNeighborNetworkParameter::Shape' has a wrong offset!");

// ScriptStruct NearestNeighborModel.ClothPartData
// 0x0080 (0x0080 - 0x0000)
struct FClothPartData final
{
public:
	int32                                         PCACoeffNum;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        PCACoeffStart;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumVertices;                                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumNeighbors;                                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint32>                                VertexMap;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 PCABasis;                                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 VertexMean;                                        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 AssetNeighborCoeffs;                               // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 AssetNeighborOffsets;                              // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 AssetNeighborIndexMap;                             // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NeighborCoeffs;                                    // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClothPartData) == 0x000008, "Wrong alignment on FClothPartData");
static_assert(sizeof(FClothPartData) == 0x000080, "Wrong size on FClothPartData");
static_assert(offsetof(FClothPartData, PCACoeffNum) == 0x000000, "Member 'FClothPartData::PCACoeffNum' has a wrong offset!");
static_assert(offsetof(FClothPartData, PCACoeffStart) == 0x000004, "Member 'FClothPartData::PCACoeffStart' has a wrong offset!");
static_assert(offsetof(FClothPartData, NumVertices) == 0x000008, "Member 'FClothPartData::NumVertices' has a wrong offset!");
static_assert(offsetof(FClothPartData, NumNeighbors) == 0x00000C, "Member 'FClothPartData::NumNeighbors' has a wrong offset!");
static_assert(offsetof(FClothPartData, VertexMap) == 0x000010, "Member 'FClothPartData::VertexMap' has a wrong offset!");
static_assert(offsetof(FClothPartData, PCABasis) == 0x000020, "Member 'FClothPartData::PCABasis' has a wrong offset!");
static_assert(offsetof(FClothPartData, VertexMean) == 0x000030, "Member 'FClothPartData::VertexMean' has a wrong offset!");
static_assert(offsetof(FClothPartData, AssetNeighborCoeffs) == 0x000040, "Member 'FClothPartData::AssetNeighborCoeffs' has a wrong offset!");
static_assert(offsetof(FClothPartData, AssetNeighborOffsets) == 0x000050, "Member 'FClothPartData::AssetNeighborOffsets' has a wrong offset!");
static_assert(offsetof(FClothPartData, AssetNeighborIndexMap) == 0x000060, "Member 'FClothPartData::AssetNeighborIndexMap' has a wrong offset!");
static_assert(offsetof(FClothPartData, NeighborCoeffs) == 0x000070, "Member 'FClothPartData::NeighborCoeffs' has a wrong offset!");

}

