#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestNeighborModel

#include "Basic.hpp"


namespace SDK::Params
{

// Function NearestNeighborModel.NearestNeighborOptimizedNetworkLoader.LoadOptimizedNetwork
// 0x0018 (0x0018 - 0x0000)
struct NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork final
{
public:
	class FString                                 OnnxPath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork) == 0x000008, "Wrong alignment on NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork");
static_assert(sizeof(NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork) == 0x000018, "Wrong size on NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork");
static_assert(offsetof(NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork, OnnxPath) == 0x000000, "Member 'NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork::OnnxPath' has a wrong offset!");
static_assert(offsetof(NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork, ReturnValue) == 0x000010, "Member 'NearestNeighborOptimizedNetworkLoader_LoadOptimizedNetwork::ReturnValue' has a wrong offset!");

// Function NearestNeighborModel.NearestNeighborOptimizedNetworkLoader.GetOptimizedNetwork
// 0x0008 (0x0008 - 0x0000)
struct NearestNeighborOptimizedNetworkLoader_GetOptimizedNetwork final
{
public:
	class UNearestNeighborOptimizedNetwork*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NearestNeighborOptimizedNetworkLoader_GetOptimizedNetwork) == 0x000008, "Wrong alignment on NearestNeighborOptimizedNetworkLoader_GetOptimizedNetwork");
static_assert(sizeof(NearestNeighborOptimizedNetworkLoader_GetOptimizedNetwork) == 0x000008, "Wrong size on NearestNeighborOptimizedNetworkLoader_GetOptimizedNetwork");
static_assert(offsetof(NearestNeighborOptimizedNetworkLoader_GetOptimizedNetwork, ReturnValue) == 0x000000, "Member 'NearestNeighborOptimizedNetworkLoader_GetOptimizedNetwork::ReturnValue' has a wrong offset!");

// Function NearestNeighborModel.NearestNeighborModel.GetNumSections
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetNumSections final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NearestNeighborModel_GetNumSections) == 0x000004, "Wrong alignment on NearestNeighborModel_GetNumSections");
static_assert(sizeof(NearestNeighborModel_GetNumSections) == 0x000004, "Wrong size on NearestNeighborModel_GetNumSections");
static_assert(offsetof(NearestNeighborModel_GetNumSections, ReturnValue) == 0x000000, "Member 'NearestNeighborModel_GetNumSections::ReturnValue' has a wrong offset!");

// Function NearestNeighborModel.NearestNeighborModel.GetPCACoeffStarts
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModel_GetPCACoeffStarts final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NearestNeighborModel_GetPCACoeffStarts) == 0x000008, "Wrong alignment on NearestNeighborModel_GetPCACoeffStarts");
static_assert(sizeof(NearestNeighborModel_GetPCACoeffStarts) == 0x000010, "Wrong size on NearestNeighborModel_GetPCACoeffStarts");
static_assert(offsetof(NearestNeighborModel_GetPCACoeffStarts, ReturnValue) == 0x000000, "Member 'NearestNeighborModel_GetPCACoeffStarts::ReturnValue' has a wrong offset!");

// Function NearestNeighborModel.NearestNeighborModel.GetSectionPtr
// 0x0010 (0x0010 - 0x0000)
struct NearestNeighborModel_GetSectionPtr final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UNearestNeighborModelSection*     ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NearestNeighborModel_GetSectionPtr) == 0x000008, "Wrong alignment on NearestNeighborModel_GetSectionPtr");
static_assert(sizeof(NearestNeighborModel_GetSectionPtr) == 0x000010, "Wrong size on NearestNeighborModel_GetSectionPtr");
static_assert(offsetof(NearestNeighborModel_GetSectionPtr, Index_0) == 0x000000, "Member 'NearestNeighborModel_GetSectionPtr::Index_0' has a wrong offset!");
static_assert(offsetof(NearestNeighborModel_GetSectionPtr, ReturnValue) == 0x000008, "Member 'NearestNeighborModel_GetSectionPtr::ReturnValue' has a wrong offset!");

// Function NearestNeighborModel.NearestNeighborModel.GetTotalNumPCACoeffs
// 0x0004 (0x0004 - 0x0000)
struct NearestNeighborModel_GetTotalNumPCACoeffs final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NearestNeighborModel_GetTotalNumPCACoeffs) == 0x000004, "Wrong alignment on NearestNeighborModel_GetTotalNumPCACoeffs");
static_assert(sizeof(NearestNeighborModel_GetTotalNumPCACoeffs) == 0x000004, "Wrong size on NearestNeighborModel_GetTotalNumPCACoeffs");
static_assert(offsetof(NearestNeighborModel_GetTotalNumPCACoeffs, ReturnValue) == 0x000000, "Member 'NearestNeighborModel_GetTotalNumPCACoeffs::ReturnValue' has a wrong offset!");

// Function NearestNeighborModel.NearestNeighborModel.IsReadyForInference
// 0x0001 (0x0001 - 0x0000)
struct NearestNeighborModel_IsReadyForInference final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NearestNeighborModel_IsReadyForInference) == 0x000001, "Wrong alignment on NearestNeighborModel_IsReadyForInference");
static_assert(sizeof(NearestNeighborModel_IsReadyForInference) == 0x000001, "Wrong size on NearestNeighborModel_IsReadyForInference");
static_assert(offsetof(NearestNeighborModel_IsReadyForInference, ReturnValue) == 0x000000, "Member 'NearestNeighborModel_IsReadyForInference::ReturnValue' has a wrong offset!");

// Function NearestNeighborModel.NearestNeighborModel.IsReadyForTraining
// 0x0001 (0x0001 - 0x0000)
struct NearestNeighborModel_IsReadyForTraining final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NearestNeighborModel_IsReadyForTraining) == 0x000001, "Wrong alignment on NearestNeighborModel_IsReadyForTraining");
static_assert(sizeof(NearestNeighborModel_IsReadyForTraining) == 0x000001, "Wrong size on NearestNeighborModel_IsReadyForTraining");
static_assert(offsetof(NearestNeighborModel_IsReadyForTraining, ReturnValue) == 0x000000, "Member 'NearestNeighborModel_IsReadyForTraining::ReturnValue' has a wrong offset!");

// Function NearestNeighborModel.NearestNeighborModelInstance.Eval
// 0x0020 (0x0020 - 0x0000)
struct NearestNeighborModelInstance_Eval final
{
public:
	TArray<float>                                 InputData;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NearestNeighborModelInstance_Eval) == 0x000008, "Wrong alignment on NearestNeighborModelInstance_Eval");
static_assert(sizeof(NearestNeighborModelInstance_Eval) == 0x000020, "Wrong size on NearestNeighborModelInstance_Eval");
static_assert(offsetof(NearestNeighborModelInstance_Eval, InputData) == 0x000000, "Member 'NearestNeighborModelInstance_Eval::InputData' has a wrong offset!");
static_assert(offsetof(NearestNeighborModelInstance_Eval, ReturnValue) == 0x000010, "Member 'NearestNeighborModelInstance_Eval::ReturnValue' has a wrong offset!");

}

