#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Pawn_Wildlife_Parent

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "NPC_Pawn_Parent_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "Enum_NPC_AlertLevel_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_Pawn_Wildlife_Parent.NPC_Pawn_Wildlife_Parent_C
// 0x01A0 (0x4190 - 0x3FF0)
class ANPC_Pawn_Wildlife_Parent_C final : public ANPC_Pawn_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_Pawn_Wildlife_Parent_C;         // 0x3FE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Wildlife_FootDust;                                 // 0x3FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortPawnComponent_Convert*             ConvertComponent;                                  // 0x3FF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Layer_Idle;                                        // 0x4000(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Layer_Locomotion;                                  // 0x4020(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Layer_Jump;                                        // 0x4040(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                         LeaderTeam;                                        // 0x4060(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4061[0x7];                                     // 0x4061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundEffectSourcePresetChain*          VocalSourceEffectChainOverride;                    // 0x4068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bTamingEnabled;                                    // 0x4070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4071[0x7];                                     // 0x4071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPickupGrabbed_Destroyed;                         // 0x4078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bCanBeInteractedWithWhileTamed;                    // 0x4088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4089[0x3];                                     // 0x4089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            GE_Quest_Converted_Handle;                         // 0x408C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4094[0x4];                                     // 0x4094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GE_Quest_Converted_Irwin;                          // 0x4098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ConvertedDispatcher;                               // 0x40A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsBeingRidden;                                    // 0x40B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPCStatusWidgetShouldDisplayDamage;                // 0x40B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40B2[0x6];                                     // 0x40B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GE_GoalSelectionWhileTamed;                        // 0x40B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_GoalSelectionWhileTamed;                         // 0x40C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        CurrentEnergy;                                     // 0x40E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           IrwinSlidingGC;                                    // 0x40E8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bLeaderSetSuccess;                                 // 0x40EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40ED[0x3];                                     // 0x40ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           JumpLandSoundLibTag;                               // 0x40F0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TameSoundLibTag;                                   // 0x40F4(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundIndicatorSound_Unridden;                      // 0x40F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundIndicatorSound_Ridden;                        // 0x4100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideIncomingDmg;                               // 0x4108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4109[0x7];                                     // 0x4109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OverridenIncomingDmgAmount;                        // 0x4110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnModifiedDamageReceived;                          // 0x4118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        ColorVariation;                                    // 0x4128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Default_Unconvert_Reason;                          // 0x4130(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4131[0x7];                                     // 0x4131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         StuckBouncing_UnstuckEnabled;                      // 0x4138(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         StuckBouncing_LaunchCount;                         // 0x4160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StuckBouncing_MinLaunchCount;                      // 0x4164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            StuckBouncing_GeHandle;                            // 0x4168(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            StuckBouncing_GE;                                  // 0x4170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        StuckBouncing_UnstuckVelocityMaxZRotationAngle;    // 0x4178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StuckBouncing_UnstuckVelocity;                     // 0x4180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AsyncLinkAnimationLayer(TSoftClassPtr<class UClass> AnimationLayer);
	void AttachAndApplyVocalFX(const struct FSoundLibraryPlayResult& SoundLibraryResult);
	float BlueprintModifyIncomingDamage(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FGameplayEffectContextHandle& EffectContext, class AController* EventInstigator, class AActor* DamageCauser);
	void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_0_ConvertedEvent__DelegateSignature(class AFortPawn* InstigatorPawn, class AFortPawn* ConvertedPawn);
	void BndEvt__ConvertComponent_K2Node_ComponentBoundEvent_1_UnconvertedEvent__DelegateSignature(class AFortPawn* UnconvertedPawn, EUnconvertReason UnconvertReason);
	void BndEvt__SoundLibrary_Component_K2Node_ComponentBoundEvent_2_OnSoundLibraryPlayEvent__DelegateSignature(const struct FSoundLibraryPlayResult& Results, const class USoundLibraryContext* Context);
	void CanBeInteractedWithWhenTamed(bool* bCanInteract_0);
	void CE_UpdateSurfaceType(class UActorComponent* Component, bool bReset);
	void ConvertedDispatcher__DelegateSignature(bool Converted, class AFortPawn* InstigatorPawn);
	void ExecuteUbergraph_NPC_Pawn_Wildlife_Parent(int32 EntryPoint);
	void HideStatus();
	void LinkAnimationLayers();
	void NPC_AlertLevelChangedServer(Enum_NPC_AlertLevel NPCAlertLevel);
	void NPC_CanBeInteractedWith(bool* CanInteract);
	void NPC_LeaderSet(bool Success_, class AActor* Leader, EUnconvertReason UnconvertReason);
	void NPC_PickupGrabbed_Destroyed(class AActor* ActorGrabbed);
	void NPC_UpdateHealthBarComponentVisibility();
	void NPCStatusWidget_UpdateKeepVisible(bool ShouldKeepVisible);
	void On_NPC_PawnInteractedWith(class AActor* AIPawn, class AFortPlayerPawn* InteractingPlayerPawn);
	void On_Pawn_Focused(class AFortPawn* FocusedPawn);
	void OnApplyEffectOptimization(const int32 NewBudgetValue);
	void OnBeingControlledChanged(bool bControlled);
	void OnCustomizationsLoaded_BP();
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnLanded(const struct FHitResult& Hit);
	struct FVector OnLaunchCharacter(const struct FVector& LaunchVelocity, bool bXYOverride, bool bZOverride);
	void OnLoaded_9DC5FDA543FAF13BB29E95AA78B28A06(TSubclassOf<class UObject> Loaded);
	void OnModifiedDamageReceived__DelegateSignature();
	void OnOutOfConvertResistanceServer(float ConvertDamageDone, const struct FGameplayTagContainer& SourceTags, const struct FGameplayEffectContextHandle& EffectContext, class AController* EffectInstigator, class AActor* EffectCauser);
	void OnPawnHealthChanged_Event_0();
	void OnPickupGrabbed_Destroyed__DelegateSignature(class ANPC_Pawn_Wildlife_Parent_C* WildlifePawn, class AActor* ActorGrabbed);
	void OnRep_LeaderTeam();
	void OnSlidingStateChanged(bool bNewSlidingState);
	void Play_Sound_Lib(const struct FGameplayTag& Event_Name);
	void Play_Water_Splash_at_Water_Surface(class AFortWaterBodyActor* Water_Body, bool Enter_Water_0);
	void PlayAdditiveHitReacts(const struct FVector& Hit_Direction, class UAnimMontage* Anim_Montage);
	void PlayStateChangeAudio(Enum_NPC_AlertLevel Index_0);
	void ReceiveBeginPlay();
	void RestoreConvertResistance();
	void SetTamingEnabled(bool EnableTaming);
	void TryShowHealthBar();
	void UpdateTamingIndicator();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	bool IsValidAutoFireTarget(const class AActor* Attacker) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Pawn_Wildlife_Parent_C">();
	}
	static class ANPC_Pawn_Wildlife_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_Pawn_Wildlife_Parent_C>();
	}
};
static_assert(alignof(ANPC_Pawn_Wildlife_Parent_C) == 0x000010, "Wrong alignment on ANPC_Pawn_Wildlife_Parent_C");
static_assert(sizeof(ANPC_Pawn_Wildlife_Parent_C) == 0x004190, "Wrong size on ANPC_Pawn_Wildlife_Parent_C");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, UberGraphFrame_NPC_Pawn_Wildlife_Parent_C) == 0x003FE8, "Member 'ANPC_Pawn_Wildlife_Parent_C::UberGraphFrame_NPC_Pawn_Wildlife_Parent_C' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, Wildlife_FootDust) == 0x003FF0, "Member 'ANPC_Pawn_Wildlife_Parent_C::Wildlife_FootDust' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, ConvertComponent) == 0x003FF8, "Member 'ANPC_Pawn_Wildlife_Parent_C::ConvertComponent' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, Layer_Idle) == 0x004000, "Member 'ANPC_Pawn_Wildlife_Parent_C::Layer_Idle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, Layer_Locomotion) == 0x004020, "Member 'ANPC_Pawn_Wildlife_Parent_C::Layer_Locomotion' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, Layer_Jump) == 0x004040, "Member 'ANPC_Pawn_Wildlife_Parent_C::Layer_Jump' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, LeaderTeam) == 0x004060, "Member 'ANPC_Pawn_Wildlife_Parent_C::LeaderTeam' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, VocalSourceEffectChainOverride) == 0x004068, "Member 'ANPC_Pawn_Wildlife_Parent_C::VocalSourceEffectChainOverride' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, bTamingEnabled) == 0x004070, "Member 'ANPC_Pawn_Wildlife_Parent_C::bTamingEnabled' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, OnPickupGrabbed_Destroyed) == 0x004078, "Member 'ANPC_Pawn_Wildlife_Parent_C::OnPickupGrabbed_Destroyed' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, bCanBeInteractedWithWhileTamed) == 0x004088, "Member 'ANPC_Pawn_Wildlife_Parent_C::bCanBeInteractedWithWhileTamed' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, GE_Quest_Converted_Handle) == 0x00408C, "Member 'ANPC_Pawn_Wildlife_Parent_C::GE_Quest_Converted_Handle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, GE_Quest_Converted_Irwin) == 0x004098, "Member 'ANPC_Pawn_Wildlife_Parent_C::GE_Quest_Converted_Irwin' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, ConvertedDispatcher) == 0x0040A0, "Member 'ANPC_Pawn_Wildlife_Parent_C::ConvertedDispatcher' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, bIsBeingRidden) == 0x0040B0, "Member 'ANPC_Pawn_Wildlife_Parent_C::bIsBeingRidden' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, NPCStatusWidgetShouldDisplayDamage) == 0x0040B1, "Member 'ANPC_Pawn_Wildlife_Parent_C::NPCStatusWidgetShouldDisplayDamage' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, GE_GoalSelectionWhileTamed) == 0x0040B8, "Member 'ANPC_Pawn_Wildlife_Parent_C::GE_GoalSelectionWhileTamed' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, T_GoalSelectionWhileTamed) == 0x0040C0, "Member 'ANPC_Pawn_Wildlife_Parent_C::T_GoalSelectionWhileTamed' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, CurrentEnergy) == 0x0040E0, "Member 'ANPC_Pawn_Wildlife_Parent_C::CurrentEnergy' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, IrwinSlidingGC) == 0x0040E8, "Member 'ANPC_Pawn_Wildlife_Parent_C::IrwinSlidingGC' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, bLeaderSetSuccess) == 0x0040EC, "Member 'ANPC_Pawn_Wildlife_Parent_C::bLeaderSetSuccess' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, JumpLandSoundLibTag) == 0x0040F0, "Member 'ANPC_Pawn_Wildlife_Parent_C::JumpLandSoundLibTag' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, TameSoundLibTag) == 0x0040F4, "Member 'ANPC_Pawn_Wildlife_Parent_C::TameSoundLibTag' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, SoundIndicatorSound_Unridden) == 0x0040F8, "Member 'ANPC_Pawn_Wildlife_Parent_C::SoundIndicatorSound_Unridden' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, SoundIndicatorSound_Ridden) == 0x004100, "Member 'ANPC_Pawn_Wildlife_Parent_C::SoundIndicatorSound_Ridden' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, OverrideIncomingDmg) == 0x004108, "Member 'ANPC_Pawn_Wildlife_Parent_C::OverrideIncomingDmg' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, OverridenIncomingDmgAmount) == 0x004110, "Member 'ANPC_Pawn_Wildlife_Parent_C::OverridenIncomingDmgAmount' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, OnModifiedDamageReceived) == 0x004118, "Member 'ANPC_Pawn_Wildlife_Parent_C::OnModifiedDamageReceived' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, ColorVariation) == 0x004128, "Member 'ANPC_Pawn_Wildlife_Parent_C::ColorVariation' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, Default_Unconvert_Reason) == 0x004130, "Member 'ANPC_Pawn_Wildlife_Parent_C::Default_Unconvert_Reason' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, StuckBouncing_UnstuckEnabled) == 0x004138, "Member 'ANPC_Pawn_Wildlife_Parent_C::StuckBouncing_UnstuckEnabled' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, StuckBouncing_LaunchCount) == 0x004160, "Member 'ANPC_Pawn_Wildlife_Parent_C::StuckBouncing_LaunchCount' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, StuckBouncing_MinLaunchCount) == 0x004164, "Member 'ANPC_Pawn_Wildlife_Parent_C::StuckBouncing_MinLaunchCount' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, StuckBouncing_GeHandle) == 0x004168, "Member 'ANPC_Pawn_Wildlife_Parent_C::StuckBouncing_GeHandle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, StuckBouncing_GE) == 0x004170, "Member 'ANPC_Pawn_Wildlife_Parent_C::StuckBouncing_GE' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, StuckBouncing_UnstuckVelocityMaxZRotationAngle) == 0x004178, "Member 'ANPC_Pawn_Wildlife_Parent_C::StuckBouncing_UnstuckVelocityMaxZRotationAngle' has a wrong offset!");
static_assert(offsetof(ANPC_Pawn_Wildlife_Parent_C, StuckBouncing_UnstuckVelocity) == 0x004180, "Member 'ANPC_Pawn_Wildlife_Parent_C::StuckBouncing_UnstuckVelocity' has a wrong offset!");

}

