#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerformanceCaptureCore

#include "Basic.hpp"

#include "IKRig_structs.hpp"
#include "LiveLinkInterface_structs.hpp"


namespace SDK::Params
{

// Function PerformanceCaptureCore.CaptureCharacter.GetCustomRetargetProfile
// 0x0100 (0x0100 - 0x0000)
struct CaptureCharacter_GetCustomRetargetProfile final
{
public:
	struct FRetargetProfile                       ReturnValue;                                       // 0x0000(0x0100)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CaptureCharacter_GetCustomRetargetProfile) == 0x000008, "Wrong alignment on CaptureCharacter_GetCustomRetargetProfile");
static_assert(sizeof(CaptureCharacter_GetCustomRetargetProfile) == 0x000100, "Wrong size on CaptureCharacter_GetCustomRetargetProfile");
static_assert(offsetof(CaptureCharacter_GetCustomRetargetProfile, ReturnValue) == 0x000000, "Member 'CaptureCharacter_GetCustomRetargetProfile::ReturnValue' has a wrong offset!");

// Function PerformanceCaptureCore.CaptureCharacter.SetCustomRetargetProfile
// 0x0100 (0x0100 - 0x0000)
struct CaptureCharacter_SetCustomRetargetProfile final
{
public:
	struct FRetargetProfile                       InProfile;                                         // 0x0000(0x0100)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CaptureCharacter_SetCustomRetargetProfile) == 0x000008, "Wrong alignment on CaptureCharacter_SetCustomRetargetProfile");
static_assert(sizeof(CaptureCharacter_SetCustomRetargetProfile) == 0x000100, "Wrong size on CaptureCharacter_SetCustomRetargetProfile");
static_assert(offsetof(CaptureCharacter_SetCustomRetargetProfile, InProfile) == 0x000000, "Member 'CaptureCharacter_SetCustomRetargetProfile::InProfile' has a wrong offset!");

// Function PerformanceCaptureCore.CaptureCharacter.SetForceAllSkeletalMeshesToFollowLeader
// 0x0001 (0x0001 - 0x0000)
struct CaptureCharacter_SetForceAllSkeletalMeshesToFollowLeader final
{
public:
	bool                                          InFollowLeader;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CaptureCharacter_SetForceAllSkeletalMeshesToFollowLeader) == 0x000001, "Wrong alignment on CaptureCharacter_SetForceAllSkeletalMeshesToFollowLeader");
static_assert(sizeof(CaptureCharacter_SetForceAllSkeletalMeshesToFollowLeader) == 0x000001, "Wrong size on CaptureCharacter_SetForceAllSkeletalMeshesToFollowLeader");
static_assert(offsetof(CaptureCharacter_SetForceAllSkeletalMeshesToFollowLeader, InFollowLeader) == 0x000000, "Member 'CaptureCharacter_SetForceAllSkeletalMeshesToFollowLeader::InFollowLeader' has a wrong offset!");

// Function PerformanceCaptureCore.CaptureCharacter.SetRetargetAsset
// 0x0008 (0x0008 - 0x0000)
struct CaptureCharacter_SetRetargetAsset final
{
public:
	class UIKRetargeter*                          InRetargetAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CaptureCharacter_SetRetargetAsset) == 0x000008, "Wrong alignment on CaptureCharacter_SetRetargetAsset");
static_assert(sizeof(CaptureCharacter_SetRetargetAsset) == 0x000008, "Wrong size on CaptureCharacter_SetRetargetAsset");
static_assert(offsetof(CaptureCharacter_SetRetargetAsset, InRetargetAsset) == 0x000000, "Member 'CaptureCharacter_SetRetargetAsset::InRetargetAsset' has a wrong offset!");

// Function PerformanceCaptureCore.CaptureCharacter.SetSourcePerformer
// 0x0008 (0x0008 - 0x0000)
struct CaptureCharacter_SetSourcePerformer final
{
public:
	class ACapturePerformer*                      InPerformer;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CaptureCharacter_SetSourcePerformer) == 0x000008, "Wrong alignment on CaptureCharacter_SetSourcePerformer");
static_assert(sizeof(CaptureCharacter_SetSourcePerformer) == 0x000008, "Wrong size on CaptureCharacter_SetSourcePerformer");
static_assert(offsetof(CaptureCharacter_SetSourcePerformer, InPerformer) == 0x000000, "Member 'CaptureCharacter_SetSourcePerformer::InPerformer' has a wrong offset!");

// Function PerformanceCaptureCore.CapturePerformer.GetEvaluateLiveLinkData
// 0x0001 (0x0001 - 0x0000)
struct CapturePerformer_GetEvaluateLiveLinkData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CapturePerformer_GetEvaluateLiveLinkData) == 0x000001, "Wrong alignment on CapturePerformer_GetEvaluateLiveLinkData");
static_assert(sizeof(CapturePerformer_GetEvaluateLiveLinkData) == 0x000001, "Wrong size on CapturePerformer_GetEvaluateLiveLinkData");
static_assert(offsetof(CapturePerformer_GetEvaluateLiveLinkData, ReturnValue) == 0x000000, "Member 'CapturePerformer_GetEvaluateLiveLinkData::ReturnValue' has a wrong offset!");

// Function PerformanceCaptureCore.CapturePerformer.SetEvaluateLiveLinkData
// 0x0001 (0x0001 - 0x0000)
struct CapturePerformer_SetEvaluateLiveLinkData final
{
public:
	bool                                          bEvaluateLinkLink;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CapturePerformer_SetEvaluateLiveLinkData) == 0x000001, "Wrong alignment on CapturePerformer_SetEvaluateLiveLinkData");
static_assert(sizeof(CapturePerformer_SetEvaluateLiveLinkData) == 0x000001, "Wrong size on CapturePerformer_SetEvaluateLiveLinkData");
static_assert(offsetof(CapturePerformer_SetEvaluateLiveLinkData, bEvaluateLinkLink) == 0x000000, "Member 'CapturePerformer_SetEvaluateLiveLinkData::bEvaluateLinkLink' has a wrong offset!");

// Function PerformanceCaptureCore.CapturePerformer.SetLiveLinkSubject
// 0x0004 (0x0004 - 0x0000)
struct CapturePerformer_SetLiveLinkSubject final
{
public:
	struct FLiveLinkSubjectName                   Subject;                                           // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CapturePerformer_SetLiveLinkSubject) == 0x000004, "Wrong alignment on CapturePerformer_SetLiveLinkSubject");
static_assert(sizeof(CapturePerformer_SetLiveLinkSubject) == 0x000004, "Wrong size on CapturePerformer_SetLiveLinkSubject");
static_assert(offsetof(CapturePerformer_SetLiveLinkSubject, Subject) == 0x000000, "Member 'CapturePerformer_SetLiveLinkSubject::Subject' has a wrong offset!");

// Function PerformanceCaptureCore.CapturePerformer.SetMocapMesh
// 0x0008 (0x0008 - 0x0000)
struct CapturePerformer_SetMocapMesh final
{
public:
	class USkeletalMesh*                          MocapMesh;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CapturePerformer_SetMocapMesh) == 0x000008, "Wrong alignment on CapturePerformer_SetMocapMesh");
static_assert(sizeof(CapturePerformer_SetMocapMesh) == 0x000008, "Wrong size on CapturePerformer_SetMocapMesh");
static_assert(offsetof(CapturePerformer_SetMocapMesh, MocapMesh) == 0x000000, "Member 'CapturePerformer_SetMocapMesh::MocapMesh' has a wrong offset!");

// Function PerformanceCaptureCore.CapturePerformer.GetLiveLinkSubject
// 0x0004 (0x0004 - 0x0000)
struct CapturePerformer_GetLiveLinkSubject final
{
public:
	struct FLiveLinkSubjectName                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CapturePerformer_GetLiveLinkSubject) == 0x000004, "Wrong alignment on CapturePerformer_GetLiveLinkSubject");
static_assert(sizeof(CapturePerformer_GetLiveLinkSubject) == 0x000004, "Wrong size on CapturePerformer_GetLiveLinkSubject");
static_assert(offsetof(CapturePerformer_GetLiveLinkSubject, ReturnValue) == 0x000000, "Member 'CapturePerformer_GetLiveLinkSubject::ReturnValue' has a wrong offset!");

// Function PerformanceCaptureCore.PerformerComponent.GetEvaluateLiveLinkData
// 0x0001 (0x0001 - 0x0000)
struct PerformerComponent_GetEvaluateLiveLinkData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerformerComponent_GetEvaluateLiveLinkData) == 0x000001, "Wrong alignment on PerformerComponent_GetEvaluateLiveLinkData");
static_assert(sizeof(PerformerComponent_GetEvaluateLiveLinkData) == 0x000001, "Wrong size on PerformerComponent_GetEvaluateLiveLinkData");
static_assert(offsetof(PerformerComponent_GetEvaluateLiveLinkData, ReturnValue) == 0x000000, "Member 'PerformerComponent_GetEvaluateLiveLinkData::ReturnValue' has a wrong offset!");

// Function PerformanceCaptureCore.PerformerComponent.SetEvaluateLiveLinkData
// 0x0001 (0x0001 - 0x0000)
struct PerformerComponent_SetEvaluateLiveLinkData final
{
public:
	bool                                          bEvaluateLinkLink;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerformerComponent_SetEvaluateLiveLinkData) == 0x000001, "Wrong alignment on PerformerComponent_SetEvaluateLiveLinkData");
static_assert(sizeof(PerformerComponent_SetEvaluateLiveLinkData) == 0x000001, "Wrong size on PerformerComponent_SetEvaluateLiveLinkData");
static_assert(offsetof(PerformerComponent_SetEvaluateLiveLinkData, bEvaluateLinkLink) == 0x000000, "Member 'PerformerComponent_SetEvaluateLiveLinkData::bEvaluateLinkLink' has a wrong offset!");

// Function PerformanceCaptureCore.PerformerComponent.SetLiveLinkSubject
// 0x0004 (0x0004 - 0x0000)
struct PerformerComponent_SetLiveLinkSubject final
{
public:
	struct FLiveLinkSubjectName                   Subject;                                           // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerformerComponent_SetLiveLinkSubject) == 0x000004, "Wrong alignment on PerformerComponent_SetLiveLinkSubject");
static_assert(sizeof(PerformerComponent_SetLiveLinkSubject) == 0x000004, "Wrong size on PerformerComponent_SetLiveLinkSubject");
static_assert(offsetof(PerformerComponent_SetLiveLinkSubject, Subject) == 0x000000, "Member 'PerformerComponent_SetLiveLinkSubject::Subject' has a wrong offset!");

// Function PerformanceCaptureCore.PerformerComponent.GetLiveLinkSubject
// 0x0004 (0x0004 - 0x0000)
struct PerformerComponent_GetLiveLinkSubject final
{
public:
	struct FLiveLinkSubjectName                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PerformerComponent_GetLiveLinkSubject) == 0x000004, "Wrong alignment on PerformerComponent_GetLiveLinkSubject");
static_assert(sizeof(PerformerComponent_GetLiveLinkSubject) == 0x000004, "Wrong size on PerformerComponent_GetLiveLinkSubject");
static_assert(offsetof(PerformerComponent_GetLiveLinkSubject, ReturnValue) == 0x000000, "Member 'PerformerComponent_GetLiveLinkSubject::ReturnValue' has a wrong offset!");

// Function PerformanceCaptureCore.RetargetComponent.GetCustomRetargetProfile
// 0x0100 (0x0100 - 0x0000)
struct RetargetComponent_GetCustomRetargetProfile final
{
public:
	struct FRetargetProfile                       ReturnValue;                                       // 0x0000(0x0100)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RetargetComponent_GetCustomRetargetProfile) == 0x000008, "Wrong alignment on RetargetComponent_GetCustomRetargetProfile");
static_assert(sizeof(RetargetComponent_GetCustomRetargetProfile) == 0x000100, "Wrong size on RetargetComponent_GetCustomRetargetProfile");
static_assert(offsetof(RetargetComponent_GetCustomRetargetProfile, ReturnValue) == 0x000000, "Member 'RetargetComponent_GetCustomRetargetProfile::ReturnValue' has a wrong offset!");

// Function PerformanceCaptureCore.RetargetComponent.SetControlledMesh
// 0x0008 (0x0008 - 0x0000)
struct RetargetComponent_SetControlledMesh final
{
public:
	class USkeletalMeshComponent*                 InControlledMesh;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RetargetComponent_SetControlledMesh) == 0x000008, "Wrong alignment on RetargetComponent_SetControlledMesh");
static_assert(sizeof(RetargetComponent_SetControlledMesh) == 0x000008, "Wrong size on RetargetComponent_SetControlledMesh");
static_assert(offsetof(RetargetComponent_SetControlledMesh, InControlledMesh) == 0x000000, "Member 'RetargetComponent_SetControlledMesh::InControlledMesh' has a wrong offset!");

// Function PerformanceCaptureCore.RetargetComponent.SetCustomRetargetProfile
// 0x0100 (0x0100 - 0x0000)
struct RetargetComponent_SetCustomRetargetProfile final
{
public:
	struct FRetargetProfile                       InProfile;                                         // 0x0000(0x0100)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RetargetComponent_SetCustomRetargetProfile) == 0x000008, "Wrong alignment on RetargetComponent_SetCustomRetargetProfile");
static_assert(sizeof(RetargetComponent_SetCustomRetargetProfile) == 0x000100, "Wrong size on RetargetComponent_SetCustomRetargetProfile");
static_assert(offsetof(RetargetComponent_SetCustomRetargetProfile, InProfile) == 0x000000, "Member 'RetargetComponent_SetCustomRetargetProfile::InProfile' has a wrong offset!");

// Function PerformanceCaptureCore.RetargetComponent.SetRetargetAsset
// 0x0008 (0x0008 - 0x0000)
struct RetargetComponent_SetRetargetAsset final
{
public:
	class UIKRetargeter*                          InRetargetAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RetargetComponent_SetRetargetAsset) == 0x000008, "Wrong alignment on RetargetComponent_SetRetargetAsset");
static_assert(sizeof(RetargetComponent_SetRetargetAsset) == 0x000008, "Wrong size on RetargetComponent_SetRetargetAsset");
static_assert(offsetof(RetargetComponent_SetRetargetAsset, InRetargetAsset) == 0x000000, "Member 'RetargetComponent_SetRetargetAsset::InRetargetAsset' has a wrong offset!");

// Function PerformanceCaptureCore.RetargetComponent.SetSourcePerformerMesh
// 0x0008 (0x0008 - 0x0000)
struct RetargetComponent_SetSourcePerformerMesh final
{
public:
	class USkeletalMeshComponent*                 InPerformerMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RetargetComponent_SetSourcePerformerMesh) == 0x000008, "Wrong alignment on RetargetComponent_SetSourcePerformerMesh");
static_assert(sizeof(RetargetComponent_SetSourcePerformerMesh) == 0x000008, "Wrong size on RetargetComponent_SetSourcePerformerMesh");
static_assert(offsetof(RetargetComponent_SetSourcePerformerMesh, InPerformerMesh) == 0x000000, "Member 'RetargetComponent_SetSourcePerformerMesh::InPerformerMesh' has a wrong offset!");

}

