#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerformanceCaptureCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "LiveLinkInterface_structs.hpp"
#include "IKRig_structs.hpp"


namespace SDK
{

// Class PerformanceCaptureCore.CaptureCharacter
// 0x0020 (0x0330 - 0x0310)
class ACaptureCharacter final : public ASkeletalMeshActor
{
public:
	class ACapturePerformer*                      SourcePerformer;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UIKRetargeter*                          RetargetAsset;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceAllSkeletalMeshesToFollowLeader;             // 0x0320(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URetargetComponent*                     RetargetComponent;                                 // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FRetargetProfile GetCustomRetargetProfile();
	void SetCustomRetargetProfile(const struct FRetargetProfile& InProfile);
	void SetForceAllSkeletalMeshesToFollowLeader(bool InFollowLeader);
	void SetRetargetAsset(class UIKRetargeter* InRetargetAsset);
	void SetSourcePerformer(class ACapturePerformer* InPerformer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CaptureCharacter">();
	}
	static class ACaptureCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACaptureCharacter>();
	}
};
static_assert(alignof(ACaptureCharacter) == 0x000008, "Wrong alignment on ACaptureCharacter");
static_assert(sizeof(ACaptureCharacter) == 0x000330, "Wrong size on ACaptureCharacter");
static_assert(offsetof(ACaptureCharacter, SourcePerformer) == 0x000310, "Member 'ACaptureCharacter::SourcePerformer' has a wrong offset!");
static_assert(offsetof(ACaptureCharacter, RetargetAsset) == 0x000318, "Member 'ACaptureCharacter::RetargetAsset' has a wrong offset!");
static_assert(offsetof(ACaptureCharacter, bForceAllSkeletalMeshesToFollowLeader) == 0x000320, "Member 'ACaptureCharacter::bForceAllSkeletalMeshesToFollowLeader' has a wrong offset!");
static_assert(offsetof(ACaptureCharacter, RetargetComponent) == 0x000328, "Member 'ACaptureCharacter::RetargetComponent' has a wrong offset!");

// Class PerformanceCaptureCore.CapturePerformer
// 0x0010 (0x0320 - 0x0310)
class ACapturePerformer final : public ASkeletalMeshActor
{
public:
	struct FLiveLinkSubjectName                   SubjectName;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceAllMeshesToFollowLeader;                     // 0x0314(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvaluateAnimation;                                // 0x0315(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_316[0xA];                                      // 0x0316(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetEvaluateLiveLinkData();
	void SetEvaluateLiveLinkData(bool bEvaluateLinkLink);
	void SetLiveLinkSubject(const struct FLiveLinkSubjectName& Subject);
	void SetMocapMesh(class USkeletalMesh* MocapMesh);

	struct FLiveLinkSubjectName GetLiveLinkSubject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CapturePerformer">();
	}
	static class ACapturePerformer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACapturePerformer>();
	}
};
static_assert(alignof(ACapturePerformer) == 0x000008, "Wrong alignment on ACapturePerformer");
static_assert(sizeof(ACapturePerformer) == 0x000320, "Wrong size on ACapturePerformer");
static_assert(offsetof(ACapturePerformer, SubjectName) == 0x000310, "Member 'ACapturePerformer::SubjectName' has a wrong offset!");
static_assert(offsetof(ACapturePerformer, bForceAllMeshesToFollowLeader) == 0x000314, "Member 'ACapturePerformer::bForceAllMeshesToFollowLeader' has a wrong offset!");
static_assert(offsetof(ACapturePerformer, bEvaluateAnimation) == 0x000315, "Member 'ACapturePerformer::bEvaluateAnimation' has a wrong offset!");

// Class PerformanceCaptureCore.PerformerComponent
// 0x0038 (0x00D8 - 0x00A0)
class UPerformerComponent final : public UActorComponent
{
public:
	struct FLiveLinkSubjectName                   SubjectName;                                       // 0x00A0(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentReference                    ControlledSkeletalMesh;                            // 0x00A8(0x0028)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvaluateAnimation;                                // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceOtherMeshesToFollowControlledMesh;           // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetEvaluateLiveLinkData();
	void SetEvaluateLiveLinkData(bool bEvaluateLinkLink);
	void SetLiveLinkSubject(const struct FLiveLinkSubjectName& Subject);

	struct FLiveLinkSubjectName GetLiveLinkSubject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PerformerComponent">();
	}
	static class UPerformerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerformerComponent>();
	}
};
static_assert(alignof(UPerformerComponent) == 0x000008, "Wrong alignment on UPerformerComponent");
static_assert(sizeof(UPerformerComponent) == 0x0000D8, "Wrong size on UPerformerComponent");
static_assert(offsetof(UPerformerComponent, SubjectName) == 0x0000A0, "Member 'UPerformerComponent::SubjectName' has a wrong offset!");
static_assert(offsetof(UPerformerComponent, ControlledSkeletalMesh) == 0x0000A8, "Member 'UPerformerComponent::ControlledSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UPerformerComponent, bEvaluateAnimation) == 0x0000D0, "Member 'UPerformerComponent::bEvaluateAnimation' has a wrong offset!");
static_assert(offsetof(UPerformerComponent, bForceOtherMeshesToFollowControlledMesh) == 0x0000D1, "Member 'UPerformerComponent::bForceOtherMeshesToFollowControlledMesh' has a wrong offset!");

// Class PerformanceCaptureCore.RetargetAnimInstance
// 0x01D0 (0x0540 - 0x0370)
class URetargetAnimInstance final : public UAnimInstance
{
public:
	struct FAnimNode_RetargetPoseFromMesh         RetargetNode;                                      // 0x0368(0x01D8)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RetargetAnimInstance">();
	}
	static class URetargetAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<URetargetAnimInstance>();
	}
};
static_assert(alignof(URetargetAnimInstance) == 0x000010, "Wrong alignment on URetargetAnimInstance");
static_assert(sizeof(URetargetAnimInstance) == 0x000540, "Wrong size on URetargetAnimInstance");
static_assert(offsetof(URetargetAnimInstance, RetargetNode) == 0x000368, "Member 'URetargetAnimInstance::RetargetNode' has a wrong offset!");

// Class PerformanceCaptureCore.RetargetComponent
// 0x0168 (0x0208 - 0x00A0)
class URetargetComponent final : public UActorComponent
{
public:
	struct FComponentReference                    SourceSkeletalMeshComponent;                       // 0x00A0(0x0028)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FComponentReference                    ControlledSkeletalMeshComponent;                   // 0x00C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceOtherMeshesToFollowControlledMesh;           // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIKRetargeter*                          RetargetAsset;                                     // 0x00F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRetargetProfile                       CustomRetargetProfile;                             // 0x0100(0x0100)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPublic)
	uint8                                         Pad_200[0x8];                                      // 0x0200(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FRetargetProfile GetCustomRetargetProfile();
	void SetControlledMesh(class USkeletalMeshComponent* InControlledMesh);
	void SetCustomRetargetProfile(const struct FRetargetProfile& InProfile);
	void SetRetargetAsset(class UIKRetargeter* InRetargetAsset);
	void SetSourcePerformerMesh(class USkeletalMeshComponent* InPerformerMesh);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RetargetComponent">();
	}
	static class URetargetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URetargetComponent>();
	}
};
static_assert(alignof(URetargetComponent) == 0x000008, "Wrong alignment on URetargetComponent");
static_assert(sizeof(URetargetComponent) == 0x000208, "Wrong size on URetargetComponent");
static_assert(offsetof(URetargetComponent, SourceSkeletalMeshComponent) == 0x0000A0, "Member 'URetargetComponent::SourceSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(URetargetComponent, ControlledSkeletalMeshComponent) == 0x0000C8, "Member 'URetargetComponent::ControlledSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(URetargetComponent, bForceOtherMeshesToFollowControlledMesh) == 0x0000F0, "Member 'URetargetComponent::bForceOtherMeshesToFollowControlledMesh' has a wrong offset!");
static_assert(offsetof(URetargetComponent, RetargetAsset) == 0x0000F8, "Member 'URetargetComponent::RetargetAsset' has a wrong offset!");
static_assert(offsetof(URetargetComponent, CustomRetargetProfile) == 0x000100, "Member 'URetargetComponent::CustomRetargetProfile' has a wrong offset!");

}

