#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_InAir_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Player_InAir_AnimBP.Player_InAir_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x1C9F (0x1CA0 - 0x0001)
struct Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_836;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_837;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_838;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_839;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_840;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_841;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_842;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_843;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_844;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_845;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_846;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_847;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_848;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_849;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_850;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_851;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_852;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_853;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_854;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_855;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_856;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_857;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_858;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_859;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_860;                               // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_861;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_862;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_863;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_864;                               // 0x00A8(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_865;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_866;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_867;                                 // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_868;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_869;                                 // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_870;                              // 0x00CC(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_871;                                // 0x00F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_872;                                // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_873;                                 // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_874;                                // 0x0104(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_875;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_876;                               // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_877;                                // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_878;                                // 0x0111(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_879;                                // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_880;                                // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_881;                               // 0x0120(0x0010)(BlueprintVisible, EditFixedSize)
	ERefPoseType                                  __ByteProperty_882;                                // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_883;                                // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_884;                                  // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_885;                                // 0x0148(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_886;                                // 0x0149(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_887;                                // 0x014A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_888;                               // 0x0150(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_889;                              // 0x0160(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0178(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01F8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_22;                             // 0x0210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_14;                  // 0x0240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_21;                             // 0x0270(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_13;                  // 0x02A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_20;                             // 0x02D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_12;                  // 0x0300(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_19;                             // 0x0330(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_11;                  // 0x0360(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_18;                             // 0x0368(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_10;                  // 0x0398(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_17;                             // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_9;                   // 0x03D0(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_16;                             // 0x03D8(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_8;                   // 0x0408(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_15;                             // 0x0410(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_14;                             // 0x0440(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_13;                             // 0x0470(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_12;                             // 0x04A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_7;                   // 0x04D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_11;                             // 0x0500(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_6;                   // 0x0530(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_10;                             // 0x0560(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_9;                              // 0x0590(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_8;                              // 0x05C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_7;                              // 0x05F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_5;                   // 0x0620(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                              // 0x0650(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;                   // 0x0680(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_3;                   // 0x06B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                              // 0x06E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;                   // 0x0710(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                              // 0x0740(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;                   // 0x0770(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                              // 0x07A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_14;                  // 0x07D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_24;                   // 0x0800(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_23;                   // 0x0830(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_22;                   // 0x0860(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_13;                  // 0x0890(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_21;                   // 0x08C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_20;                   // 0x08F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_12;                  // 0x0920(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_7;                      // 0x0950(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_11;                  // 0x0980(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_19;                   // 0x09B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_2;                   // 0x09E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                              // 0x0A10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_10;                  // 0x0A40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;                   // 0x0A70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;                   // 0x0AA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;                   // 0x0AD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_9;                   // 0x0B00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;                   // 0x0B30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;                   // 0x0B60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_8;                   // 0x0B90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_6;                      // 0x0BC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;                   // 0x0BF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;                   // 0x0C20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;                   // 0x0C50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                              // 0x0C80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;                   // 0x0CB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;                   // 0x0CE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;                   // 0x0D10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;                   // 0x0D40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;                   // 0x0D70(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;                    // 0x0DA0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;                   // 0x0DD0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;                    // 0x0E00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;                   // 0x0E30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;                    // 0x0E60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_5;                      // 0x0E90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;                   // 0x0EC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;                    // 0x0EF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;                     // 0x0F20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0F50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                     // 0x0F80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                      // 0x0FB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_5;                  // 0x0FE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_23;                 // 0x1010(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_22;                 // 0x1040(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_21;                 // 0x1070(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_20;                 // 0x10A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_19;                 // 0x10D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_18;                 // 0x1100(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;                 // 0x1130(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;                 // 0x1160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;                 // 0x1190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;                 // 0x11C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;                 // 0x11F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;                 // 0x1220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;                    // 0x1250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;                       // 0x1280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x12B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                       // 0x12E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x1310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x1340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                      // 0x1370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                     // 0x13A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                     // 0x13D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;                 // 0x1400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;                 // 0x1430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;                  // 0x1460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;                  // 0x1490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;                  // 0x14C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;                  // 0x14F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;                  // 0x1520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;                  // 0x1550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x1580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x15B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x15E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x1610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_4;                   // 0x1640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_4;                      // 0x1670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_2;                       // 0x16A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_3;                   // 0x16D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_4;                  // 0x1700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x1730(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x1760(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_2;                   // 0x1790(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_3;                      // 0x17C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_1;                       // 0x17F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_1;                   // 0x1820(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x1850(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_3;                  // 0x1880(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x18B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer;                     // 0x18E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_2;                      // 0x1910(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;                         // 0x1940(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Layer;                               // 0x1970(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_2;                  // 0x19A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x19D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x1A00(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x1A30(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization;                     // 0x1A60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x1A90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x1AC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                     // 0x1AF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;                   // 0x1B20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve;                         // 0x1B50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;                  // 0x1B80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_1;                      // 0x1BB0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x1BE0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose;                        // 0x1C10(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x1C40(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                       // 0x1C70(0x0030)()
};
static_assert(alignof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x001CA0, "Wrong size on Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_836) == 0x000004, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_836' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_837) == 0x000008, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_837' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_838) == 0x00000C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_838' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_839) == 0x000010, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_839' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_840) == 0x000014, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_840' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_841) == 0x000018, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_841' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_842) == 0x00001C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_842' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_843) == 0x000020, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_843' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_844) == 0x000024, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_844' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_845) == 0x000028, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_845' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_846) == 0x00002C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_846' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_847) == 0x000030, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_847' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_848) == 0x000034, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_848' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_849) == 0x000038, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_849' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_850) == 0x00003C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_850' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_851) == 0x000040, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_851' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_852) == 0x000044, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_852' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_853) == 0x000048, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_853' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_854) == 0x00004C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_854' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_855) == 0x000050, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_855' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_856) == 0x000054, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_856' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_857) == 0x000058, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_857' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_858) == 0x00005C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_858' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_859) == 0x000060, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_859' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_860) == 0x000068, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_860' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_861) == 0x000078, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_861' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_862) == 0x000088, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_862' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_863) == 0x000098, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_863' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_864) == 0x0000A8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_864' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_865) == 0x0000B8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_865' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_866) == 0x0000BC, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_866' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_867) == 0x0000C0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_867' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_868) == 0x0000C4, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_868' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_869) == 0x0000C8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_869' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_870) == 0x0000CC, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_870' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_871) == 0x0000F8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_871' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_872) == 0x0000FC, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_872' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_873) == 0x000100, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_873' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_874) == 0x000104, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_874' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_875) == 0x000108, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_875' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_876) == 0x00010C, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_876' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_877) == 0x000110, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_877' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_878) == 0x000111, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_878' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_879) == 0x000114, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_879' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_880) == 0x000118, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_880' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_881) == 0x000120, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_881' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_882) == 0x000130, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_882' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_883) == 0x000138, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_883' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_884) == 0x000140, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_884' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_885) == 0x000148, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_885' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_886) == 0x000149, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_886' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_887) == 0x00014A, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_887' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_888) == 0x000150, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_888' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_889) == 0x000160, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_889' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000178, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001F8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_22) == 0x000210, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_14) == 0x000240, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_14' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_21) == 0x000270, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_13) == 0x0002A0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_20) == 0x0002D0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_12) == 0x000300, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_19) == 0x000330, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_11) == 0x000360, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_18) == 0x000368, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_10) == 0x000398, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_17) == 0x0003A0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_9) == 0x0003D0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_16) == 0x0003D8, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_8) == 0x000408, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_15) == 0x000410, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_14) == 0x000440, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_13) == 0x000470, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_12) == 0x0004A0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_7) == 0x0004D0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_11) == 0x000500, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_6) == 0x000530, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_10) == 0x000560, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_9) == 0x000590, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_8) == 0x0005C0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_7) == 0x0005F0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_5) == 0x000620, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_6) == 0x000650, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_4) == 0x000680, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_3) == 0x0006B0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_5) == 0x0006E0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_2) == 0x000710, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x000740, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x000770, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x0007A0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_14) == 0x0007D0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_14' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_24) == 0x000800, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_24' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_23) == 0x000830, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_23' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_22) == 0x000860, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_22' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_13) == 0x000890, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_13' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_21) == 0x0008C0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_21' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_20) == 0x0008F0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_20' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_12) == 0x000920, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_12' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_IdentityPose_7) == 0x000950, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_IdentityPose_7' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_11) == 0x000980, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_11' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_19) == 0x0009B0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_19' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_2) == 0x0009E0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x000A10, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_10) == 0x000A40, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_10' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_18) == 0x000A70, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_17) == 0x000AA0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_16) == 0x000AD0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_9) == 0x000B00, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_9' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_15) == 0x000B30, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_14) == 0x000B60, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_8) == 0x000B90, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_8' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_IdentityPose_6) == 0x000BC0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_IdentityPose_6' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_7) == 0x000BF0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_13) == 0x000C20, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByEnum_1) == 0x000C50, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x000C80, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_12) == 0x000CB0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_6) == 0x000CE0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_11) == 0x000D10, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_10) == 0x000D40, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_5) == 0x000D70, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_9) == 0x000DA0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_4) == 0x000DD0, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_8) == 0x000E00, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x000E30, "Member 'Player_InAir_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
