#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_Sprint_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Player_Sprint_AnimBP.Player_Sprint_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x096F (0x0970 - 0x0001)
struct Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_267;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_268;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_269;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_270;                                // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_271;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_272;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_273;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_274;                              // 0x0030(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_275;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_276;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_277;                                // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_278;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_279;                                // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_280;                               // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_281;                                // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_282;                                // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_283;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_284;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_285;                                  // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_286;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_287;                                // 0x0089(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_288;                                // 0x008A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_289;                               // 0x0090(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_290;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_291;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_292;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_293;                              // 0x00B0(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0160(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;                  // 0x0190(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x01C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x01F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x0220(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;                    // 0x0250(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;                    // 0x0280(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;                   // 0x02B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x02E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;                    // 0x0310(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;                    // 0x0340(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;                   // 0x0370(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x03A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x03D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;                      // 0x0400(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone;                      // 0x0430(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;                  // 0x0460(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_4;                     // 0x0490(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_3;                     // 0x04C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x04F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;                   // 0x0520(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x0550(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x0580(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x05B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;                   // 0x05E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_2;                     // 0x0610(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;                     // 0x0640(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0670(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x06A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                              // 0x06D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                     // 0x0700(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;                  // 0x0730(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;                  // 0x0760(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x0790(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x07C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                     // 0x07F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                       // 0x0820(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                                // 0x0850(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;                    // 0x0880(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x08B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x08E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                      // 0x0910(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization;                     // 0x0940(0x0030)()
};
static_assert(alignof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000970, "Wrong size on Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_267) == 0x000004, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_267' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_268) == 0x000008, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_268' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_269) == 0x00000C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_269' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_270) == 0x000010, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_270' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_271) == 0x000018, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_271' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_272) == 0x000028, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_272' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_273) == 0x00002C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_273' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_274) == 0x000030, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_274' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_275) == 0x00005C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_275' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_276) == 0x000060, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_276' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_277) == 0x000061, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_277' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_278) == 0x000064, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_278' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_279) == 0x000068, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_279' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_280) == 0x00006C, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_280' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_281) == 0x000070, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_281' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_282) == 0x000071, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_282' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_283) == 0x000074, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_283' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_284) == 0x000078, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_284' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_285) == 0x000080, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_285' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_286) == 0x000088, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_286' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_287) == 0x000089, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_287' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_288) == 0x00008A, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_288' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_289) == 0x000090, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_289' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_290) == 0x0000A0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_290' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_291) == 0x0000A4, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_291' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_292) == 0x0000A8, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_292' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_293) == 0x0000B0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_293' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000160, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000190, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x0001C0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x0001F0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000220, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_8) == 0x000250, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_7) == 0x000280, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_4) == 0x0002B0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x0002E0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_6) == 0x000310, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_5) == 0x000340, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x000370, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0003A0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0003D0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine_1) == 0x000400, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotateRootBone) == 0x000430, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotateRootBone' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_2) == 0x000460, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_4) == 0x000490, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_4' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_3) == 0x0004C0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_3' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x0004F0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x000520, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000550, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000580, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0005B0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x0005E0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_2) == 0x000610, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive_1) == 0x000640, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000670, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x0006A0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x0006D0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x000700, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend_1) == 0x000730, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_1) == 0x000760, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x000790, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x0007C0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x0007F0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000820, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x000850, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000880, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0008B0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0008E0, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000910, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Inertialization) == 0x000940, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Inertialization' has a wrong offset!");

// ScriptStruct Player_Sprint_AnimBP.Player_Sprint_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x002B (0x002C - 0x0001)
struct Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x00002C, "Wrong size on Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Player_Sprint_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
