#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAugmentsUIDirector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "DynamicUI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerAugmentsUIDirector.PlayerAugmentsUIDirector_C
// 0x0040 (0x02F0 - 0x02B0)
class APlayerAugmentsUIDirector_C final : public ADynamicUIDirectorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         AugmentsEnabledViaHotfix;                          // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	EHudVisibilityState                           SpectatorHudState;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAugmentsHudToggle;                                // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowAugmentsUI;                                   // 0x02EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Update_Augments_Spectator_UI_Visibility();
	void ReceiveBeginPlay();
	void On_HUD_VIsibility_Changed(const EHudVisibilityState IsVisible);
	void Initialize_Augments_Spectator_UI_Visibility(class AFortPlayerController* Player_Controller);
	void ExecuteUbergraph_PlayerAugmentsUIDirector(int32 EntryPoint);
	void CustomEvent(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerAugmentsUIDirector_C">();
	}
	static class APlayerAugmentsUIDirector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerAugmentsUIDirector_C>();
	}
};
static_assert(alignof(APlayerAugmentsUIDirector_C) == 0x000008, "Wrong alignment on APlayerAugmentsUIDirector_C");
static_assert(sizeof(APlayerAugmentsUIDirector_C) == 0x0002F0, "Wrong size on APlayerAugmentsUIDirector_C");
static_assert(offsetof(APlayerAugmentsUIDirector_C, UberGraphFrame) == 0x0002B0, "Member 'APlayerAugmentsUIDirector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerAugmentsUIDirector_C, DefaultSceneRoot) == 0x0002B8, "Member 'APlayerAugmentsUIDirector_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APlayerAugmentsUIDirector_C, AugmentsEnabledViaHotfix) == 0x0002C0, "Member 'APlayerAugmentsUIDirector_C::AugmentsEnabledViaHotfix' has a wrong offset!");
static_assert(offsetof(APlayerAugmentsUIDirector_C, SpectatorHudState) == 0x0002E8, "Member 'APlayerAugmentsUIDirector_C::SpectatorHudState' has a wrong offset!");
static_assert(offsetof(APlayerAugmentsUIDirector_C, bAugmentsHudToggle) == 0x0002E9, "Member 'APlayerAugmentsUIDirector_C::bAugmentsHudToggle' has a wrong offset!");
static_assert(offsetof(APlayerAugmentsUIDirector_C, bShowAugmentsUI) == 0x0002EA, "Member 'APlayerAugmentsUIDirector_C::bShowAugmentsUI' has a wrong offset!");

}

