#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_DBNO_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Player_DBNO_AnimBP.Player_DBNO_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x06A7 (0x06A8 - 0x0001)
struct Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_152;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_153;                               // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_154;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_155;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_156;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_157;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_158;                               // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_159;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_160;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_161;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_162;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_163;                              // 0x0030(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_164;                               // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_165;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_166;                                // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_167;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_168;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_169;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_170;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_171;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_172;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_173;                                // 0x007C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_174;                                // 0x007D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_175;                                // 0x007E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_176;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_177;                              // 0x0088(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0138(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;                 // 0x0168(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;                  // 0x0198(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;                  // 0x01C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;                  // 0x01F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;                  // 0x0228(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;                  // 0x0258(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;                  // 0x0288(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x02B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x02E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x0318(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x0348(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;                       // 0x0378(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x03A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x03D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0408(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x0438(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;                  // 0x0468(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x0498(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x04C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x04F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0528(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x0558(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;                       // 0x0588(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x05B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                        // 0x05E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;               // 0x0618(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;               // 0x0648(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                          // 0x0678(0x0030)()
};
static_assert(alignof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0006A8, "Wrong size on Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_152) == 0x000004, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_152' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_153) == 0x000008, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_153' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_154) == 0x00000C, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_154' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_155) == 0x000010, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_155' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_156) == 0x000014, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_156' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_157) == 0x000018, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_157' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_158) == 0x00001C, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_158' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_159) == 0x000020, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_159' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_160) == 0x000024, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_160' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_161) == 0x000028, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_161' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_162) == 0x00002C, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_162' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_163) == 0x000030, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_163' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_164) == 0x00005C, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_164' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_165) == 0x000060, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_165' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_166) == 0x000061, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_166' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_167) == 0x000064, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_167' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_168) == 0x000068, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_168' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_169) == 0x00006C, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_169' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_170) == 0x000070, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_170' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_171) == 0x000074, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_171' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_172) == 0x000078, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_172' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_173) == 0x00007C, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_173' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_174) == 0x00007D, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_174' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_175) == 0x00007E, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_175' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_176) == 0x000080, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_176' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_177) == 0x000088, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_177' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000138, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_10) == 0x000168, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_9) == 0x000198, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_8) == 0x0001C8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_7) == 0x0001F8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_6) == 0x000228, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x000258, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000288, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x0002B8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x0002E8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x000318, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000348, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_4) == 0x000378, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x0003A8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x0003D8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000408, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000438, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_1) == 0x000468, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000498, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0004C8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x0004F8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000528, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000558, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyAdditive) == 0x000588, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x0005B8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x0005E8, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000618, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x000648, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000678, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");

// ScriptStruct Player_DBNO_AnimBP.Player_DBNO_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'Player_DBNO_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");

}

