#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PurchaseNavButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PurchaseNavButton.PurchaseNavButton_C.ExecuteUbergraph_PurchaseNavButton
// 0x0168 (0x0168 - 0x0000)
struct PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B8(0x0018)()
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x00D0(0x0010)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_1;               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton) == 0x000008, "Wrong alignment on PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton");
static_assert(sizeof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton) == 0x000168, "Wrong size on PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, EntryPoint) == 0x000000, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_struct_Variable) == 0x000010, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_IsUsingTouch_ReturnValue) == 0x000020, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_bool_Variable) == 0x000021, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_byte_Variable) == 0x000030, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_byte_Variable_1) == 0x000040, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_bool_Variable_1) == 0x000041, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_object_Variable) == 0x000048, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_object_Variable_1) == 0x000050, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000058, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Split_LeftS) == 0x000070, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Split_RightS) == 0x000080, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Split_ReturnValue) == 0x000090, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_PlayAnimation_ReturnValue) == 0x0000B0, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B8, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_MakeStruct_DataTableRowHandle) == 0x0000D0, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_Select_Default) == 0x0000E0, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_Select_Default_1) == 0x0000E8, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_GetEndTime_ReturnValue) == 0x0000F0, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000F8, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000100, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_Event_IsDesignTime) == 0x000108, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_struct_Variable_1) == 0x000110, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000120, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, Temp_bool_Variable_2) == 0x000128, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_SpawnSound2D_ReturnValue) == 0x000130, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, K2Node_Select_Default_2) == 0x000138, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_SpawnSound2D_ReturnValue_1) == 0x000148, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_SpawnSound2D_ReturnValue_2) == 0x000150, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000158, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton, CallFunc_IsUsingTouch_ReturnValue_1) == 0x000160, "Member 'PurchaseNavButton_C_ExecuteUbergraph_PurchaseNavButton::CallFunc_IsUsingTouch_ReturnValue_1' has a wrong offset!");

// Function PurchaseNavButton.PurchaseNavButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PurchaseNavButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PurchaseNavButton_C_PreConstruct) == 0x000001, "Wrong alignment on PurchaseNavButton_C_PreConstruct");
static_assert(sizeof(PurchaseNavButton_C_PreConstruct) == 0x000001, "Wrong size on PurchaseNavButton_C_PreConstruct");
static_assert(offsetof(PurchaseNavButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PurchaseNavButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PurchaseNavButton.PurchaseNavButton_C.ResetHoverAnimation
// 0x0020 (0x0020 - 0x0000)
struct PurchaseNavButton_C_ResetHoverAnimation final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PurchaseNavButton_C_ResetHoverAnimation) == 0x000008, "Wrong alignment on PurchaseNavButton_C_ResetHoverAnimation");
static_assert(sizeof(PurchaseNavButton_C_ResetHoverAnimation) == 0x000020, "Wrong size on PurchaseNavButton_C_ResetHoverAnimation");
static_assert(offsetof(PurchaseNavButton_C_ResetHoverAnimation, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'PurchaseNavButton_C_ResetHoverAnimation::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ResetHoverAnimation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'PurchaseNavButton_C_ResetHoverAnimation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ResetHoverAnimation, CallFunc_IsUsingTouch_ReturnValue) == 0x000010, "Member 'PurchaseNavButton_C_ResetHoverAnimation::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ResetHoverAnimation, CallFunc_GetEndTime_ReturnValue) == 0x000014, "Member 'PurchaseNavButton_C_ResetHoverAnimation::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_ResetHoverAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'PurchaseNavButton_C_ResetHoverAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function PurchaseNavButton.PurchaseNavButton_C.UpdateTextSize
// 0x00F8 (0x00F8 - 0x0000)
struct PurchaseNavButton_C_UpdateTextSize final
{
public:
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0010(0x0058)(HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0090(0x0058)(HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Size_ImplicitCast;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PurchaseNavButton_C_UpdateTextSize) == 0x000008, "Wrong alignment on PurchaseNavButton_C_UpdateTextSize");
static_assert(sizeof(PurchaseNavButton_C_UpdateTextSize) == 0x0000F8, "Wrong size on PurchaseNavButton_C_UpdateTextSize");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_MakeLiteralInt_ReturnValue) == 0x000000, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, K2Node_MakeStruct_SlateFontInfo) == 0x000010, "Member 'PurchaseNavButton_C_UpdateTextSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_GetDesiredSize_ReturnValue) == 0x000068, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_BreakVector2D_X) == 0x000078, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_BreakVector2D_Y) == 0x000080, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000088, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, K2Node_MakeStruct_SlateFontInfo_1) == 0x000090, "Member 'PurchaseNavButton_C_UpdateTextSize::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, K2Node_MakeStruct_Size_ImplicitCast) == 0x0000E8, "Member 'PurchaseNavButton_C_UpdateTextSize::K2Node_MakeStruct_Size_ImplicitCast' has a wrong offset!");
static_assert(offsetof(PurchaseNavButton_C_UpdateTextSize, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x0000F0, "Member 'PurchaseNavButton_C_UpdateTextSize::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

