#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RiderUIDirector

#include "Basic.hpp"


namespace SDK::Params
{

// Function RiderUIDirector.RiderUIDirector_C.ExecuteUbergraph_RiderUIDirector
// 0x0018 (0x0018 - 0x0000)
struct RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningLocalPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSubGame_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector) == 0x000008, "Wrong alignment on RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector");
static_assert(sizeof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector) == 0x000018, "Wrong size on RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, EntryPoint) == 0x000000, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::EntryPoint' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_GetOwningLocalPlayerController_ReturnValue) == 0x000008, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_GetOwningLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_IsUsingTouch_ReturnValue) == 0x000010, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_IsInSubGame_ReturnValue) == 0x000011, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_IsInSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_IsMobileGame_ReturnValue) == 0x000012, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'RiderUIDirector_C_ExecuteUbergraph_RiderUIDirector::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

