#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlidingLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0C27 (0x0C28 - 0x0001)
struct SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_313;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_314;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_315;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_316;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_317;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_318;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_319;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_320;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_321;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_322;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_323;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_324;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_325;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_326;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_327;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_328;                               // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_329;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_330;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_331;                               // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_332;                              // 0x005C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_333;                               // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_334;                                // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_335;                                // 0x008D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_336;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_337;                                  // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_338;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_339;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_340;                                // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_341;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	ERefPoseType                                  __ByteProperty_342;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_343;                              // 0x00C0(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_344;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_345;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0160(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_7;                   // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_6;                   // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                              // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_5;                   // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                              // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;                   // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                              // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_3;                   // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive_5;            // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                              // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_6;                  // 0x0358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;                   // 0x0388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose_1;                      // 0x03B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_5;                  // 0x03E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x0418(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                              // 0x0448(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;                   // 0x0478(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone_1;                    // 0x04A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;                  // 0x04D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;                  // 0x0508(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;                  // 0x0538(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;                  // 0x0568(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;                  // 0x0598(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;                  // 0x05C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;                  // 0x05F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;                    // 0x0628(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;                   // 0x0658(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x0688(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;                    // 0x06B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_4;                  // 0x06E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x0718(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_3;                  // 0x0748(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;                    // 0x0778(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;                       // 0x07A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;                  // 0x07D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;                       // 0x0808(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x0838(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;                    // 0x0868(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;                  // 0x0898(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                       // 0x08C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x08F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;                    // 0x0928(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;                    // 0x0958(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                         // 0x0988(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                        // 0x09B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                      // 0x09E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;                   // 0x0A18(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                     // 0x0A48(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                       // 0x0A78(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotateRootBone;                      // 0x0AA8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;                   // 0x0AD8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                              // 0x0B08(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                     // 0x0B38(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                      // 0x0B68(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x0B98(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_IdentityPose;                        // 0x0BC8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x0BF8(0x0030)()
};
static_assert(alignof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000C28, "Wrong size on SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_313) == 0x000004, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_313' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_314) == 0x000008, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_314' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_315) == 0x00000C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_315' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_316) == 0x000010, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_316' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_317) == 0x000014, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_317' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_318) == 0x000018, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_318' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_319) == 0x00001C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_319' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_320) == 0x000020, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_320' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_321) == 0x000024, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_321' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_322) == 0x000028, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_322' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_323) == 0x00002C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_323' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_324) == 0x000030, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_324' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_325) == 0x000034, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_325' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_326) == 0x000038, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_326' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_327) == 0x00003C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_327' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_328) == 0x000040, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_328' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_329) == 0x000050, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_329' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_330) == 0x000054, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_330' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_331) == 0x000058, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_331' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_332) == 0x00005C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_332' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_333) == 0x000088, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_333' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_334) == 0x00008C, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_334' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_335) == 0x00008D, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_335' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_336) == 0x000090, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_336' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_337) == 0x000098, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_337' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_338) == 0x0000A0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_338' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_339) == 0x0000A1, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_339' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_340) == 0x0000A2, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_340' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_341) == 0x0000A8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_341' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_342) == 0x0000B8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_342' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_343) == 0x0000C0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_343' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_344) == 0x0000D8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_344' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_345) == 0x0000DC, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_345' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E0, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000160, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_7) == 0x000178, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_6) == 0x0001A8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_6) == 0x0001D8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_5) == 0x000208, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_5) == 0x000238, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_4) == 0x000268, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_4) == 0x000298, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_3) == 0x0002C8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyMeshSpaceAdditive_5) == 0x0002F8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyMeshSpaceAdditive_5' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_3) == 0x000328, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_6) == 0x000358, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_6' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_3) == 0x000388, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_IdentityPose_1) == 0x0003B8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_IdentityPose_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_5) == 0x0003E8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_5' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyMeshSpaceAdditive_4) == 0x000418, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyMeshSpaceAdditive_4' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_2) == 0x000448, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_2) == 0x000478, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotateRootBone_1) == 0x0004A8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotateRootBone_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_7) == 0x0004D8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_6) == 0x000508, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_5) == 0x000538, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_4) == 0x000568, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_3) == 0x000598, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_2) == 0x0005C8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult_1) == 0x0005F8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000628, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_2) == 0x000658, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyMeshSpaceAdditive_3) == 0x000688, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyMeshSpaceAdditive_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_4) == 0x0006B8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_4) == 0x0006E8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_4' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyMeshSpaceAdditive_2) == 0x000718, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyMeshSpaceAdditive_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_3) == 0x000748, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_3) == 0x000778, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_3) == 0x0007A8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_2) == 0x0007D8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_2) == 0x000808, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyMeshSpaceAdditive_1) == 0x000838, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyMeshSpaceAdditive_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_2) == 0x000868, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer_1) == 0x000898, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0008C8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ApplyMeshSpaceAdditive) == 0x0008F8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ApplyMeshSpaceAdditive' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000928, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x000958, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000988, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x0009B8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x0009E8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000A18, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000A48, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000A78, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotateRootBone) == 0x000AA8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotateRootBone' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose_1) == 0x000AD8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root_1) == 0x000B08, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LinkedInputPose) == 0x000B38, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000B68, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000B98, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_IdentityPose) == 0x000BC8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000BF8, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");

// ScriptStruct SlidingLayerAnimBP.SlidingLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x003F (0x0040 - 0x0001)
struct SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x003D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000040, "Wrong size on SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'SlidingLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
