#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsExperimental

#include "Basic.hpp"

#include "SpatialMetricsCore_classes.hpp"
#include "SpatialMetricsExperimental_structs.hpp"
#include "SpatialMetrics_structs.hpp"


namespace SDK
{

// Class SpatialMetricsExperimental.ActorPackageDependencyARDiskSizeMetric_Archive
// 0x02D8 (0x0330 - 0x0058)
class UActorPackageDependencyARDiskSizeMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x2D8];                                     // 0x0058(0x02D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyARDiskSizeMetric_Archive">();
	}
	static class UActorPackageDependencyARDiskSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyARDiskSizeMetric_Archive>();
	}
};
static_assert(alignof(UActorPackageDependencyARDiskSizeMetric_Archive) == 0x000008, "Wrong alignment on UActorPackageDependencyARDiskSizeMetric_Archive");
static_assert(sizeof(UActorPackageDependencyARDiskSizeMetric_Archive) == 0x000330, "Wrong size on UActorPackageDependencyARDiskSizeMetric_Archive");

// Class SpatialMetricsExperimental.ActorPackageDependencyCountMetric_Archive
// 0x02D0 (0x0328 - 0x0058)
class UActorPackageDependencyCountMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x2D0];                                     // 0x0058(0x02D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyCountMetric_Archive">();
	}
	static class UActorPackageDependencyCountMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyCountMetric_Archive>();
	}
};
static_assert(alignof(UActorPackageDependencyCountMetric_Archive) == 0x000008, "Wrong alignment on UActorPackageDependencyCountMetric_Archive");
static_assert(sizeof(UActorPackageDependencyCountMetric_Archive) == 0x000328, "Wrong size on UActorPackageDependencyCountMetric_Archive");

// Class SpatialMetricsExperimental.ActorPackageDependencyIoDispatcherSizeMetric_Archive
// 0x02E0 (0x0338 - 0x0058)
class UActorPackageDependencyIoDispatcherSizeMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x2D8];                                     // 0x0058(0x02D8)(Fixing Size After Last Property [ Dumper-7 ])
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyIoDispatcherSizeMetric_Archive">();
	}
	static class UActorPackageDependencyIoDispatcherSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyIoDispatcherSizeMetric_Archive>();
	}
};
static_assert(alignof(UActorPackageDependencyIoDispatcherSizeMetric_Archive) == 0x000008, "Wrong alignment on UActorPackageDependencyIoDispatcherSizeMetric_Archive");
static_assert(sizeof(UActorPackageDependencyIoDispatcherSizeMetric_Archive) == 0x000338, "Wrong size on UActorPackageDependencyIoDispatcherSizeMetric_Archive");
static_assert(offsetof(UActorPackageDependencyIoDispatcherSizeMetric_Archive, ChunkTypeFlags) == 0x000330, "Member 'UActorPackageDependencyIoDispatcherSizeMetric_Archive::ChunkTypeFlags' has a wrong offset!");

// Class SpatialMetricsExperimental.ActorPackageDependencyResourceSizeMetric_Archive
// 0x02E0 (0x0338 - 0x0058)
class UActorPackageDependencyResourceSizeMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x2D8];                                     // 0x0058(0x02D8)(Fixing Size After Last Property [ Dumper-7 ])
	EResourceSizeMemoryCategory                   MemoryCategoryFlags;                               // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyResourceSizeMetric_Archive">();
	}
	static class UActorPackageDependencyResourceSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyResourceSizeMetric_Archive>();
	}
};
static_assert(alignof(UActorPackageDependencyResourceSizeMetric_Archive) == 0x000008, "Wrong alignment on UActorPackageDependencyResourceSizeMetric_Archive");
static_assert(sizeof(UActorPackageDependencyResourceSizeMetric_Archive) == 0x000338, "Wrong size on UActorPackageDependencyResourceSizeMetric_Archive");
static_assert(offsetof(UActorPackageDependencyResourceSizeMetric_Archive, MemoryCategoryFlags) == 0x000330, "Member 'UActorPackageDependencyResourceSizeMetric_Archive::MemoryCategoryFlags' has a wrong offset!");

// Class SpatialMetricsExperimental.LevelPackageDependencyIoDispatcherSizeMetric_IoStore
// 0x03A0 (0x03F8 - 0x0058)
class ULevelPackageDependencyIoDispatcherSizeMetric_IoStore final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_58[0x390];                                     // 0x0058(0x0390)(Fixing Size After Last Property [ Dumper-7 ])
	class USpatialMetricsPackageMetadataProvider* IoStorePackageHandler;                             // 0x03E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelPackageDependencyIoDispatcherSizeMetric_IoStore">();
	}
	static class ULevelPackageDependencyIoDispatcherSizeMetric_IoStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelPackageDependencyIoDispatcherSizeMetric_IoStore>();
	}
};
static_assert(alignof(ULevelPackageDependencyIoDispatcherSizeMetric_IoStore) == 0x000008, "Wrong alignment on ULevelPackageDependencyIoDispatcherSizeMetric_IoStore");
static_assert(sizeof(ULevelPackageDependencyIoDispatcherSizeMetric_IoStore) == 0x0003F8, "Wrong size on ULevelPackageDependencyIoDispatcherSizeMetric_IoStore");
static_assert(offsetof(ULevelPackageDependencyIoDispatcherSizeMetric_IoStore, IoStorePackageHandler) == 0x0003E8, "Member 'ULevelPackageDependencyIoDispatcherSizeMetric_IoStore::IoStorePackageHandler' has a wrong offset!");
static_assert(offsetof(ULevelPackageDependencyIoDispatcherSizeMetric_IoStore, ChunkTypeFlags) == 0x0003F0, "Member 'ULevelPackageDependencyIoDispatcherSizeMetric_IoStore::ChunkTypeFlags' has a wrong offset!");

// Class SpatialMetricsExperimental.SpatialMetricsPackageMetadataProvider
// 0x0008 (0x0088 - 0x0080)
class USpatialMetricsPackageMetadataProvider final : public USpatialMetricsSubsystemExtension
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsPackageMetadataProvider">();
	}
	static class USpatialMetricsPackageMetadataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsPackageMetadataProvider>();
	}
};
static_assert(alignof(USpatialMetricsPackageMetadataProvider) == 0x000008, "Wrong alignment on USpatialMetricsPackageMetadataProvider");
static_assert(sizeof(USpatialMetricsPackageMetadataProvider) == 0x000088, "Wrong size on USpatialMetricsPackageMetadataProvider");

}

