#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanchUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum SrirachaRanchUI.ERadioMenuAction
// NumValues: 0x0005
enum class ERadioMenuAction : uint8
{
	ToggleOnOff                              = 0,
	NextStation                              = 1,
	PreviousStation                          = 2,
	Count                                    = 3,
	ERadioMenuAction_MAX                     = 4,
};

// ScriptStruct SrirachaRanchUI.RadioMenuActionData
// 0x00F0 (0x00F0 - 0x0000)
struct FRadioMenuActionData final
{
public:
	ERadioMenuAction                              ActionType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ActionBrush;                                       // 0x0010(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   ActionText;                                        // 0x00D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRadioMenuActionData) == 0x000010, "Wrong alignment on FRadioMenuActionData");
static_assert(sizeof(FRadioMenuActionData) == 0x0000F0, "Wrong size on FRadioMenuActionData");
static_assert(offsetof(FRadioMenuActionData, ActionType) == 0x000000, "Member 'FRadioMenuActionData::ActionType' has a wrong offset!");
static_assert(offsetof(FRadioMenuActionData, ActionBrush) == 0x000010, "Member 'FRadioMenuActionData::ActionBrush' has a wrong offset!");
static_assert(offsetof(FRadioMenuActionData, ActionText) == 0x0000D0, "Member 'FRadioMenuActionData::ActionText' has a wrong offset!");

}

