#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StunningMountainOffhand_Axe_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct StunningMountainOffhand_Axe_AnimBP.StunningMountainOffhand_Axe_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

// ScriptStruct StunningMountainOffhand_Axe_AnimBP.StunningMountainOffhand_Axe_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x0537 (0x0538 - 0x0001)
struct StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_67;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_68;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_69;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_70;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_71;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_72;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_73;                                 // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_74;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_75;                               // 0x0038(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0050(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D0(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                                // 0x00E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SubInput;                            // 0x0118(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;                    // 0x0148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                     // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_6;                        // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_5;                        // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_2;             // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_2;             // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1;             // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1;             // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody_1;                         // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_4;                        // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                     // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                     // 0x0358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;               // 0x0388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;               // 0x03B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RigidBody;                           // 0x03E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                      // 0x0418(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                       // 0x0448(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;                        // 0x0478(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;                        // 0x04A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;                        // 0x04D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                          // 0x0508(0x0030)()
};
static_assert(alignof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000538, "Wrong size on StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_67) == 0x000004, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_67' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_68) == 0x000008, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_68' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_69) == 0x000010, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_69' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_70) == 0x000018, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_70' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_71) == 0x000020, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_71' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_72) == 0x000021, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_72' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_73) == 0x000022, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_73' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_74) == 0x000028, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_74' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_75) == 0x000038, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_75' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000050, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D0, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000E8, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SubInput) == 0x000118, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x000148, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x000178, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_6) == 0x0001A8, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_5) == 0x0001D8, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace_2) == 0x000208, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace_2) == 0x000238, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace_1) == 0x000268, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace_1) == 0x000298, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RigidBody_1) == 0x0002C8, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_4) == 0x0002F8, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000328, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000358, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000388, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x0003B8, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RigidBody) == 0x0003E8, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000418, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000448, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_3) == 0x000478, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_2) == 0x0004A8, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone_1) == 0x0004D8, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x000508, "Member 'StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");

}

