#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StunningMountainOffhand_Axe_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StunningMountainOffhand_Axe_AnimBP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass StunningMountainOffhand_Axe_AnimBP.StunningMountainOffhand_Axe_AnimBP_C
// 0x1EC0 (0x25E0 - 0x0720)
class UStunningMountainOffhand_Axe_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct StunningMountainOffhand_Axe_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0728(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_72A[0x6];                                      // 0x072A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0730(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0738(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0740(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0760(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0810(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0888(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x08B0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x09D8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0B00(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x0B20(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0B40(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0B60(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0B80(0x0970)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x14F0(0x0128)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1618(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1660(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1688(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x16A8(0x0020)()
	uint8                                         Pad_16C8[0x8];                                     // 0x16C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x16D0(0x0970)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2040(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x20B8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x20E0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x2208(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2330(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2458(0x0128)()
	struct FVector                                backBolt;                                          // 0x2580(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FrontBolt;                                         // 0x2598(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          JumpAlpha;                                         // 0x25B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B1[0x7];                                     // 0x25B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        JumpMoveAlpha;                                     // 0x25B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Left;                                              // 0x25C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C1[0x7];                                     // 0x25C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        JumpSide;                                          // 0x25C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLarge;                                           // 0x25D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D1[0x7];                                     // 0x25D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Owning_Pawn;                                       // 0x25D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnCharacterCustomizationLoaded(const class USkeletalMeshComponent* CustomBaseMesh, const TArray<class UCustomCharacterPart*>& CustomParts, const TArray<class USkeletalMeshComponentBudgeted*>& CustomMeshParts);
	void ExecuteUbergraph_StunningMountainOffhand_Axe_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_StunningMountainOffhand_Axe_AnimBP_AnimGraphNode_ModifyBone_7EF8DFB34A072F4B35900392BDECFB7A();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StunningMountainOffhand_Axe_AnimBP_C">();
	}
	static class UStunningMountainOffhand_Axe_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStunningMountainOffhand_Axe_AnimBP_C>();
	}
};
static_assert(alignof(UStunningMountainOffhand_Axe_AnimBP_C) == 0x000010, "Wrong alignment on UStunningMountainOffhand_Axe_AnimBP_C");
static_assert(sizeof(UStunningMountainOffhand_Axe_AnimBP_C) == 0x0025E0, "Wrong size on UStunningMountainOffhand_Axe_AnimBP_C");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, UberGraphFrame) == 0x000720, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, __AnimBlueprintMutables) == 0x000728, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000730, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimBlueprintExtension_Base) == 0x000738, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_Root) == 0x000740, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_SubInput) == 0x000760, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x000810, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x000888, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x0008B0, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x0009D8, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000B00, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x000B20, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000B40, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000B60, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x000B80, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x0014F0, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001618, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x001660, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001688, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0016A8, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_RigidBody) == 0x0016D0, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002040, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x0020B8, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x0020E0, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x002208, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x002330, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002458, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, backBolt) == 0x002580, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::backBolt' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, FrontBolt) == 0x002598, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::FrontBolt' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, JumpAlpha) == 0x0025B0, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::JumpAlpha' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, JumpMoveAlpha) == 0x0025B8, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::JumpMoveAlpha' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, Left) == 0x0025C0, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::Left' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, JumpSide) == 0x0025C8, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::JumpSide' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, IsLarge) == 0x0025D0, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::IsLarge' has a wrong offset!");
static_assert(offsetof(UStunningMountainOffhand_Axe_AnimBP_C, Owning_Pawn) == 0x0025D8, "Member 'UStunningMountainOffhand_Axe_AnimBP_C::Owning_Pawn' has a wrong offset!");

}

