#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunRoseFlyingRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FlyingCodeRuntime_structs.hpp"


namespace SDK
{

// Enum SunRoseFlyingRuntime.EWingedFlyingStatus
// NumValues: 0x0007
enum class EWingedFlyingStatus : uint8
{
	Default                                  = 0,
	Boosting                                 = 1,
	Ascending                                = 2,
	Crashing                                 = 4,
	DodgingLeft                              = 8,
	DodgingRight                             = 16,
	EWingedFlyingStatus_MAX                  = 17,
};

// ScriptStruct SunRoseFlyingRuntime.FlyingStatusConfig
// 0x00B0 (0x00B0 - 0x0000)
struct FFlyingStatusConfig final
{
public:
	EWingedFlyingStatus                           Status;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         InitialEnergyCost;                                 // 0x0008(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CooldownTag;                                       // 0x0030(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         CooldownDuration;                                  // 0x0038(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         OnGoingEnergyCost;                                 // 0x0060(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         EndOnEmptyEnergy;                                  // 0x0088(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFlyingStatusConfig) == 0x000008, "Wrong alignment on FFlyingStatusConfig");
static_assert(sizeof(FFlyingStatusConfig) == 0x0000B0, "Wrong size on FFlyingStatusConfig");
static_assert(offsetof(FFlyingStatusConfig, Status) == 0x000000, "Member 'FFlyingStatusConfig::Status' has a wrong offset!");
static_assert(offsetof(FFlyingStatusConfig, InitialEnergyCost) == 0x000008, "Member 'FFlyingStatusConfig::InitialEnergyCost' has a wrong offset!");
static_assert(offsetof(FFlyingStatusConfig, CooldownTag) == 0x000030, "Member 'FFlyingStatusConfig::CooldownTag' has a wrong offset!");
static_assert(offsetof(FFlyingStatusConfig, CooldownDuration) == 0x000038, "Member 'FFlyingStatusConfig::CooldownDuration' has a wrong offset!");
static_assert(offsetof(FFlyingStatusConfig, OnGoingEnergyCost) == 0x000060, "Member 'FFlyingStatusConfig::OnGoingEnergyCost' has a wrong offset!");
static_assert(offsetof(FFlyingStatusConfig, EndOnEmptyEnergy) == 0x000088, "Member 'FFlyingStatusConfig::EndOnEmptyEnergy' has a wrong offset!");

// ScriptStruct SunRoseFlyingRuntime.FortMovementMode_WingedFlyingRuntimeData
// 0x0088 (0x00D0 - 0x0048)
struct FFortMovementMode_WingedFlyingRuntimeData final : public FFortMovementMode_FlyingRuntimeData
{
public:
	uint8                                         Pad_48[0x2];                                       // 0x0048(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsStartingFlying;                                 // 0x004A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWingedFlyingStatus                           FlyingStatus;                                      // 0x004B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x34];                                      // 0x004C(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentHeightAboveWorld;                           // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolatedHeightAboveWorld;                      // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMultiplierFromForwardInput;                   // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolatedYInput;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InterpolatedCrashInput;                            // 0x0090(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlyingEnergy;                                      // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x2C];                                      // 0x00A4(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortMovementMode_WingedFlyingRuntimeData) == 0x000008, "Wrong alignment on FFortMovementMode_WingedFlyingRuntimeData");
static_assert(sizeof(FFortMovementMode_WingedFlyingRuntimeData) == 0x0000D0, "Wrong size on FFortMovementMode_WingedFlyingRuntimeData");
static_assert(offsetof(FFortMovementMode_WingedFlyingRuntimeData, bIsStartingFlying) == 0x00004A, "Member 'FFortMovementMode_WingedFlyingRuntimeData::bIsStartingFlying' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_WingedFlyingRuntimeData, FlyingStatus) == 0x00004B, "Member 'FFortMovementMode_WingedFlyingRuntimeData::FlyingStatus' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_WingedFlyingRuntimeData, CurrentHeightAboveWorld) == 0x000080, "Member 'FFortMovementMode_WingedFlyingRuntimeData::CurrentHeightAboveWorld' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_WingedFlyingRuntimeData, InterpolatedHeightAboveWorld) == 0x000084, "Member 'FFortMovementMode_WingedFlyingRuntimeData::InterpolatedHeightAboveWorld' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_WingedFlyingRuntimeData, SpeedMultiplierFromForwardInput) == 0x000088, "Member 'FFortMovementMode_WingedFlyingRuntimeData::SpeedMultiplierFromForwardInput' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_WingedFlyingRuntimeData, InterpolatedYInput) == 0x00008C, "Member 'FFortMovementMode_WingedFlyingRuntimeData::InterpolatedYInput' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_WingedFlyingRuntimeData, InterpolatedCrashInput) == 0x000090, "Member 'FFortMovementMode_WingedFlyingRuntimeData::InterpolatedCrashInput' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_WingedFlyingRuntimeData, FlyingEnergy) == 0x0000A0, "Member 'FFortMovementMode_WingedFlyingRuntimeData::FlyingEnergy' has a wrong offset!");

// ScriptStruct SunRoseFlyingRuntime.FortMovementMode_WingedFlyingCreationData
// 0x0008 (0x0030 - 0x0028)
struct FFortMovementMode_WingedFlyingCreationData final : public FFortMovementMode_FlyingCreationData
{
public:
	float                                         FlyingEnergy;                                      // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumeExtraLeapEnergy;                           // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFortMovementMode_WingedFlyingCreationData) == 0x000008, "Wrong alignment on FFortMovementMode_WingedFlyingCreationData");
static_assert(sizeof(FFortMovementMode_WingedFlyingCreationData) == 0x000030, "Wrong size on FFortMovementMode_WingedFlyingCreationData");
static_assert(offsetof(FFortMovementMode_WingedFlyingCreationData, FlyingEnergy) == 0x000028, "Member 'FFortMovementMode_WingedFlyingCreationData::FlyingEnergy' has a wrong offset!");
static_assert(offsetof(FFortMovementMode_WingedFlyingCreationData, bConsumeExtraLeapEnergy) == 0x00002C, "Member 'FFortMovementMode_WingedFlyingCreationData::bConsumeExtraLeapEnergy' has a wrong offset!");

}

