#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunRoseZeusGameplayRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TargetingSystem_structs.hpp"


namespace SDK::Params
{

// Function SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm.GetStrikeTargetingLocation
// 0x0020 (0x0020 - 0x0000)
struct BuildingGameplayActorZeusThunderstorm_GetStrikeTargetingLocation final
{
public:
	struct FTargetingRequestHandle                TargetingHandle;                                   // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorZeusThunderstorm_GetStrikeTargetingLocation) == 0x000008, "Wrong alignment on BuildingGameplayActorZeusThunderstorm_GetStrikeTargetingLocation");
static_assert(sizeof(BuildingGameplayActorZeusThunderstorm_GetStrikeTargetingLocation) == 0x000020, "Wrong size on BuildingGameplayActorZeusThunderstorm_GetStrikeTargetingLocation");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_GetStrikeTargetingLocation, TargetingHandle) == 0x000000, "Member 'BuildingGameplayActorZeusThunderstorm_GetStrikeTargetingLocation::TargetingHandle' has a wrong offset!");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_GetStrikeTargetingLocation, ReturnValue) == 0x000008, "Member 'BuildingGameplayActorZeusThunderstorm_GetStrikeTargetingLocation::ReturnValue' has a wrong offset!");

// Function SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm.K2_OnLightningStrike
// 0x0018 (0x0018 - 0x0000)
struct BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrike final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrike) == 0x000008, "Wrong alignment on BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrike");
static_assert(sizeof(BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrike) == 0x000018, "Wrong size on BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrike");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrike, Location) == 0x000000, "Member 'BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrike::Location' has a wrong offset!");

// Function SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm.K2_OnLightningStrikeFX
// 0x0020 (0x0020 - 0x0000)
struct BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrikeFX final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoltHeight;                                        // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrikeFX) == 0x000008, "Wrong alignment on BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrikeFX");
static_assert(sizeof(BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrikeFX) == 0x000020, "Wrong size on BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrikeFX");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrikeFX, Location) == 0x000000, "Member 'BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrikeFX::Location' has a wrong offset!");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrikeFX, BoltHeight) == 0x000018, "Member 'BuildingGameplayActorZeusThunderstorm_K2_OnLightningStrikeFX::BoltHeight' has a wrong offset!");

// Function SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm.K2_OnTelegraphStart
// 0x0018 (0x0018 - 0x0000)
struct BuildingGameplayActorZeusThunderstorm_K2_OnTelegraphStart final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorZeusThunderstorm_K2_OnTelegraphStart) == 0x000008, "Wrong alignment on BuildingGameplayActorZeusThunderstorm_K2_OnTelegraphStart");
static_assert(sizeof(BuildingGameplayActorZeusThunderstorm_K2_OnTelegraphStart) == 0x000018, "Wrong size on BuildingGameplayActorZeusThunderstorm_K2_OnTelegraphStart");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_K2_OnTelegraphStart, Location) == 0x000000, "Member 'BuildingGameplayActorZeusThunderstorm_K2_OnTelegraphStart::Location' has a wrong offset!");

// Function SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm.OnTelegraphStart
// 0x0018 (0x0018 - 0x0000)
struct BuildingGameplayActorZeusThunderstorm_OnTelegraphStart final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorZeusThunderstorm_OnTelegraphStart) == 0x000008, "Wrong alignment on BuildingGameplayActorZeusThunderstorm_OnTelegraphStart");
static_assert(sizeof(BuildingGameplayActorZeusThunderstorm_OnTelegraphStart) == 0x000018, "Wrong size on BuildingGameplayActorZeusThunderstorm_OnTelegraphStart");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_OnTelegraphStart, Location) == 0x000000, "Member 'BuildingGameplayActorZeusThunderstorm_OnTelegraphStart::Location' has a wrong offset!");

// Function SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm.SetStrikeTargetingLocation
// 0x0020 (0x0020 - 0x0000)
struct BuildingGameplayActorZeusThunderstorm_SetStrikeTargetingLocation final
{
public:
	struct FTargetingRequestHandle                TargetingHandle;                                   // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorZeusThunderstorm_SetStrikeTargetingLocation) == 0x000008, "Wrong alignment on BuildingGameplayActorZeusThunderstorm_SetStrikeTargetingLocation");
static_assert(sizeof(BuildingGameplayActorZeusThunderstorm_SetStrikeTargetingLocation) == 0x000020, "Wrong size on BuildingGameplayActorZeusThunderstorm_SetStrikeTargetingLocation");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_SetStrikeTargetingLocation, TargetingHandle) == 0x000000, "Member 'BuildingGameplayActorZeusThunderstorm_SetStrikeTargetingLocation::TargetingHandle' has a wrong offset!");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_SetStrikeTargetingLocation, Location) == 0x000008, "Member 'BuildingGameplayActorZeusThunderstorm_SetStrikeTargetingLocation::Location' has a wrong offset!");

// Function SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm.StartLightningStrike
// 0x0020 (0x0020 - 0x0000)
struct BuildingGameplayActorZeusThunderstorm_StartLightningStrike final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoltHeight;                                        // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BuildingGameplayActorZeusThunderstorm_StartLightningStrike) == 0x000008, "Wrong alignment on BuildingGameplayActorZeusThunderstorm_StartLightningStrike");
static_assert(sizeof(BuildingGameplayActorZeusThunderstorm_StartLightningStrike) == 0x000020, "Wrong size on BuildingGameplayActorZeusThunderstorm_StartLightningStrike");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_StartLightningStrike, Location) == 0x000000, "Member 'BuildingGameplayActorZeusThunderstorm_StartLightningStrike::Location' has a wrong offset!");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_StartLightningStrike, BoltHeight) == 0x000018, "Member 'BuildingGameplayActorZeusThunderstorm_StartLightningStrike::BoltHeight' has a wrong offset!");

// Function SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm.StrikeLightning
// 0x0018 (0x0018 - 0x0000)
struct BuildingGameplayActorZeusThunderstorm_StrikeLightning final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BuildingGameplayActorZeusThunderstorm_StrikeLightning) == 0x000008, "Wrong alignment on BuildingGameplayActorZeusThunderstorm_StrikeLightning");
static_assert(sizeof(BuildingGameplayActorZeusThunderstorm_StrikeLightning) == 0x000018, "Wrong size on BuildingGameplayActorZeusThunderstorm_StrikeLightning");
static_assert(offsetof(BuildingGameplayActorZeusThunderstorm_StrikeLightning, Location) == 0x000000, "Member 'BuildingGameplayActorZeusThunderstorm_StrikeLightning::Location' has a wrong offset!");

}

