#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunRoseChainWhipGameplay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "TargetingSystem_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class SunRoseChainWhipGameplay.Chains_SunRose_Sharp_Wep_AnimInstance
// 0x0040 (0x0760 - 0x0720)
class UChains_SunRose_Sharp_Wep_AnimInstance final : public UCustomCharacterPartAnimInstance
{
public:
	float                                         AttackRange;                                       // 0x0720(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActiveTechniqueIndex;                              // 0x0724(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTechniqueActive;                                // 0x0728(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasIsTargetingTag;                                // 0x0729(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72A[0x2];                                      // 0x072A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PawnVelocitySpeed;                                 // 0x072C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PawnVelocitySpeedCutoff;                           // 0x0730(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAttack_01;                                      // 0x0734(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAttack_02;                                      // 0x0735(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAttack_03;                                      // 0x0736(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAllowPhysics;                                   // 0x0737(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMantisDone;                                     // 0x0738(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUpperBodyAttack_01;                             // 0x0739(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUpperBodyAttack_02;                             // 0x073A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73B[0x1];                                      // 0x073B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         XMoveRight;                                        // 0x073C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XMoveLeft;                                         // 0x0740(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YMoveFwd;                                          // 0x0744(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIs700Distance;                                    // 0x0748(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIs1200Distance;                                   // 0x0749(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74A[0x2];                                      // 0x074A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttackRange700;                                    // 0x074C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttackRange1200;                                   // 0x0750(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttackRange1500;                                   // 0x0754(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           IsTargetingTag;                                    // 0x0758(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Chains_SunRose_Sharp_Wep_AnimInstance">();
	}
	static class UChains_SunRose_Sharp_Wep_AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChains_SunRose_Sharp_Wep_AnimInstance>();
	}
};
static_assert(alignof(UChains_SunRose_Sharp_Wep_AnimInstance) == 0x000010, "Wrong alignment on UChains_SunRose_Sharp_Wep_AnimInstance");
static_assert(sizeof(UChains_SunRose_Sharp_Wep_AnimInstance) == 0x000760, "Wrong size on UChains_SunRose_Sharp_Wep_AnimInstance");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, AttackRange) == 0x000720, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::AttackRange' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, ActiveTechniqueIndex) == 0x000724, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::ActiveTechniqueIndex' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIsTechniqueActive) == 0x000728, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIsTechniqueActive' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bHasIsTargetingTag) == 0x000729, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bHasIsTargetingTag' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, PawnVelocitySpeed) == 0x00072C, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::PawnVelocitySpeed' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, PawnVelocitySpeedCutoff) == 0x000730, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::PawnVelocitySpeedCutoff' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIsAttack_01) == 0x000734, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIsAttack_01' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIsAttack_02) == 0x000735, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIsAttack_02' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIsAttack_03) == 0x000736, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIsAttack_03' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIsAllowPhysics) == 0x000737, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIsAllowPhysics' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIsMantisDone) == 0x000738, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIsMantisDone' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIsUpperBodyAttack_01) == 0x000739, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIsUpperBodyAttack_01' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIsUpperBodyAttack_02) == 0x00073A, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIsUpperBodyAttack_02' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, XMoveRight) == 0x00073C, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::XMoveRight' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, XMoveLeft) == 0x000740, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::XMoveLeft' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, YMoveFwd) == 0x000744, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::YMoveFwd' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIs700Distance) == 0x000748, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIs700Distance' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, bIs1200Distance) == 0x000749, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::bIs1200Distance' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, AttackRange700) == 0x00074C, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::AttackRange700' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, AttackRange1200) == 0x000750, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::AttackRange1200' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, AttackRange1500) == 0x000754, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::AttackRange1500' has a wrong offset!");
static_assert(offsetof(UChains_SunRose_Sharp_Wep_AnimInstance, IsTargetingTag) == 0x000758, "Member 'UChains_SunRose_Sharp_Wep_AnimInstance::IsTargetingTag' has a wrong offset!");

// Class SunRoseChainWhipGameplay.Hades_Player_LayerAnimInstance
// 0x0020 (0x1640 - 0x1620)
class UHades_Player_LayerAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsMotorcycle;                                     // 0x1620(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHookshot;                                       // 0x1621(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTechniqueActive;                                // 0x1622(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHadesAO;                                        // 0x1623(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUpperBodyReplacement;                           // 0x1624(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1625[0x3];                                     // 0x1625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           MotorcycleTag;                                     // 0x1628(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           HookshotTag;                                       // 0x162C(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DisableGrindRailUpperBodyCorrectTag;               // 0x1630(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1634[0xC];                                     // 0x1634(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Hades_Player_LayerAnimInstance">();
	}
	static class UHades_Player_LayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHades_Player_LayerAnimInstance>();
	}
};
static_assert(alignof(UHades_Player_LayerAnimInstance) == 0x000010, "Wrong alignment on UHades_Player_LayerAnimInstance");
static_assert(sizeof(UHades_Player_LayerAnimInstance) == 0x001640, "Wrong size on UHades_Player_LayerAnimInstance");
static_assert(offsetof(UHades_Player_LayerAnimInstance, bIsMotorcycle) == 0x001620, "Member 'UHades_Player_LayerAnimInstance::bIsMotorcycle' has a wrong offset!");
static_assert(offsetof(UHades_Player_LayerAnimInstance, bIsHookshot) == 0x001621, "Member 'UHades_Player_LayerAnimInstance::bIsHookshot' has a wrong offset!");
static_assert(offsetof(UHades_Player_LayerAnimInstance, bIsTechniqueActive) == 0x001622, "Member 'UHades_Player_LayerAnimInstance::bIsTechniqueActive' has a wrong offset!");
static_assert(offsetof(UHades_Player_LayerAnimInstance, bIsHadesAO) == 0x001623, "Member 'UHades_Player_LayerAnimInstance::bIsHadesAO' has a wrong offset!");
static_assert(offsetof(UHades_Player_LayerAnimInstance, bIsUpperBodyReplacement) == 0x001624, "Member 'UHades_Player_LayerAnimInstance::bIsUpperBodyReplacement' has a wrong offset!");
static_assert(offsetof(UHades_Player_LayerAnimInstance, MotorcycleTag) == 0x001628, "Member 'UHades_Player_LayerAnimInstance::MotorcycleTag' has a wrong offset!");
static_assert(offsetof(UHades_Player_LayerAnimInstance, HookshotTag) == 0x00162C, "Member 'UHades_Player_LayerAnimInstance::HookshotTag' has a wrong offset!");
static_assert(offsetof(UHades_Player_LayerAnimInstance, DisableGrindRailUpperBodyCorrectTag) == 0x001630, "Member 'UHades_Player_LayerAnimInstance::DisableGrindRailUpperBodyCorrectTag' has a wrong offset!");

// Class SunRoseChainWhipGameplay.FortCheatManager_SunRoseChainWhip
// 0x0040 (0x0068 - 0x0028)
class UFortCheatManager_SunRoseChainWhip final : public UChildCheatManager
{
public:
	TSoftClassPtr<class UClass>                   HookShotGameplayEffectClass;                       // 0x0028(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   HookShooterAISpawnerData;                          // 0x0048(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SunRoseApplyHookShot(const float Delay);
	void SunRoseRemoveHookShotShooter();
	void SunRoseSpawnHookShotShooter();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_SunRoseChainWhip">();
	}
	static class UFortCheatManager_SunRoseChainWhip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_SunRoseChainWhip>();
	}
};
static_assert(alignof(UFortCheatManager_SunRoseChainWhip) == 0x000008, "Wrong alignment on UFortCheatManager_SunRoseChainWhip");
static_assert(sizeof(UFortCheatManager_SunRoseChainWhip) == 0x000068, "Wrong size on UFortCheatManager_SunRoseChainWhip");
static_assert(offsetof(UFortCheatManager_SunRoseChainWhip, HookShotGameplayEffectClass) == 0x000028, "Member 'UFortCheatManager_SunRoseChainWhip::HookShotGameplayEffectClass' has a wrong offset!");
static_assert(offsetof(UFortCheatManager_SunRoseChainWhip, HookShooterAISpawnerData) == 0x000048, "Member 'UFortCheatManager_SunRoseChainWhip::HookShooterAISpawnerData' has a wrong offset!");

// Class SunRoseChainWhipGameplay.TargetingSelectionTask_SunRoseChainWhip
// 0x0000 (0x0170 - 0x0170)
class UTargetingSelectionTask_SunRoseChainWhip : public UTargetingSelectionTask_Trace
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_SunRoseChainWhip">();
	}
	static class UTargetingSelectionTask_SunRoseChainWhip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_SunRoseChainWhip>();
	}
};
static_assert(alignof(UTargetingSelectionTask_SunRoseChainWhip) == 0x000008, "Wrong alignment on UTargetingSelectionTask_SunRoseChainWhip");
static_assert(sizeof(UTargetingSelectionTask_SunRoseChainWhip) == 0x000170, "Wrong size on UTargetingSelectionTask_SunRoseChainWhip");

// Class SunRoseChainWhipGameplay.TargetingSelectionTask_SunRoseChainWhip_Melee
// 0x0020 (0x0190 - 0x0170)
class UTargetingSelectionTask_SunRoseChainWhip_Melee final : public UTargetingSelectionTask_SunRoseChainWhip
{
public:
	float                                         YawOffsetDegrees;                                  // 0x0170(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SourceLocationRelativeOffset;                      // 0x0178(0x0018)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_SunRoseChainWhip_Melee">();
	}
	static class UTargetingSelectionTask_SunRoseChainWhip_Melee* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_SunRoseChainWhip_Melee>();
	}
};
static_assert(alignof(UTargetingSelectionTask_SunRoseChainWhip_Melee) == 0x000008, "Wrong alignment on UTargetingSelectionTask_SunRoseChainWhip_Melee");
static_assert(sizeof(UTargetingSelectionTask_SunRoseChainWhip_Melee) == 0x000190, "Wrong size on UTargetingSelectionTask_SunRoseChainWhip_Melee");
static_assert(offsetof(UTargetingSelectionTask_SunRoseChainWhip_Melee, YawOffsetDegrees) == 0x000170, "Member 'UTargetingSelectionTask_SunRoseChainWhip_Melee::YawOffsetDegrees' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_SunRoseChainWhip_Melee, SourceLocationRelativeOffset) == 0x000178, "Member 'UTargetingSelectionTask_SunRoseChainWhip_Melee::SourceLocationRelativeOffset' has a wrong offset!");

}

