#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunRoseFlyingRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SunRoseFlyingRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function SunRoseFlyingRuntime.AFortGameplayCueNotifyLoop_SunroseFlying.SetFlappingParameters
// 0x0040 (0x0040 - 0x0000)
struct AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters final
{
public:
	class UFXSystemComponent*                     FlyingTrailFX;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	const class AFortPlayerPawn*                  PlayerPawn;                                        // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlappingAlpha;                                     // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollCombined;                                      // 0x0024(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollingAlpha;                                      // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchAlpha;                                        // 0x002C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoosting;                                       // 0x0030(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAscending;                                      // 0x0031(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowWingFlap;                                    // 0x0032(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSkimming;                                       // 0x0033(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDiving;                                         // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentHeight;                                     // 0x003C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters) == 0x000008, "Wrong alignment on AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters");
static_assert(sizeof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters) == 0x000040, "Wrong size on AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, FlyingTrailFX) == 0x000000, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::FlyingTrailFX' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, AudioComponents) == 0x000008, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::AudioComponents' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, PlayerPawn) == 0x000018, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, FlappingAlpha) == 0x000020, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::FlappingAlpha' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, RollCombined) == 0x000024, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::RollCombined' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, RollingAlpha) == 0x000028, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::RollingAlpha' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, PitchAlpha) == 0x00002C, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::PitchAlpha' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, bIsBoosting) == 0x000030, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::bIsBoosting' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, bIsAscending) == 0x000031, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::bIsAscending' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, bAllowWingFlap) == 0x000032, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::bAllowWingFlap' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, bIsSkimming) == 0x000033, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::bIsSkimming' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, Speed) == 0x000034, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::Speed' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, bIsDiving) == 0x000038, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::bIsDiving' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters, CurrentHeight) == 0x00003C, "Member 'AFortGameplayCueNotifyLoop_SunroseFlying_SetFlappingParameters::CurrentHeight' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortGameplayCueNotifyLoop_WingsSkimming.ShowWingFX
// 0x0070 (0x0070 - 0x0000)
struct FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX final
{
public:
	struct FVector                                SkimLocationLeft;                                  // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SkimNormalLeft;                                    // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkimDistanceLeft;                                  // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SkimLocationRight;                                 // 0x0038(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SkimNormalRight;                                   // 0x0050(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkimDistanceRight;                                 // 0x0068(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX) == 0x000008, "Wrong alignment on FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX");
static_assert(sizeof(FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX) == 0x000070, "Wrong size on FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX");
static_assert(offsetof(FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX, SkimLocationLeft) == 0x000000, "Member 'FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX::SkimLocationLeft' has a wrong offset!");
static_assert(offsetof(FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX, SkimNormalLeft) == 0x000018, "Member 'FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX::SkimNormalLeft' has a wrong offset!");
static_assert(offsetof(FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX, SkimDistanceLeft) == 0x000030, "Member 'FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX::SkimDistanceLeft' has a wrong offset!");
static_assert(offsetof(FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX, SkimLocationRight) == 0x000038, "Member 'FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX::SkimLocationRight' has a wrong offset!");
static_assert(offsetof(FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX, SkimNormalRight) == 0x000050, "Member 'FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX::SkimNormalRight' has a wrong offset!");
static_assert(offsetof(FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX, SkimDistanceRight) == 0x000068, "Member 'FortGameplayCueNotifyLoop_WingsSkimming_ShowWingFX::SkimDistanceRight' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortCameraModifier_SunroseWingsFlying.UseNativeCalculation
// 0x0001 (0x0001 - 0x0000)
struct FortCameraModifier_SunroseWingsFlying_UseNativeCalculation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortCameraModifier_SunroseWingsFlying_UseNativeCalculation) == 0x000001, "Wrong alignment on FortCameraModifier_SunroseWingsFlying_UseNativeCalculation");
static_assert(sizeof(FortCameraModifier_SunroseWingsFlying_UseNativeCalculation) == 0x000001, "Wrong size on FortCameraModifier_SunroseWingsFlying_UseNativeCalculation");
static_assert(offsetof(FortCameraModifier_SunroseWingsFlying_UseNativeCalculation, ReturnValue) == 0x000000, "Member 'FortCameraModifier_SunroseWingsFlying_UseNativeCalculation::ReturnValue' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged.HandleFlyingStatusActivationFailed
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusActivationFailed final
{
public:
	EWingedFlyingStatus                           FailedStatus;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FailureTag;                                        // 0x0004(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusActivationFailed) == 0x000004, "Wrong alignment on FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusActivationFailed");
static_assert(sizeof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusActivationFailed) == 0x000008, "Wrong size on FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusActivationFailed");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusActivationFailed, FailedStatus) == 0x000000, "Member 'FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusActivationFailed::FailedStatus' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusActivationFailed, FailureTag) == 0x000004, "Member 'FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusActivationFailed::FailureTag' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged.HandleFlyingStatusChanged
// 0x00D8 (0x00D8 - 0x0000)
struct FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged final
{
public:
	struct FFortMovementMode_WingedFlyingRuntimeData MoveStatus;                                        // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EWingedFlyingStatus                           NewStatus;                                         // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x00D1(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FailureTag;                                        // 0x00D4(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged");
static_assert(sizeof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged) == 0x0000D8, "Wrong size on FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged, MoveStatus) == 0x000000, "Member 'FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged::MoveStatus' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged, NewStatus) == 0x0000D0, "Member 'FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged::NewStatus' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged, bIsActive) == 0x0000D1, "Member 'FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged::bIsActive' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged, FailureTag) == 0x0000D4, "Member 'FortMovementMode_ExtLogicFlyingWinged_HandleFlyingStatusChanged::FailureTag' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged.UpdateForHitResponse
// 0x0210 (0x0210 - 0x0000)
struct FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse final
{
public:
	struct FFortMovementMode_WingedFlyingRuntimeData MoveStatus;                                        // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x00D0(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InVelocity;                                        // 0x00D8(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldPosition;                                       // 0x00F0(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Adjustment;                                        // 0x0108(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0120(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EFortMovementModeExt_PhysUpdateResult         OutHitResult;                                      // 0x0208(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutWantToSlide;                                   // 0x0209(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse");
static_assert(sizeof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse) == 0x000210, "Wrong size on FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse, MoveStatus) == 0x000000, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse::MoveStatus' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse, DeltaTime) == 0x0000D0, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse::DeltaTime' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse, InVelocity) == 0x0000D8, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse::InVelocity' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse, OldPosition) == 0x0000F0, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse::OldPosition' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse, Adjustment) == 0x000108, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse::Adjustment' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse, Hit) == 0x000120, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse::Hit' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse, OutHitResult) == 0x000208, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse::OutHitResult' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse, bOutWantToSlide) == 0x000209, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForHitResponse::bOutWantToSlide' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged.UpdateForMovement
// 0x0208 (0x0208 - 0x0000)
struct FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement final
{
public:
	struct FFortMovementMode_WingedFlyingRuntimeData MoveStatus;                                        // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x00D0(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InVelocity;                                        // 0x00D8(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InAcceleration;                                    // 0x00F0(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutNewVelocity;                                    // 0x0108(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutNewAcceleration;                                // 0x0120(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMovementMode_WingedFlyingRuntimeData OutNewMoveStatus;                                  // 0x0138(0x00D0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement");
static_assert(sizeof(FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement) == 0x000208, "Wrong size on FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement, MoveStatus) == 0x000000, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement::MoveStatus' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement, DeltaTime) == 0x0000D0, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement::DeltaTime' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement, InVelocity) == 0x0000D8, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement::InVelocity' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement, InAcceleration) == 0x0000F0, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement::InAcceleration' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement, OutNewVelocity) == 0x000108, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement::OutNewVelocity' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement, OutNewAcceleration) == 0x000120, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement::OutNewAcceleration' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement, OutNewMoveStatus) == 0x000138, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForMovement::OutNewMoveStatus' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged.UpdateForRotation
// 0x00F0 (0x00F0 - 0x0000)
struct FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation final
{
public:
	struct FFortMovementMode_WingedFlyingRuntimeData MoveStatus;                                        // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x00D0(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OutNewMoveOrientation;                             // 0x00D8(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation");
static_assert(sizeof(FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation) == 0x0000F0, "Wrong size on FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation, MoveStatus) == 0x000000, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation::MoveStatus' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation, DeltaTime) == 0x0000D0, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation::DeltaTime' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation, OutNewMoveOrientation) == 0x0000D8, "Member 'FortMovementMode_ExtLogicFlyingWinged_UpdateForRotation::OutNewMoveOrientation' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged.CanContinueFlyingStatus
// 0x00E0 (0x00E0 - 0x0000)
struct FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus final
{
public:
	struct FFortMovementMode_WingedFlyingRuntimeData MoveStatus;                                        // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EWingedFlyingStatus                           StatusToContinue;                                  // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedDuration;                                   // 0x00D4(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutCanContinue;                                   // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           OutFailureTag;                                     // 0x00DC(0x0004)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus");
static_assert(sizeof(FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus) == 0x0000E0, "Wrong size on FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus, MoveStatus) == 0x000000, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus::MoveStatus' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus, StatusToContinue) == 0x0000D0, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus::StatusToContinue' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus, ElapsedDuration) == 0x0000D4, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus::ElapsedDuration' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus, bOutCanContinue) == 0x0000D8, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus::bOutCanContinue' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus, OutFailureTag) == 0x0000DC, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanContinueFlyingStatus::OutFailureTag' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged.CanEndFlyingStatus
// 0x00E0 (0x00E0 - 0x0000)
struct FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus final
{
public:
	struct FFortMovementMode_WingedFlyingRuntimeData MoveStatus;                                        // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EWingedFlyingStatus                           StatusToEnd;                                       // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedDuration;                                   // 0x00D4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00D8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus");
static_assert(sizeof(FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus) == 0x0000E0, "Wrong size on FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus, MoveStatus) == 0x000000, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus::MoveStatus' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus, StatusToEnd) == 0x0000D0, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus::StatusToEnd' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus, ElapsedDuration) == 0x0000D4, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus::ElapsedDuration' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus, ReturnValue) == 0x0000D8, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanEndFlyingStatus::ReturnValue' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged.CanStartFlyingStatus
// 0x00D8 (0x00D8 - 0x0000)
struct FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus final
{
public:
	struct FFortMovementMode_WingedFlyingRuntimeData MoveStatus;                                        // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EWingedFlyingStatus                           StatusToStart;                                     // 0x00D0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutCanStart;                                      // 0x00D1(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           OutFailureTag;                                     // 0x00D4(0x0004)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus) == 0x000008, "Wrong alignment on FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus");
static_assert(sizeof(FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus) == 0x0000D8, "Wrong size on FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus, MoveStatus) == 0x000000, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus::MoveStatus' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus, StatusToStart) == 0x0000D0, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus::StatusToStart' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus, bOutCanStart) == 0x0000D1, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus::bOutCanStart' has a wrong offset!");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus, OutFailureTag) == 0x0000D4, "Member 'FortMovementMode_ExtLogicFlyingWinged_CanStartFlyingStatus::OutFailureTag' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged.IsClientReplaying
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicFlyingWinged_IsClientReplaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortMovementMode_ExtLogicFlyingWinged_IsClientReplaying) == 0x000001, "Wrong alignment on FortMovementMode_ExtLogicFlyingWinged_IsClientReplaying");
static_assert(sizeof(FortMovementMode_ExtLogicFlyingWinged_IsClientReplaying) == 0x000001, "Wrong size on FortMovementMode_ExtLogicFlyingWinged_IsClientReplaying");
static_assert(offsetof(FortMovementMode_ExtLogicFlyingWinged_IsClientReplaying, ReturnValue) == 0x000000, "Member 'FortMovementMode_ExtLogicFlyingWinged_IsClientReplaying::ReturnValue' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.HandleAddedDownZVelocityUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPawnComponent_WingedFlying_HandleAddedDownZVelocityUpdated final
{
public:
	float                                         NewAddedDownZVelocity;                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_HandleAddedDownZVelocityUpdated) == 0x000004, "Wrong alignment on FortPawnComponent_WingedFlying_HandleAddedDownZVelocityUpdated");
static_assert(sizeof(FortPawnComponent_WingedFlying_HandleAddedDownZVelocityUpdated) == 0x000004, "Wrong size on FortPawnComponent_WingedFlying_HandleAddedDownZVelocityUpdated");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleAddedDownZVelocityUpdated, NewAddedDownZVelocity) == 0x000000, "Member 'FortPawnComponent_WingedFlying_HandleAddedDownZVelocityUpdated::NewAddedDownZVelocity' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.HandleCurrentHeightUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPawnComponent_WingedFlying_HandleCurrentHeightUpdated final
{
public:
	float                                         NewCurrentHeight;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_HandleCurrentHeightUpdated) == 0x000004, "Wrong alignment on FortPawnComponent_WingedFlying_HandleCurrentHeightUpdated");
static_assert(sizeof(FortPawnComponent_WingedFlying_HandleCurrentHeightUpdated) == 0x000004, "Wrong size on FortPawnComponent_WingedFlying_HandleCurrentHeightUpdated");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleCurrentHeightUpdated, NewCurrentHeight) == 0x000000, "Member 'FortPawnComponent_WingedFlying_HandleCurrentHeightUpdated::NewCurrentHeight' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.HandleFlyingMoveStatusUpdated
// 0x00D0 (0x00D0 - 0x0000)
struct FortPawnComponent_WingedFlying_HandleFlyingMoveStatusUpdated final
{
public:
	struct FFortMovementMode_WingedFlyingRuntimeData MoveStatus;                                        // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_HandleFlyingMoveStatusUpdated) == 0x000008, "Wrong alignment on FortPawnComponent_WingedFlying_HandleFlyingMoveStatusUpdated");
static_assert(sizeof(FortPawnComponent_WingedFlying_HandleFlyingMoveStatusUpdated) == 0x0000D0, "Wrong size on FortPawnComponent_WingedFlying_HandleFlyingMoveStatusUpdated");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleFlyingMoveStatusUpdated, MoveStatus) == 0x000000, "Member 'FortPawnComponent_WingedFlying_HandleFlyingMoveStatusUpdated::MoveStatus' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.HandleForwardSpeedUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortPawnComponent_WingedFlying_HandleForwardSpeedUpdated final
{
public:
	float                                         NewForwardSpeed;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_HandleForwardSpeedUpdated) == 0x000004, "Wrong alignment on FortPawnComponent_WingedFlying_HandleForwardSpeedUpdated");
static_assert(sizeof(FortPawnComponent_WingedFlying_HandleForwardSpeedUpdated) == 0x000004, "Wrong size on FortPawnComponent_WingedFlying_HandleForwardSpeedUpdated");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleForwardSpeedUpdated, NewForwardSpeed) == 0x000000, "Member 'FortPawnComponent_WingedFlying_HandleForwardSpeedUpdated::NewForwardSpeed' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.HandleHeightCheckTagChange
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_WingedFlying_HandleHeightCheckTagChange final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_HandleHeightCheckTagChange) == 0x000004, "Wrong alignment on FortPawnComponent_WingedFlying_HandleHeightCheckTagChange");
static_assert(sizeof(FortPawnComponent_WingedFlying_HandleHeightCheckTagChange) == 0x000008, "Wrong size on FortPawnComponent_WingedFlying_HandleHeightCheckTagChange");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleHeightCheckTagChange, Tag) == 0x000000, "Member 'FortPawnComponent_WingedFlying_HandleHeightCheckTagChange::Tag' has a wrong offset!");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleHeightCheckTagChange, NewCount) == 0x000004, "Member 'FortPawnComponent_WingedFlying_HandleHeightCheckTagChange::NewCount' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.HandleLeftSkimCheckComplete
// 0x00E8 (0x00E8 - 0x0000)
struct FortPawnComponent_WingedFlying_HandleLeftSkimCheckComplete final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_HandleLeftSkimCheckComplete) == 0x000008, "Wrong alignment on FortPawnComponent_WingedFlying_HandleLeftSkimCheckComplete");
static_assert(sizeof(FortPawnComponent_WingedFlying_HandleLeftSkimCheckComplete) == 0x0000E8, "Wrong size on FortPawnComponent_WingedFlying_HandleLeftSkimCheckComplete");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleLeftSkimCheckComplete, HitResult) == 0x000000, "Member 'FortPawnComponent_WingedFlying_HandleLeftSkimCheckComplete::HitResult' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.HandleOwnerASCInitialized
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_WingedFlying_HandleOwnerASCInitialized final
{
public:
	class UFortAbilitySystemComponent*            AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                        AffectedPawn;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_HandleOwnerASCInitialized) == 0x000008, "Wrong alignment on FortPawnComponent_WingedFlying_HandleOwnerASCInitialized");
static_assert(sizeof(FortPawnComponent_WingedFlying_HandleOwnerASCInitialized) == 0x000010, "Wrong size on FortPawnComponent_WingedFlying_HandleOwnerASCInitialized");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleOwnerASCInitialized, AbilitySystemComponent) == 0x000000, "Member 'FortPawnComponent_WingedFlying_HandleOwnerASCInitialized::AbilitySystemComponent' has a wrong offset!");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleOwnerASCInitialized, AffectedPawn) == 0x000008, "Member 'FortPawnComponent_WingedFlying_HandleOwnerASCInitialized::AffectedPawn' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.HandleRightSkimCheckComplete
// 0x00E8 (0x00E8 - 0x0000)
struct FortPawnComponent_WingedFlying_HandleRightSkimCheckComplete final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_HandleRightSkimCheckComplete) == 0x000008, "Wrong alignment on FortPawnComponent_WingedFlying_HandleRightSkimCheckComplete");
static_assert(sizeof(FortPawnComponent_WingedFlying_HandleRightSkimCheckComplete) == 0x0000E8, "Wrong size on FortPawnComponent_WingedFlying_HandleRightSkimCheckComplete");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleRightSkimCheckComplete, HitResult) == 0x000000, "Member 'FortPawnComponent_WingedFlying_HandleRightSkimCheckComplete::HitResult' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.HandleSkimmingTagsChange
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_WingedFlying_HandleSkimmingTagsChange final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_HandleSkimmingTagsChange) == 0x000004, "Wrong alignment on FortPawnComponent_WingedFlying_HandleSkimmingTagsChange");
static_assert(sizeof(FortPawnComponent_WingedFlying_HandleSkimmingTagsChange) == 0x000008, "Wrong size on FortPawnComponent_WingedFlying_HandleSkimmingTagsChange");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleSkimmingTagsChange, Tag) == 0x000000, "Member 'FortPawnComponent_WingedFlying_HandleSkimmingTagsChange::Tag' has a wrong offset!");
static_assert(offsetof(FortPawnComponent_WingedFlying_HandleSkimmingTagsChange, NewCount) == 0x000004, "Member 'FortPawnComponent_WingedFlying_HandleSkimmingTagsChange::NewCount' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortPawnComponent_WingedFlying.StartFlying
// 0x0030 (0x0030 - 0x0000)
struct FortPawnComponent_WingedFlying_StartFlying final
{
public:
	struct FFortMovementMode_WingedFlyingCreationData CreationData;                                      // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortPawnComponent_WingedFlying_StartFlying) == 0x000008, "Wrong alignment on FortPawnComponent_WingedFlying_StartFlying");
static_assert(sizeof(FortPawnComponent_WingedFlying_StartFlying) == 0x000030, "Wrong size on FortPawnComponent_WingedFlying_StartFlying");
static_assert(offsetof(FortPawnComponent_WingedFlying_StartFlying, CreationData) == 0x000000, "Member 'FortPawnComponent_WingedFlying_StartFlying::CreationData' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortWeaponWings.BP_ModifyIncomingDamage
// 0x0128 (0x0128 - 0x0000)
struct FortWeaponWings_BP_ModifyIncomingDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FHitResult                             DamageHit;                                         // 0x0028(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	const class AController*                      EventInstigator;                                   // 0x0110(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           DamageCauser;                                      // 0x0118(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutNewDamage;                                      // 0x0120(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortWeaponWings_BP_ModifyIncomingDamage) == 0x000008, "Wrong alignment on FortWeaponWings_BP_ModifyIncomingDamage");
static_assert(sizeof(FortWeaponWings_BP_ModifyIncomingDamage) == 0x000128, "Wrong size on FortWeaponWings_BP_ModifyIncomingDamage");
static_assert(offsetof(FortWeaponWings_BP_ModifyIncomingDamage, Damage) == 0x000000, "Member 'FortWeaponWings_BP_ModifyIncomingDamage::Damage' has a wrong offset!");
static_assert(offsetof(FortWeaponWings_BP_ModifyIncomingDamage, DamageTags) == 0x000008, "Member 'FortWeaponWings_BP_ModifyIncomingDamage::DamageTags' has a wrong offset!");
static_assert(offsetof(FortWeaponWings_BP_ModifyIncomingDamage, DamageHit) == 0x000028, "Member 'FortWeaponWings_BP_ModifyIncomingDamage::DamageHit' has a wrong offset!");
static_assert(offsetof(FortWeaponWings_BP_ModifyIncomingDamage, EventInstigator) == 0x000110, "Member 'FortWeaponWings_BP_ModifyIncomingDamage::EventInstigator' has a wrong offset!");
static_assert(offsetof(FortWeaponWings_BP_ModifyIncomingDamage, DamageCauser) == 0x000118, "Member 'FortWeaponWings_BP_ModifyIncomingDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(FortWeaponWings_BP_ModifyIncomingDamage, OutNewDamage) == 0x000120, "Member 'FortWeaponWings_BP_ModifyIncomingDamage::OutNewDamage' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortWeaponWings.HandleSecondaryFirePressed
// 0x0008 (0x0008 - 0x0000)
struct FortWeaponWings_HandleSecondaryFirePressed final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortWeaponWings_HandleSecondaryFirePressed) == 0x000008, "Wrong alignment on FortWeaponWings_HandleSecondaryFirePressed");
static_assert(sizeof(FortWeaponWings_HandleSecondaryFirePressed) == 0x000008, "Wrong size on FortWeaponWings_HandleSecondaryFirePressed");
static_assert(offsetof(FortWeaponWings_HandleSecondaryFirePressed, Weapon) == 0x000000, "Member 'FortWeaponWings_HandleSecondaryFirePressed::Weapon' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortWeaponWings.HandleWeaponAttachmentChanged
// 0x0010 (0x0010 - 0x0000)
struct FortWeaponWings_HandleWeaponAttachmentChanged final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortWeaponWings_HandleWeaponAttachmentChanged) == 0x000008, "Wrong alignment on FortWeaponWings_HandleWeaponAttachmentChanged");
static_assert(sizeof(FortWeaponWings_HandleWeaponAttachmentChanged) == 0x000010, "Wrong size on FortWeaponWings_HandleWeaponAttachmentChanged");
static_assert(offsetof(FortWeaponWings_HandleWeaponAttachmentChanged, NewWeapon) == 0x000000, "Member 'FortWeaponWings_HandleWeaponAttachmentChanged::NewWeapon' has a wrong offset!");
static_assert(offsetof(FortWeaponWings_HandleWeaponAttachmentChanged, PrevWeapon) == 0x000008, "Member 'FortWeaponWings_HandleWeaponAttachmentChanged::PrevWeapon' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortWeaponWings.TryResetADSInput
// 0x0008 (0x0008 - 0x0000)
struct FortWeaponWings_TryResetADSInput final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortWeaponWings_TryResetADSInput) == 0x000008, "Wrong alignment on FortWeaponWings_TryResetADSInput");
static_assert(sizeof(FortWeaponWings_TryResetADSInput) == 0x000008, "Wrong size on FortWeaponWings_TryResetADSInput");
static_assert(offsetof(FortWeaponWings_TryResetADSInput, Weapon) == 0x000000, "Member 'FortWeaponWings_TryResetADSInput::Weapon' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortWingedFlyingBlueprintLibrary.ClearInputActionDisplayContext
// 0x0010 (0x0010 - 0x0000)
struct FortWingedFlyingBlueprintLibrary_ClearInputActionDisplayContext final
{
public:
	class AFortPawn*                              PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortInputMappingContext*         InputMappingContext;                               // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortWingedFlyingBlueprintLibrary_ClearInputActionDisplayContext) == 0x000008, "Wrong alignment on FortWingedFlyingBlueprintLibrary_ClearInputActionDisplayContext");
static_assert(sizeof(FortWingedFlyingBlueprintLibrary_ClearInputActionDisplayContext) == 0x000010, "Wrong size on FortWingedFlyingBlueprintLibrary_ClearInputActionDisplayContext");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_ClearInputActionDisplayContext, PlayerPawn) == 0x000000, "Member 'FortWingedFlyingBlueprintLibrary_ClearInputActionDisplayContext::PlayerPawn' has a wrong offset!");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_ClearInputActionDisplayContext, InputMappingContext) == 0x000008, "Member 'FortWingedFlyingBlueprintLibrary_ClearInputActionDisplayContext::InputMappingContext' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortWingedFlyingBlueprintLibrary.FlyingStatusAddFlags
// 0x000C (0x000C - 0x0000)
struct FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags final
{
public:
	EWingedFlyingStatus                           Status;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FlagsToAdd;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWingedFlyingStatus                           NewStatus;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags) == 0x000004, "Wrong alignment on FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags");
static_assert(sizeof(FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags) == 0x00000C, "Wrong size on FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags, Status) == 0x000000, "Member 'FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags::Status' has a wrong offset!");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags, FlagsToAdd) == 0x000004, "Member 'FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags::FlagsToAdd' has a wrong offset!");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags, NewStatus) == 0x000008, "Member 'FortWingedFlyingBlueprintLibrary_FlyingStatusAddFlags::NewStatus' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortWingedFlyingBlueprintLibrary.FlyingStatusHasAllFlags
// 0x000C (0x000C - 0x0000)
struct FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags final
{
public:
	EWingedFlyingStatus                           Status;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Flags_0;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags) == 0x000004, "Wrong alignment on FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags");
static_assert(sizeof(FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags) == 0x00000C, "Wrong size on FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags, Status) == 0x000000, "Member 'FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags::Status' has a wrong offset!");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags, Flags_0) == 0x000004, "Member 'FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags::Flags_0' has a wrong offset!");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags, ReturnValue) == 0x000008, "Member 'FortWingedFlyingBlueprintLibrary_FlyingStatusHasAllFlags::ReturnValue' has a wrong offset!");

// Function SunRoseFlyingRuntime.FortWingedFlyingBlueprintLibrary.FlyingStatusHasAnyFlags
// 0x000C (0x000C - 0x0000)
struct FortWingedFlyingBlueprintLibrary_FlyingStatusHasAnyFlags final
{
public:
	EWingedFlyingStatus                           Status;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Flags_0;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortWingedFlyingBlueprintLibrary_FlyingStatusHasAnyFlags) == 0x000004, "Wrong alignment on FortWingedFlyingBlueprintLibrary_FlyingStatusHasAnyFlags");
static_assert(sizeof(FortWingedFlyingBlueprintLibrary_FlyingStatusHasAnyFlags) == 0x00000C, "Wrong size on FortWingedFlyingBlueprintLibrary_FlyingStatusHasAnyFlags");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_FlyingStatusHasAnyFlags, Status) == 0x000000, "Member 'FortWingedFlyingBlueprintLibrary_FlyingStatusHasAnyFlags::Status' has a wrong offset!");
static_assert(offsetof(FortWingedFlyingBlueprintLibrary_FlyingStatusHasAnyFlags, Flags_0) == 0x000004, "Member 'FortWingedFlyingBlueprintLibrary_FlyingStatusHasAnyFlags::Flags_0' has a wrong offset!");
