#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunRoseFlyingRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SunRoseFlyingRuntime_structs.hpp"
#include "FlyingCodeRuntime_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SunRoseFlyingRuntime.AFortGameplayCueNotifyLoop_SunroseFlying
// 0x0040 (0x09F0 - 0x09B0)
class AAFortGameplayCueNotifyLoop_SunroseFlying final : public AFortGameplayCueNotify_Loop
{
public:
	class FName                                   IsAscendingParamName;                              // 0x09B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IsFlappingParamName;                               // 0x09B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FlappingAlphaParamName;                            // 0x09B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IsRollingParamName;                                // 0x09BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IsBoostingParamName;                               // 0x09C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IsDivingParamName;                                 // 0x09C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PitchParamName;                                    // 0x09C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   RollParamName;                                     // 0x09CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   SpeedParamName;                                    // 0x09D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IsSkimmingParamName;                               // 0x09D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   AltitudeInterpParamName;                           // 0x09D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFloatRange                            HeightRange;                                       // 0x09DC(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9EC[0x4];                                      // 0x09EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetFlappingParameters(class UFXSystemComponent* FlyingTrailFX, const TArray<class UAudioComponent*>& AudioComponents, const class AFortPlayerPawn* PlayerPawn, const float FlappingAlpha, const float RollCombined, const float RollingAlpha, const float PitchAlpha, const bool bIsBoosting, const bool bIsAscending, const bool bAllowWingFlap, const bool bIsSkimming, const float Speed, const bool bIsDiving, const float CurrentHeight);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AFortGameplayCueNotifyLoop_SunroseFlying">();
	}
	static class AAFortGameplayCueNotifyLoop_SunroseFlying* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAFortGameplayCueNotifyLoop_SunroseFlying>();
	}
};
static_assert(alignof(AAFortGameplayCueNotifyLoop_SunroseFlying) == 0x000008, "Wrong alignment on AAFortGameplayCueNotifyLoop_SunroseFlying");
static_assert(sizeof(AAFortGameplayCueNotifyLoop_SunroseFlying) == 0x0009F0, "Wrong size on AAFortGameplayCueNotifyLoop_SunroseFlying");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, IsAscendingParamName) == 0x0009B0, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::IsAscendingParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, IsFlappingParamName) == 0x0009B4, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::IsFlappingParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, FlappingAlphaParamName) == 0x0009B8, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::FlappingAlphaParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, IsRollingParamName) == 0x0009BC, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::IsRollingParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, IsBoostingParamName) == 0x0009C0, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::IsBoostingParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, IsDivingParamName) == 0x0009C4, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::IsDivingParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, PitchParamName) == 0x0009C8, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::PitchParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, RollParamName) == 0x0009CC, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::RollParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, SpeedParamName) == 0x0009D0, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::SpeedParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, IsSkimmingParamName) == 0x0009D4, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::IsSkimmingParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, AltitudeInterpParamName) == 0x0009D8, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::AltitudeInterpParamName' has a wrong offset!");
static_assert(offsetof(AAFortGameplayCueNotifyLoop_SunroseFlying, HeightRange) == 0x0009DC, "Member 'AAFortGameplayCueNotifyLoop_SunroseFlying::HeightRange' has a wrong offset!");

// Class SunRoseFlyingRuntime.FortGameplayCueNotifyLoop_WingsSkimming
// 0x0028 (0x09D8 - 0x09B0)
class AFortGameplayCueNotifyLoop_WingsSkimming final : public AFortGameplayCueNotify_Loop
{
public:
	TWeakObjectPtr<class USkeletalMeshComponent>  WingsSkeletalMesh;                                 // 0x09B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFXSystemComponent>      SkimFX;                                            // 0x09B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UAudioComponent>         SkimAudioComponent;                                // 0x09C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class USoundBase>              SkimLoopSound;                                     // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9D0[0x8];                                      // 0x09D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ShowWingFX(const struct FVector& SkimLocationLeft, const struct FVector& SkimNormalLeft, float SkimDistanceLeft, const struct FVector& SkimLocationRight, const struct FVector& SkimNormalRight, float SkimDistanceRight);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayCueNotifyLoop_WingsSkimming">();
	}
	static class AFortGameplayCueNotifyLoop_WingsSkimming* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGameplayCueNotifyLoop_WingsSkimming>();
	}
};
static_assert(alignof(AFortGameplayCueNotifyLoop_WingsSkimming) == 0x000008, "Wrong alignment on AFortGameplayCueNotifyLoop_WingsSkimming");
static_assert(sizeof(AFortGameplayCueNotifyLoop_WingsSkimming) == 0x0009D8, "Wrong size on AFortGameplayCueNotifyLoop_WingsSkimming");
static_assert(offsetof(AFortGameplayCueNotifyLoop_WingsSkimming, WingsSkeletalMesh) == 0x0009B0, "Member 'AFortGameplayCueNotifyLoop_WingsSkimming::WingsSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_WingsSkimming, SkimFX) == 0x0009B8, "Member 'AFortGameplayCueNotifyLoop_WingsSkimming::SkimFX' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_WingsSkimming, SkimAudioComponent) == 0x0009C0, "Member 'AFortGameplayCueNotifyLoop_WingsSkimming::SkimAudioComponent' has a wrong offset!");
static_assert(offsetof(AFortGameplayCueNotifyLoop_WingsSkimming, SkimLoopSound) == 0x0009C8, "Member 'AFortGameplayCueNotifyLoop_WingsSkimming::SkimLoopSound' has a wrong offset!");

// Class SunRoseFlyingRuntime.FortCameraModifier_SunroseWingsFlying
// 0x02E0 (0x0370 - 0x0090)
class alignas(0x10) UFortCameraModifier_SunroseWingsFlying final : public UFortCameraModifier_Custom
{
public:
	TSubclassOf<class UActorComponent>            NativeFlyingPawnClass;                             // 0x0090(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NativeFlyingSpeedBase;                             // 0x00A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NativeFlyingSpeedAddedAtMaxDistanceFromCeilingHeight; // 0x00D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NativeFlyingDownZSpeedAddedWhileFalling;           // 0x0108(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NativeFlyingHeightDecayMin;                        // 0x0138(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NativePreCrashWindupDuration;                      // 0x0168(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NativeFlyingInputWeightHorizontal;                 // 0x0198(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C0[0x8];                                      // 0x01C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NativeFlyingInputWeightLookDirection;              // 0x01C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F0[0x4];                                      // 0x01F0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NativeDeltaFOVForwardOffsetExponent;               // 0x01F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFOVModeSwapInterpRate;                       // 0x01F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeMaxFOVOffset;                                // 0x01FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeRotationRateForMaxRightOffset;               // 0x0200(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeRightOffsetMaxCombinedStrafeTurn;            // 0x0204(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeRightOffsetStrafe;                           // 0x0208(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeRightOffsetTurn;                             // 0x020C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeRightOffsetDodge;                            // 0x0210(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardOffsetDistanceCrashingFinal;          // 0x0214(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardOffsetDistanceForceCrashingPhase1;    // 0x0218(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardOffsetDistanceCrashingPhase1;         // 0x021C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardOffsetDistanceCrashingPhase2;         // 0x0220(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardOffsetCrashingTimeAfterWindupToEnterFinalPhase; // 0x0224(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardOffsetInterpSpeedCrashingPhase1;      // 0x0228(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardOffsetInterpSpeedCrashingPhase2;      // 0x022C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardOffsetInterpSpeedCrashingFinal;       // 0x0230(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           NativeTagForceCrash;                               // 0x0234(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFOVInterpSpeed;                              // 0x0238(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeMinFOVOffsetFast;                            // 0x023C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeMinFOVOffsetSlow;                            // 0x0240(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeMaxFOVOffsetSlow;                            // 0x0244(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeLateBoostStartTime;                          // 0x0248(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeTimeSinceLastBoostLateMin;                   // 0x024C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeTimeSinceLastBoostLateMax;                   // 0x0250(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFOVOffsetLateMin;                            // 0x0254(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFOVOffsetLateMax;                            // 0x0258(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeTimeSinceEarlyBoostLateMin;                  // 0x025C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeTimeSinceLastBoostEarlyMax;                  // 0x0260(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFOVOffsetEarlyMin;                           // 0x0264(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFOVOffsetEarlyMax;                           // 0x0268(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFOVOffsetModeMin;                            // 0x026C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeCrashingFOVInterpSpeed;                      // 0x0270(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFOVOffsetWindup;                             // 0x0274(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativePositiveFlyingMoveActionXFOVInterpSpeed;     // 0x0278(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeNegativeFlyingMoveActionXFOVInterpSpeed;     // 0x027C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFlyingMoveActionPositiveMin;                 // 0x0280(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFlyingMoveActionPositiveMax;                 // 0x0284(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFlyingMoveActionPositiveFOVMin;              // 0x0288(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFlyingMoveActionPositiveFOVMax;              // 0x028C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFlyingMoveActionNegativeMin;                 // 0x0290(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFlyingMoveActionNegativeMax;                 // 0x0294(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFlyingMoveActionNegativeFOVMin;              // 0x0298(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeFlyingMoveActionNegativeFOVMax;              // 0x029C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeDefaultFOVInterpSpeed;                       // 0x02A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativePositiveFOVMax;                              // 0x02A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeLocationOffsetForPositiveFOVMax;             // 0x02A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeNegativeFOVMax;                              // 0x02AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeLocationOffsetForNegativeFOVMax;             // 0x02B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeClampedDeltaFOVInterpSpeed;                  // 0x02B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeShortTimeSinceLastBoostStart;                // 0x02B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeLongTimeSinceLastBoostStart;                 // 0x02BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeLongOrShortBoostTimeInterpSpeed;             // 0x02C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeMediumBoostTimeInterpSpeed;                  // 0x02C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardLocationOffsetTargetMax;              // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeForwardLocationOffsetFromDownZVelocityInterpSpeed; // 0x02CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeDodgeStartDuration;                          // 0x02D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeStrafeFOVOffsetMin;                          // 0x02D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeStrafeFOVOffsetMax;                          // 0x02D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeStrafeFOVMultiplierMin;                      // 0x02DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeStrafeFOVMultiplierMax;                      // 0x02E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeViewLocationOffsetRightInterpSpeedCrashing;  // 0x02E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeDodgeStartDurationForInterpSpeed;            // 0x02E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeViewLocationOffsetRightInterpSpeedStartingDodge; // 0x02EC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeViewLocationOffsetRightInterpSpeedMostlyStrafing; // 0x02F0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NativeViewLocationOffsetRightInterpSpeedMostlyTurning; // 0x02F4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F8[0x78];                                     // 0x02F8(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool UseNativeCalculation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraModifier_SunroseWingsFlying">();
	}
	static class UFortCameraModifier_SunroseWingsFlying* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraModifier_SunroseWingsFlying>();
	}
};
static_assert(alignof(UFortCameraModifier_SunroseWingsFlying) == 0x000010, "Wrong alignment on UFortCameraModifier_SunroseWingsFlying");
static_assert(sizeof(UFortCameraModifier_SunroseWingsFlying) == 0x000370, "Wrong size on UFortCameraModifier_SunroseWingsFlying");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingPawnClass) == 0x000090, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingPawnClass' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingSpeedBase) == 0x0000A8, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingSpeedBase' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingSpeedAddedAtMaxDistanceFromCeilingHeight) == 0x0000D8, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingSpeedAddedAtMaxDistanceFromCeilingHeight' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingDownZSpeedAddedWhileFalling) == 0x000108, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingDownZSpeedAddedWhileFalling' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingHeightDecayMin) == 0x000138, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingHeightDecayMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativePreCrashWindupDuration) == 0x000168, "Member 'UFortCameraModifier_SunroseWingsFlying::NativePreCrashWindupDuration' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingInputWeightHorizontal) == 0x000198, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingInputWeightHorizontal' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingInputWeightLookDirection) == 0x0001C8, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingInputWeightLookDirection' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeDeltaFOVForwardOffsetExponent) == 0x0001F4, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeDeltaFOVForwardOffsetExponent' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFOVModeSwapInterpRate) == 0x0001F8, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFOVModeSwapInterpRate' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeMaxFOVOffset) == 0x0001FC, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeMaxFOVOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeRotationRateForMaxRightOffset) == 0x000200, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeRotationRateForMaxRightOffset' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeRightOffsetMaxCombinedStrafeTurn) == 0x000204, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeRightOffsetMaxCombinedStrafeTurn' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeRightOffsetStrafe) == 0x000208, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeRightOffsetStrafe' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeRightOffsetTurn) == 0x00020C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeRightOffsetTurn' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeRightOffsetDodge) == 0x000210, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeRightOffsetDodge' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardOffsetDistanceCrashingFinal) == 0x000214, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardOffsetDistanceCrashingFinal' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardOffsetDistanceForceCrashingPhase1) == 0x000218, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardOffsetDistanceForceCrashingPhase1' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardOffsetDistanceCrashingPhase1) == 0x00021C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardOffsetDistanceCrashingPhase1' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardOffsetDistanceCrashingPhase2) == 0x000220, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardOffsetDistanceCrashingPhase2' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardOffsetCrashingTimeAfterWindupToEnterFinalPhase) == 0x000224, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardOffsetCrashingTimeAfterWindupToEnterFinalPhase' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardOffsetInterpSpeedCrashingPhase1) == 0x000228, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardOffsetInterpSpeedCrashingPhase1' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardOffsetInterpSpeedCrashingPhase2) == 0x00022C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardOffsetInterpSpeedCrashingPhase2' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardOffsetInterpSpeedCrashingFinal) == 0x000230, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardOffsetInterpSpeedCrashingFinal' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeTagForceCrash) == 0x000234, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeTagForceCrash' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFOVInterpSpeed) == 0x000238, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFOVInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeMinFOVOffsetFast) == 0x00023C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeMinFOVOffsetFast' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeMinFOVOffsetSlow) == 0x000240, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeMinFOVOffsetSlow' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeMaxFOVOffsetSlow) == 0x000244, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeMaxFOVOffsetSlow' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeLateBoostStartTime) == 0x000248, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeLateBoostStartTime' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeTimeSinceLastBoostLateMin) == 0x00024C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeTimeSinceLastBoostLateMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeTimeSinceLastBoostLateMax) == 0x000250, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeTimeSinceLastBoostLateMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFOVOffsetLateMin) == 0x000254, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFOVOffsetLateMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFOVOffsetLateMax) == 0x000258, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFOVOffsetLateMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeTimeSinceEarlyBoostLateMin) == 0x00025C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeTimeSinceEarlyBoostLateMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeTimeSinceLastBoostEarlyMax) == 0x000260, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeTimeSinceLastBoostEarlyMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFOVOffsetEarlyMin) == 0x000264, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFOVOffsetEarlyMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFOVOffsetEarlyMax) == 0x000268, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFOVOffsetEarlyMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFOVOffsetModeMin) == 0x00026C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFOVOffsetModeMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeCrashingFOVInterpSpeed) == 0x000270, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeCrashingFOVInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFOVOffsetWindup) == 0x000274, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFOVOffsetWindup' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativePositiveFlyingMoveActionXFOVInterpSpeed) == 0x000278, "Member 'UFortCameraModifier_SunroseWingsFlying::NativePositiveFlyingMoveActionXFOVInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeNegativeFlyingMoveActionXFOVInterpSpeed) == 0x00027C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeNegativeFlyingMoveActionXFOVInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingMoveActionPositiveMin) == 0x000280, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingMoveActionPositiveMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingMoveActionPositiveMax) == 0x000284, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingMoveActionPositiveMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingMoveActionPositiveFOVMin) == 0x000288, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingMoveActionPositiveFOVMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingMoveActionPositiveFOVMax) == 0x00028C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingMoveActionPositiveFOVMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingMoveActionNegativeMin) == 0x000290, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingMoveActionNegativeMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingMoveActionNegativeMax) == 0x000294, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingMoveActionNegativeMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingMoveActionNegativeFOVMin) == 0x000298, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingMoveActionNegativeFOVMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeFlyingMoveActionNegativeFOVMax) == 0x00029C, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeFlyingMoveActionNegativeFOVMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeDefaultFOVInterpSpeed) == 0x0002A0, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeDefaultFOVInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativePositiveFOVMax) == 0x0002A4, "Member 'UFortCameraModifier_SunroseWingsFlying::NativePositiveFOVMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeLocationOffsetForPositiveFOVMax) == 0x0002A8, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeLocationOffsetForPositiveFOVMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeNegativeFOVMax) == 0x0002AC, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeNegativeFOVMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeLocationOffsetForNegativeFOVMax) == 0x0002B0, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeLocationOffsetForNegativeFOVMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeClampedDeltaFOVInterpSpeed) == 0x0002B4, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeClampedDeltaFOVInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeShortTimeSinceLastBoostStart) == 0x0002B8, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeShortTimeSinceLastBoostStart' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeLongTimeSinceLastBoostStart) == 0x0002BC, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeLongTimeSinceLastBoostStart' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeLongOrShortBoostTimeInterpSpeed) == 0x0002C0, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeLongOrShortBoostTimeInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeMediumBoostTimeInterpSpeed) == 0x0002C4, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeMediumBoostTimeInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardLocationOffsetTargetMax) == 0x0002C8, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardLocationOffsetTargetMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeForwardLocationOffsetFromDownZVelocityInterpSpeed) == 0x0002CC, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeForwardLocationOffsetFromDownZVelocityInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeDodgeStartDuration) == 0x0002D0, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeDodgeStartDuration' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeStrafeFOVOffsetMin) == 0x0002D4, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeStrafeFOVOffsetMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeStrafeFOVOffsetMax) == 0x0002D8, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeStrafeFOVOffsetMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeStrafeFOVMultiplierMin) == 0x0002DC, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeStrafeFOVMultiplierMin' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeStrafeFOVMultiplierMax) == 0x0002E0, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeStrafeFOVMultiplierMax' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeViewLocationOffsetRightInterpSpeedCrashing) == 0x0002E4, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeViewLocationOffsetRightInterpSpeedCrashing' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeDodgeStartDurationForInterpSpeed) == 0x0002E8, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeDodgeStartDurationForInterpSpeed' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeViewLocationOffsetRightInterpSpeedStartingDodge) == 0x0002EC, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeViewLocationOffsetRightInterpSpeedStartingDodge' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeViewLocationOffsetRightInterpSpeedMostlyStrafing) == 0x0002F0, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeViewLocationOffsetRightInterpSpeedMostlyStrafing' has a wrong offset!");
static_assert(offsetof(UFortCameraModifier_SunroseWingsFlying, NativeViewLocationOffsetRightInterpSpeedMostlyTurning) == 0x0002F4, "Member 'UFortCameraModifier_SunroseWingsFlying::NativeViewLocationOffsetRightInterpSpeedMostlyTurning' has a wrong offset!");

// Class SunRoseFlyingRuntime.FortContextualTutorialDefinition_WingedFlying
// 0x0028 (0x01D0 - 0x01A8)
class UFortContextualTutorialDefinition_WingedFlying final : public UUFortContextualTutorialDefinition_GameplayEvent
{
public:
	struct FScalableFloat                         MinTimeBeforeCompletion;                           // 0x01A8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContextualTutorialDefinition_WingedFlying">();
	}
	static class UFortContextualTutorialDefinition_WingedFlying* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorialDefinition_WingedFlying>();
	}
};
static_assert(alignof(UFortContextualTutorialDefinition_WingedFlying) == 0x000008, "Wrong alignment on UFortContextualTutorialDefinition_WingedFlying");
static_assert(sizeof(UFortContextualTutorialDefinition_WingedFlying) == 0x0001D0, "Wrong size on UFortContextualTutorialDefinition_WingedFlying");
static_assert(offsetof(UFortContextualTutorialDefinition_WingedFlying, MinTimeBeforeCompletion) == 0x0001A8, "Member 'UFortContextualTutorialDefinition_WingedFlying::MinTimeBeforeCompletion' has a wrong offset!");

// Class SunRoseFlyingRuntime.FortContextualTutorial_WingedFlying
// 0x0010 (0x0180 - 0x0170)
class UFortContextualTutorial_WingedFlying final : public UFortContextualTutorial_GameplayEvent
{
public:
	uint8                                         Pad_170[0x10];                                     // 0x0170(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortContextualTutorial_WingedFlying">();
	}
	static class UFortContextualTutorial_WingedFlying* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortContextualTutorial_WingedFlying>();
	}
};
static_assert(alignof(UFortContextualTutorial_WingedFlying) == 0x000008, "Wrong alignment on UFortContextualTutorial_WingedFlying");
static_assert(sizeof(UFortContextualTutorial_WingedFlying) == 0x000180, "Wrong size on UFortContextualTutorial_WingedFlying");

// Class SunRoseFlyingRuntime.FortMovementMode_ExtLogicFlyingWinged
// 0x1120 (0x1240 - 0x0120)
class UFortMovementMode_ExtLogicFlyingWinged final : public UFortMovementMode_ExtLogicFlying
{
public:
	uint8                                         Pad_120[0x10];                                     // 0x0120(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFlyingStatusConfig>            FlyingStatusConfigs;                               // 0x0130(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            FlyingThroughCeilingGE;                            // 0x0140(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           FlyingThroughCeilingTag;                           // 0x0148(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           EnergyDrainCueTag;                                 // 0x014C(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CrashEnabledCueTag;                                // 0x0150(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           HitBonkCueTag;                                     // 0x0154(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           EventTagToTriggerWhenMiniBoosting;                 // 0x0158(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           EventTagToTriggerCrashImpact;                      // 0x015C(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TagsToPreventLowFrictionLanding;                   // 0x0160(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            LowFrictionLandingGE;                              // 0x0180(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           TagToSetByCallerDuration;                          // 0x0188(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         BaseFlyingCost;                                    // 0x0190(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         FlyingStatusToStopBaseCost;                        // 0x01B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ExtraLeapCrashCost;                                // 0x01C0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HeightIncreasePer1Cost;                            // 0x01E8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DodgeSpeedMin;                                     // 0x0210(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DodgeSpeedMax;                                     // 0x0238(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DodgeSpeedDecayInitialDelay;                       // 0x0260(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DodgeSpeedRampExponent;                            // 0x0288(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DodgeSpeedDecayExponent;                           // 0x02B0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DodgeDuration;                                     // 0x02D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StartedFlyingTransitionDuration;                   // 0x0300(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StartedFlyingSpeedBoundForInterpMin;               // 0x0328(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StartedFlyingSpeedBoundForInterpMax;               // 0x0350(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StartedFlyingVelocityInterpSpeedAtMinSpeed;        // 0x0378(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StartedFlyingVelocityInterpSpeedAtMaxSpeed;        // 0x03A0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FlyingLookPitchClampMin;                           // 0x03C8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FlyingLookPitchClampMax;                           // 0x03F0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DefaultLookPitchAngleOffset;                       // 0x0418(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CrashingLookPitchClampMin;                         // 0x0440(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CrashingLookPitchClampMax;                         // 0x0468(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CrashingInputWeightLookDirection;                  // 0x0490(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FlyingInputWeightLockDirection;                    // 0x04B8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FlyingInputWeightHorizontal;                       // 0x04E0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PitchInterpSpeedWhileCrashing;                     // 0x0508(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PitchInterpSpeedAtBaseSpeed;                       // 0x0530(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PitchInterpSpeedAtMaxLateralSpeed;                 // 0x0558(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PitchInterpSpeedAtMaxTotalSpeed;                   // 0x0580(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         YawInterpSpeedWhileCrashing;                       // 0x05A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         YawInterpSpeedAtMinBrakeSpeed;                     // 0x05D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         YawInterpSpeedAtBaseSpeed;                         // 0x05F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         YawInterpSpeedAtMaxLateralSpeed;                   // 0x0620(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InputInterpSpeedHorizontal;                        // 0x0648(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CrashingMovementInterpSpeed;                       // 0x0670(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AscendingLookPitchClampMin;                        // 0x0698(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CeilingHeightIncreaseSpeedWhileAscendingMin;       // 0x06C0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CeilingHeightIncreaseSpeedWhileAscendingMax;       // 0x06E8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxCeilingHeightAddLimitFromAscend;                // 0x0710(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AscendingSpeedZUpAddedMin;                         // 0x0738(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AscendingSpeedZUpAddedMax;                         // 0x0760(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxCeilingHeightAddLimitFromBoost;                 // 0x0788(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CeilingHeightIncreaseSpeedWhileBoostingMin;        // 0x07B0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CeilingHeightIncreaseSpeedWhileBoostingMax;        // 0x07D8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PercentMaxLookPitchForMaxBoostCeilingHeightIncrease; // 0x0800(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
