#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SunRoseZeusGameplayRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class SunRoseZeusGameplayRuntime.SunRose_Zeus_Player_LayerAnimInstance
// 0x0010 (0x1630 - 0x1620)
class USunRose_Zeus_Player_LayerAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsThrowActive;                                    // 0x1620(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1621[0x3];                                     // 0x1621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           LightningAbilityActiveTag;                         // 0x1624(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1628[0x8];                                     // 0x1628(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SunRose_Zeus_Player_LayerAnimInstance">();
	}
	static class USunRose_Zeus_Player_LayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USunRose_Zeus_Player_LayerAnimInstance>();
	}
};
static_assert(alignof(USunRose_Zeus_Player_LayerAnimInstance) == 0x000010, "Wrong alignment on USunRose_Zeus_Player_LayerAnimInstance");
static_assert(sizeof(USunRose_Zeus_Player_LayerAnimInstance) == 0x001630, "Wrong size on USunRose_Zeus_Player_LayerAnimInstance");
static_assert(offsetof(USunRose_Zeus_Player_LayerAnimInstance, bIsThrowActive) == 0x001620, "Member 'USunRose_Zeus_Player_LayerAnimInstance::bIsThrowActive' has a wrong offset!");
static_assert(offsetof(USunRose_Zeus_Player_LayerAnimInstance, LightningAbilityActiveTag) == 0x001624, "Member 'USunRose_Zeus_Player_LayerAnimInstance::LightningAbilityActiveTag' has a wrong offset!");

// Class SunRoseZeusGameplayRuntime.SunRose_Zeus_Weapon_Hand_AnimInstance
// 0x0010 (0x0480 - 0x0470)
class USunRose_Zeus_Weapon_Hand_AnimInstance final : public UFortWeaponAnimInstance
{
public:
	bool                                          bIsThrow;                                          // 0x0468(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LightningThrowMontageName;                         // 0x0470(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SunRose_Zeus_Weapon_Hand_AnimInstance">();
	}
	static class USunRose_Zeus_Weapon_Hand_AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USunRose_Zeus_Weapon_Hand_AnimInstance>();
	}
};
static_assert(alignof(USunRose_Zeus_Weapon_Hand_AnimInstance) == 0x000010, "Wrong alignment on USunRose_Zeus_Weapon_Hand_AnimInstance");
static_assert(sizeof(USunRose_Zeus_Weapon_Hand_AnimInstance) == 0x000480, "Wrong size on USunRose_Zeus_Weapon_Hand_AnimInstance");
static_assert(offsetof(USunRose_Zeus_Weapon_Hand_AnimInstance, bIsThrow) == 0x000468, "Member 'USunRose_Zeus_Weapon_Hand_AnimInstance::bIsThrow' has a wrong offset!");
static_assert(offsetof(USunRose_Zeus_Weapon_Hand_AnimInstance, LightningThrowMontageName) == 0x000470, "Member 'USunRose_Zeus_Weapon_Hand_AnimInstance::LightningThrowMontageName' has a wrong offset!");

// Class SunRoseZeusGameplayRuntime.BuildingGameplayActorZeusThunderstorm
// 0x0070 (0x09F0 - 0x0980)
class alignas(0x10) ABuildingGameplayActorZeusThunderstorm final : public ABuildingGameplayActor
{
public:
	struct FScalableFloat                         Row_TelegraphDuration;                             // 0x0980(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         Row_LightningStrikeFXDelay;                        // 0x09A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_9D0[0x20];                                     // 0x09D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetStrikeTargetingLocation(const struct FTargetingRequestHandle& TargetingHandle);
	void K2_OnLightningStrike(const struct FVector& Location);
	void K2_OnLightningStrikeFX(const struct FVector& Location, const float BoltHeight);
	void K2_OnTelegraphEnd();
	void K2_OnTelegraphStart(const struct FVector& Location);
	void OnTelegraphEnd();
	void OnTelegraphStart(const struct FVector& Location);
	void SetStrikeTargetingLocation(const struct FTargetingRequestHandle& TargetingHandle, const struct FVector& Location);
	void StartLightningFX();
	void StartLightningStrike(const struct FVector& Location, const float BoltHeight);
	void StrikeLightning(const struct FVector& Location);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuildingGameplayActorZeusThunderstorm">();
	}
	static class ABuildingGameplayActorZeusThunderstorm* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuildingGameplayActorZeusThunderstorm>();
	}
};
static_assert(alignof(ABuildingGameplayActorZeusThunderstorm) == 0x000010, "Wrong alignment on ABuildingGameplayActorZeusThunderstorm");
static_assert(sizeof(ABuildingGameplayActorZeusThunderstorm) == 0x0009F0, "Wrong size on ABuildingGameplayActorZeusThunderstorm");
static_assert(offsetof(ABuildingGameplayActorZeusThunderstorm, Row_TelegraphDuration) == 0x000980, "Member 'ABuildingGameplayActorZeusThunderstorm::Row_TelegraphDuration' has a wrong offset!");
static_assert(offsetof(ABuildingGameplayActorZeusThunderstorm, Row_LightningStrikeFXDelay) == 0x0009A8, "Member 'ABuildingGameplayActorZeusThunderstorm::Row_LightningStrikeFXDelay' has a wrong offset!");

// Class SunRoseZeusGameplayRuntime.FortProjectileSunRoseLightning
// 0x0310 (0x0DB0 - 0x0AA0)
class AFortProjectileSunRoseLightning final : public AFortProjectileBase
{
public:
	TArray<TSubclassOf<class UGameplayEffect>>    ExplosionDamageGEs;                                // 0x0AA0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                         ExplosionGELevel;                                  // 0x0AB0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             ExplosionTraceChannel;                             // 0x0AB4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AB5[0x3];                                      // 0x0AB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MaxHitsPerFrame;                                   // 0x0AB8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_AE0[0x2C8];                                    // 0x0AE0(0x02C8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetingRequestHandle                ExplosionAsyncLOSTargetingHandle;                  // 0x0DA8(0x0004)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_DAC[0x4];                                      // 0x0DAC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DoExplosionAsyncLOS();
	void OnExplosionFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortProjectileSunRoseLightning">();
	}
	static class AFortProjectileSunRoseLightning* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortProjectileSunRoseLightning>();
	}
};
static_assert(alignof(AFortProjectileSunRoseLightning) == 0x000008, "Wrong alignment on AFortProjectileSunRoseLightning");
static_assert(sizeof(AFortProjectileSunRoseLightning) == 0x000DB0, "Wrong size on AFortProjectileSunRoseLightning");
static_assert(offsetof(AFortProjectileSunRoseLightning, ExplosionDamageGEs) == 0x000AA0, "Member 'AFortProjectileSunRoseLightning::ExplosionDamageGEs' has a wrong offset!");
static_assert(offsetof(AFortProjectileSunRoseLightning, ExplosionGELevel) == 0x000AB0, "Member 'AFortProjectileSunRoseLightning::ExplosionGELevel' has a wrong offset!");
static_assert(offsetof(AFortProjectileSunRoseLightning, ExplosionTraceChannel) == 0x000AB4, "Member 'AFortProjectileSunRoseLightning::ExplosionTraceChannel' has a wrong offset!");
static_assert(offsetof(AFortProjectileSunRoseLightning, MaxHitsPerFrame) == 0x000AB8, "Member 'AFortProjectileSunRoseLightning::MaxHitsPerFrame' has a wrong offset!");
static_assert(offsetof(AFortProjectileSunRoseLightning, ExplosionAsyncLOSTargetingHandle) == 0x000DA8, "Member 'AFortProjectileSunRoseLightning::ExplosionAsyncLOSTargetingHandle' has a wrong offset!");

}

