#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipMinusCustomMinusS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-Custom-S.Tooltip-Custom-S_C
// 0x0070 (0x0330 - 0x02C0)
class UTooltipMinusCustomMinusS_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 _hr_;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Body_HBox;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content_Slot;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Header_HBox;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconMinusHeader;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerMinusHeader;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerMinusIcon;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMinusHeader;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x0308(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class USlateBrushAsset*                       Icon_Brush;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUserWidget*                            ContentWidget;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_TooltipMinusCustomMinusS(int32 EntryPoint);
	class FText Get_Body_Text();
	class FText Get_Header_Text();
	struct FSlateBrush Get_Icon_Brush();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tooltip-Custom-S_C">();
	}
	static class UTooltipMinusCustomMinusS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipMinusCustomMinusS_C>();
	}
};
static_assert(alignof(UTooltipMinusCustomMinusS_C) == 0x000008, "Wrong alignment on UTooltipMinusCustomMinusS_C");
static_assert(sizeof(UTooltipMinusCustomMinusS_C) == 0x000330, "Wrong size on UTooltipMinusCustomMinusS_C");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, UberGraphFrame) == 0x0002C0, "Member 'UTooltipMinusCustomMinusS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, _hr_) == 0x0002C8, "Member 'UTooltipMinusCustomMinusS_C::_hr_' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, Body_HBox) == 0x0002D0, "Member 'UTooltipMinusCustomMinusS_C::Body_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, Content_Slot) == 0x0002D8, "Member 'UTooltipMinusCustomMinusS_C::Content_Slot' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, Header_HBox) == 0x0002E0, "Member 'UTooltipMinusCustomMinusS_C::Header_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, IconMinusHeader) == 0x0002E8, "Member 'UTooltipMinusCustomMinusS_C::IconMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, SpacerMinusHeader) == 0x0002F0, "Member 'UTooltipMinusCustomMinusS_C::SpacerMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, SpacerMinusIcon) == 0x0002F8, "Member 'UTooltipMinusCustomMinusS_C::SpacerMinusIcon' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, TextMinusHeader) == 0x000300, "Member 'UTooltipMinusCustomMinusS_C::TextMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, HeaderText) == 0x000308, "Member 'UTooltipMinusCustomMinusS_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, Icon_Brush) == 0x000320, "Member 'UTooltipMinusCustomMinusS_C::Icon_Brush' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCustomMinusS_C, ContentWidget) == 0x000328, "Member 'UTooltipMinusCustomMinusS_C::ContentWidget' has a wrong offset!");

}

