#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseGameplayTags_0

#include "Basic.hpp"


namespace SDK
{

// VerseEnum VerseGameplayTags.Tags_tag_search_sort_type
// NumValues: 0x0003
enum class ETags_tag_search_sort_type : uint8
{
	Unsorted                                 = 0,
	Sorted                                   = 1,
	Tags_tag_search_sort_MAX                 = 2,
};

// VerseStruct VerseGameplayTags.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseGameplayTags_0::FTuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseGameplayTags_0::FTuple_L_R) == 0x000001, "Wrong alignment on VerseGameplayTags_0::FTuple_L_R");
static_assert(sizeof(VerseGameplayTags_0::FTuple_L_R) == 0x000001, "Wrong size on VerseGameplayTags_0::FTuple_L_R");
static_assert(offsetof(VerseGameplayTags_0::FTuple_L_R, _StructPaddingDummy) == 0x000000, "Member 'VerseGameplayTags_0::FTuple_L_R::_StructPaddingDummy' has a wrong offset!");

// VerseStruct VerseGameplayTags.tuple_Ltag__container_Mtag__container_R
// 0x0010 (0x0010 - 0x0000)
struct FTuple_Ltag__container_Mtag__container_R final
{
public:
	class UTags_tag_container*                    __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTags_tag_container*                    __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(FTuple_Ltag__container_Mtag__container_R) == 0x000008, "Wrong alignment on FTuple_Ltag__container_Mtag__container_R");
static_assert(sizeof(FTuple_Ltag__container_Mtag__container_R) == 0x000010, "Wrong size on FTuple_Ltag__container_Mtag__container_R");
static_assert(offsetof(FTuple_Ltag__container_Mtag__container_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'FTuple_Ltag__container_Mtag__container_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(FTuple_Ltag__container_Mtag__container_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'FTuple_Ltag__container_Mtag__container_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

// VerseStruct VerseGameplayTags.tuple_Ltag_Mtag_R
// 0x0010 (0x0010 - 0x0000)
struct FTuple_Ltag_Mtag_R final
{
public:
	class UTags_tag*                              __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTags_tag*                              __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(FTuple_Ltag_Mtag_R) == 0x000008, "Wrong alignment on FTuple_Ltag_Mtag_R");
static_assert(sizeof(FTuple_Ltag_Mtag_R) == 0x000010, "Wrong size on FTuple_Ltag_Mtag_R");
static_assert(offsetof(FTuple_Ltag_Mtag_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'FTuple_Ltag_Mtag_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(FTuple_Ltag_Mtag_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'FTuple_Ltag_Mtag_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

}

