#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseInput

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseInput_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VerseInput.VerseInputActionBase
// 0x0010 (0x0038 - 0x0028)
class UVerseInputActionBase : public UObject
{
public:
	struct FGuid                                  Guid;                                              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseInputActionBase">();
	}
	static class UVerseInputActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInputActionBase>();
	}
};
static_assert(alignof(UVerseInputActionBase) == 0x000008, "Wrong alignment on UVerseInputActionBase");
static_assert(sizeof(UVerseInputActionBase) == 0x000038, "Wrong size on UVerseInputActionBase");
static_assert(offsetof(UVerseInputActionBase, Guid) == 0x000028, "Member 'UVerseInputActionBase::Guid' has a wrong offset!");

// Class VerseInput.VerseInputTriggerBase
// 0x0000 (0x0028 - 0x0028)
class UVerseInputTriggerBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseInputTriggerBase">();
	}
	static class UVerseInputTriggerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInputTriggerBase>();
	}
};
static_assert(alignof(UVerseInputTriggerBase) == 0x000008, "Wrong alignment on UVerseInputTriggerBase");
static_assert(sizeof(UVerseInputTriggerBase) == 0x000028, "Wrong size on UVerseInputTriggerBase");

// Class VerseInput.VerseInputModifierBase
// 0x0000 (0x0028 - 0x0028)
class UVerseInputModifierBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseInputModifierBase">();
	}
	static class UVerseInputModifierBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInputModifierBase>();
	}
};
static_assert(alignof(UVerseInputModifierBase) == 0x000008, "Wrong alignment on UVerseInputModifierBase");
static_assert(sizeof(UVerseInputModifierBase) == 0x000028, "Wrong size on UVerseInputModifierBase");

// Class VerseInput.VerseInputClientActionBase
// 0x0000 (0x0028 - 0x0028)
class UVerseInputClientActionBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseInputClientActionBase">();
	}
	static class UVerseInputClientActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInputClientActionBase>();
	}
};
static_assert(alignof(UVerseInputClientActionBase) == 0x000008, "Wrong alignment on UVerseInputClientActionBase");
static_assert(sizeof(UVerseInputClientActionBase) == 0x000028, "Wrong size on UVerseInputClientActionBase");

// Class VerseInput.VerseReplicatedInputDataComponent
// 0x0130 (0x01D0 - 0x00A0)
class UVerseReplicatedInputDataComponent : public UActorComponent
{
public:
	struct FVerseInputActionDataList              InputActions;                                      // 0x00A0(0x0120)(Net, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UEnhancedInputComponent*                InputComponent;                                    // 0x01C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputMappingContext*                   CurrentInputMappingContext;                        // 0x01C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnInputActionTriggered(const struct FInputActionInstance& ActionInstance);

	void ServerInputActionTriggered(const struct FGuid& Guid, const struct FVector& InputValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseReplicatedInputDataComponent">();
	}
	static class UVerseReplicatedInputDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseReplicatedInputDataComponent>();
	}
};
static_assert(alignof(UVerseReplicatedInputDataComponent) == 0x000008, "Wrong alignment on UVerseReplicatedInputDataComponent");
static_assert(sizeof(UVerseReplicatedInputDataComponent) == 0x0001D0, "Wrong size on UVerseReplicatedInputDataComponent");
static_assert(offsetof(UVerseReplicatedInputDataComponent, InputActions) == 0x0000A0, "Member 'UVerseReplicatedInputDataComponent::InputActions' has a wrong offset!");
static_assert(offsetof(UVerseReplicatedInputDataComponent, InputComponent) == 0x0001C0, "Member 'UVerseReplicatedInputDataComponent::InputComponent' has a wrong offset!");
static_assert(offsetof(UVerseReplicatedInputDataComponent, CurrentInputMappingContext) == 0x0001C8, "Member 'UVerseReplicatedInputDataComponent::CurrentInputMappingContext' has a wrong offset!");

}

