#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "Entity_0_classes.hpp"
#include "VerseQuery_classes.hpp"
#include "VerseGameplayTags_structs.hpp"


namespace SDK
{

// VerseClass VerseQuery.VerseQuery_query_shape
// 0x0000 (0x0028 - 0x0028)
class UVerseQuery_query_shape : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_query_shape">();
	}
	static class UVerseQuery_query_shape* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_query_shape>();
	}
};
static_assert(alignof(UVerseQuery_query_shape) == 0x000008, "Wrong alignment on UVerseQuery_query_shape");
static_assert(sizeof(UVerseQuery_query_shape) == 0x000028, "Wrong size on UVerseQuery_query_shape");

// VerseClass VerseQuery.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseQuery_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseQuery.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseQuery_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseQuery_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseQuery_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseQuery_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseQuery_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseQuery_0::U_SolarisSignatureFunctionOuter");

// VerseClass VerseQuery.VerseQuery_playspace_association_component
// 0x0008 (0x00C0 - 0x00B8)
class UVerseQuery_playspace_association_component final : public UEntity_component
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_playspace_association_component">();
	}
	static class UVerseQuery_playspace_association_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_playspace_association_component>();
	}
};
static_assert(alignof(UVerseQuery_playspace_association_component) == 0x000008, "Wrong alignment on UVerseQuery_playspace_association_component");
static_assert(sizeof(UVerseQuery_playspace_association_component) == 0x0000C0, "Wrong size on UVerseQuery_playspace_association_component");

// VerseClass VerseQuery.VerseQuery
// 0x0000 (0x0028 - 0x0028)
class UVerseQuery final : public UObject
{
public:
	static TArray<class UEntity_component*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindChildComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct FTuple_Lentity_Mtuple_L_R_Mcomponent_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindChildEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R(const struct FTuple_Lentity_Mtuple_L_R_Mentity_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindChildEntitiesIn_U_L_Nentity_M_Ntuple_L_R_M_Nquery__shape_R(const struct FTuple_Lentity_Mtuple_L_R_Mquery__shape_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindChildEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct FTuple_Lentity_Mtuple_L_R_Mcomponent_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindChildEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R(const struct FTuple_Lentity_Mtuple_L_R_Mtag_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_component*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindParentComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct FTuple_Lentity_Mtuple_L_R_Mcomponent_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindParentEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R(const struct FTuple_Lentity_Mtuple_L_R_Mentity_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindParentEntitiesIn_U_L_Nentity_M_Ntuple_L_R_M_Nquery__shape_R(const struct FTuple_Lentity_Mtuple_L_R_Mquery__shape_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindParentEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R(const struct FTuple_Lentity_Mtuple_L_R_Mcomponent_R& __verse_0xB2CDDD72_Argument);
	static TArray<class UEntity_entity*> _L_2fUnrealEngine_2ecom_2fVerseQuery_N_Roperator_U_2eFindParentEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R(const struct FTuple_Lentity_Mtuple_L_R_Mtag_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery">();
	}
	static class UVerseQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery>();
	}
};
static_assert(alignof(UVerseQuery) == 0x000008, "Wrong alignment on UVerseQuery");
static_assert(sizeof(UVerseQuery) == 0x000028, "Wrong size on UVerseQuery");

// VerseClass VerseQuery.VerseQuery_query_iterator
// 0x0000 (0x0028 - 0x0028)
class UVerseQuery_query_iterator final : public UObject
{
public:
	uint8 _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntity_entity*, true> _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_query_iterator">();
	}
	static class UVerseQuery_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_query_iterator>();
	}
};
static_assert(alignof(UVerseQuery_query_iterator) == 0x000008, "Wrong alignment on UVerseQuery_query_iterator");
static_assert(sizeof(UVerseQuery_query_iterator) == 0x000028, "Wrong size on UVerseQuery_query_iterator");

// VerseClass VerseQuery.VerseQuery_core_entity_query_iterator
// 0x0050 (0x0090 - 0x0040)
class UVerseQuery_core_entity_query_iterator final : public UQueryIteratorBase
{
public:
	FVerseFunctionProperty_                       __verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid; // 0x0040(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext; // 0x0050(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_60[0x30];                                      // 0x0060(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntity_entity*, true> _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_core_entity_query_iterator">();
	}
	static class UVerseQuery_core_entity_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_core_entity_query_iterator>();
	}
};
static_assert(alignof(UVerseQuery_core_entity_query_iterator) == 0x000008, "Wrong alignment on UVerseQuery_core_entity_query_iterator");
static_assert(sizeof(UVerseQuery_core_entity_query_iterator) == 0x000090, "Wrong size on UVerseQuery_core_entity_query_iterator");
static_assert(offsetof(UVerseQuery_core_entity_query_iterator, __verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000040, "Member 'UVerseQuery_core_entity_query_iterator::__verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid' has a wrong offset!");
static_assert(offsetof(UVerseQuery_core_entity_query_iterator, __verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000050, "Member 'UVerseQuery_core_entity_query_iterator::__verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext' has a wrong offset!");

// VerseClass VerseQuery.VerseQuery_null_query_iterator
// 0x0020 (0x0048 - 0x0028)
class UVerseQuery_null_query_iterator final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntity_entity*, true> _L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_null_query_iterator">();
	}
	static class UVerseQuery_null_query_iterator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_null_query_iterator>();
	}
};
static_assert(alignof(UVerseQuery_null_query_iterator) == 0x000008, "Wrong alignment on UVerseQuery_null_query_iterator");
static_assert(sizeof(UVerseQuery_null_query_iterator) == 0x000048, "Wrong size on UVerseQuery_null_query_iterator");
static_assert(offsetof(UVerseQuery_null_query_iterator, __verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid) == 0x000028, "Member 'UVerseQuery_null_query_iterator::__verse_0x11B17D9D__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RIsValid' has a wrong offset!");
static_assert(offsetof(UVerseQuery_null_query_iterator, __verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext) == 0x000038, "Member 'UVerseQuery_null_query_iterator::__verse_0x64D590FC__L_2fUnrealEngine_2ecom_2fVerseQuery_2fquery__iterator_N_RNext' has a wrong offset!");

// VerseClass VerseQuery.VerseQuery_query_shape_box
// 0x0030 (0x0058 - 0x0028)
class UVerseQuery_query_shape_box final : public UVerseQuery_query_shape
{
public:
	struct FSpatialMath_vector3                   __verse_0x962BA9CF_Origin;                         // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xA327BDA5_Extent;                         // 0x0040(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_query_shape_box">();
	}
	static class UVerseQuery_query_shape_box* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_query_shape_box>();
	}
};
static_assert(alignof(UVerseQuery_query_shape_box) == 0x000008, "Wrong alignment on UVerseQuery_query_shape_box");
static_assert(sizeof(UVerseQuery_query_shape_box) == 0x000058, "Wrong size on UVerseQuery_query_shape_box");
static_assert(offsetof(UVerseQuery_query_shape_box, __verse_0x962BA9CF_Origin) == 0x000028, "Member 'UVerseQuery_query_shape_box::__verse_0x962BA9CF_Origin' has a wrong offset!");
static_assert(offsetof(UVerseQuery_query_shape_box, __verse_0xA327BDA5_Extent) == 0x000040, "Member 'UVerseQuery_query_shape_box::__verse_0xA327BDA5_Extent' has a wrong offset!");

// VerseClass VerseQuery.VerseQuery_tag_component_base
// 0x0058 (0x0110 - 0x00B8)
class UVerseQuery_tag_component_base : public UEntity_component
{
public:
	FVerseFunctionProperty_                       __verse_0xFD27AEAA__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RGetTags; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9F05F658__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RSetTags_L_Ntag__container_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAA18C711__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RAddTag_L_Ntag_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x06A4A96D__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RRemoveTag_L_Ntag_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UTags_tag_container*                    __verse_0x5C685848_InternalTags;                   // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVerseGameplayTagContainer             __verse_0x322F2385_TagSelector;                    // 0x0100(0x0010)(Edit, InstancedReference, SaveGame)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RAddTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	class UTags_tag_container* _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RGetTags(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RRemoveTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RSetTags_L_Ntag__container_R(class UTags_tag_container* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_tag_component_base">();
	}
	static class UVerseQuery_tag_component_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_tag_component_base>();
	}
};
static_assert(alignof(UVerseQuery_tag_component_base) == 0x000008, "Wrong alignment on UVerseQuery_tag_component_base");
static_assert(sizeof(UVerseQuery_tag_component_base) == 0x000110, "Wrong size on UVerseQuery_tag_component_base");
static_assert(offsetof(UVerseQuery_tag_component_base, __verse_0xFD27AEAA__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RGetTags) == 0x0000B8, "Member 'UVerseQuery_tag_component_base::__verse_0xFD27AEAA__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RGetTags' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_component_base, __verse_0x9F05F658__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RSetTags_L_Ntag__container_R) == 0x0000C8, "Member 'UVerseQuery_tag_component_base::__verse_0x9F05F658__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RSetTags_L_Ntag__container_R' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_component_base, __verse_0xAA18C711__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RAddTag_L_Ntag_R) == 0x0000D8, "Member 'UVerseQuery_tag_component_base::__verse_0xAA18C711__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RAddTag_L_Ntag_R' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_component_base, __verse_0x06A4A96D__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RRemoveTag_L_Ntag_R) == 0x0000E8, "Member 'UVerseQuery_tag_component_base::__verse_0x06A4A96D__L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RRemoveTag_L_Ntag_R' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_component_base, __verse_0x5C685848_InternalTags) == 0x0000F8, "Member 'UVerseQuery_tag_component_base::__verse_0x5C685848_InternalTags' has a wrong offset!");
static_assert(offsetof(UVerseQuery_tag_component_base, __verse_0x322F2385_TagSelector) == 0x000100, "Member 'UVerseQuery_tag_component_base::__verse_0x322F2385_TagSelector' has a wrong offset!");

// VerseClass VerseQuery.VerseQuery_tag_component
// 0x0000 (0x0110 - 0x0110)
class UVerseQuery_tag_component final : public UVerseQuery_tag_component_base
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RAddedToWorld(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityFramework_2fEntity_2fcomponent_N_RRemovingFromWorld(const struct VerseQuery_0::FTuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RAddTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RRemoveTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVerseQuery_2ftag__component__base_N_RSetTags_L_Ntag__container_R(class UTags_tag_container* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQuery_tag_component">();
	}
	static class UVerseQuery_tag_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQuery_tag_component>();
	}
};
static_assert(alignof(UVerseQuery_tag_component) == 0x000008, "Wrong alignment on UVerseQuery_tag_component");
static_assert(sizeof(UVerseQuery_tag_component) == 0x000110, "Wrong size on UVerseQuery_tag_component");

}

