#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseBasicGameplay

#include "Basic.hpp"

#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseStruct VerseBasicGameplay.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseBasicGameplay::FTuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseBasicGameplay::FTuple_L_R) == 0x000001, "Wrong alignment on VerseBasicGameplay::FTuple_L_R");
static_assert(sizeof(VerseBasicGameplay::FTuple_L_R) == 0x000001, "Wrong size on VerseBasicGameplay::FTuple_L_R");
static_assert(offsetof(VerseBasicGameplay::FTuple_L_R, _StructPaddingDummy) == 0x000000, "Member 'VerseBasicGameplay::FTuple_L_R::_StructPaddingDummy' has a wrong offset!");

// VerseStruct VerseBasicGameplay.tuple_Lvector3_M_Kchar_R
// 0x0028 (0x0028 - 0x0000)
struct VerseBasicGameplay::FTuple_Lvector3_M_Kchar_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0010)(InstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(VerseBasicGameplay::FTuple_Lvector3_M_Kchar_R) == 0x000008, "Wrong alignment on VerseBasicGameplay::FTuple_Lvector3_M_Kchar_R");
static_assert(sizeof(VerseBasicGameplay::FTuple_Lvector3_M_Kchar_R) == 0x000028, "Wrong size on VerseBasicGameplay::FTuple_Lvector3_M_Kchar_R");
static_assert(offsetof(VerseBasicGameplay::FTuple_Lvector3_M_Kchar_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'VerseBasicGameplay::FTuple_Lvector3_M_Kchar_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(VerseBasicGameplay::FTuple_Lvector3_M_Kchar_R, __verse_0x7D844C3C_Elem1) == 0x000018, "Member 'VerseBasicGameplay::FTuple_Lvector3_M_Kchar_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");

}

