#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseInput

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "StructUtils_structs.hpp"
#include "NetCore_structs.hpp"


namespace SDK
{

// ScriptStruct VerseInput.VerseInputActionData
// 0x0064 (0x0070 - 0x000C)
struct FVerseInputActionData final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           InputAction;                                       // 0x0010(0x0008)(ZeroConstructor, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           InputKeys;                                         // 0x0018(0x0010)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               Triggers;                                          // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               Modifiers;                                         // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               Actions;                                           // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   VerbName;                                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumeInput;                                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputActionData) == 0x000008, "Wrong alignment on FVerseInputActionData");
static_assert(sizeof(FVerseInputActionData) == 0x000070, "Wrong size on FVerseInputActionData");
static_assert(offsetof(FVerseInputActionData, InputAction) == 0x000010, "Member 'FVerseInputActionData::InputAction' has a wrong offset!");
static_assert(offsetof(FVerseInputActionData, InputKeys) == 0x000018, "Member 'FVerseInputActionData::InputKeys' has a wrong offset!");
static_assert(offsetof(FVerseInputActionData, Guid) == 0x000028, "Member 'FVerseInputActionData::Guid' has a wrong offset!");
static_assert(offsetof(FVerseInputActionData, Triggers) == 0x000038, "Member 'FVerseInputActionData::Triggers' has a wrong offset!");
static_assert(offsetof(FVerseInputActionData, Modifiers) == 0x000048, "Member 'FVerseInputActionData::Modifiers' has a wrong offset!");
static_assert(offsetof(FVerseInputActionData, Actions) == 0x000058, "Member 'FVerseInputActionData::Actions' has a wrong offset!");
static_assert(offsetof(FVerseInputActionData, VerbName) == 0x000068, "Member 'FVerseInputActionData::VerbName' has a wrong offset!");
static_assert(offsetof(FVerseInputActionData, bConsumeInput) == 0x00006C, "Member 'FVerseInputActionData::bConsumeInput' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputActionDataList
// 0x0018 (0x0120 - 0x0108)
struct FVerseInputActionDataList final : public FFastArraySerializer
{
public:
	TArray<struct FVerseInputActionData>          InputActions;                                      // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UVerseReplicatedInputDataComponent*     OwnerComponent;                                    // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FVerseInputActionDataList) == 0x000008, "Wrong alignment on FVerseInputActionDataList");
static_assert(sizeof(FVerseInputActionDataList) == 0x000120, "Wrong size on FVerseInputActionDataList");
static_assert(offsetof(FVerseInputActionDataList, InputActions) == 0x000108, "Member 'FVerseInputActionDataList::InputActions' has a wrong offset!");
static_assert(offsetof(FVerseInputActionDataList, OwnerComponent) == 0x000118, "Member 'FVerseInputActionDataList::OwnerComponent' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputClientActionBaseData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FVerseInputClientActionBaseData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputClientActionBaseData) == 0x000008, "Wrong alignment on FVerseInputClientActionBaseData");
static_assert(sizeof(FVerseInputClientActionBaseData) == 0x000008, "Wrong size on FVerseInputClientActionBaseData");

// ScriptStruct VerseInput.VerseInputClientActionData_ApplyImpulse
// 0x0018 (0x0020 - 0x0008)
struct FVerseInputClientActionData_ApplyImpulse final : public FVerseInputClientActionBaseData
{
public:
	struct FVector                                Impulse;                                           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseInputClientActionData_ApplyImpulse) == 0x000008, "Wrong alignment on FVerseInputClientActionData_ApplyImpulse");
static_assert(sizeof(FVerseInputClientActionData_ApplyImpulse) == 0x000020, "Wrong size on FVerseInputClientActionData_ApplyImpulse");
static_assert(offsetof(FVerseInputClientActionData_ApplyImpulse, Impulse) == 0x000008, "Member 'FVerseInputClientActionData_ApplyImpulse::Impulse' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputClientActionData_Launch
// 0x0018 (0x0020 - 0x0008)
struct FVerseInputClientActionData_Launch final : public FVerseInputClientActionBaseData
{
public:
	struct FVector                                Velocity;                                          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseInputClientActionData_Launch) == 0x000008, "Wrong alignment on FVerseInputClientActionData_Launch");
static_assert(sizeof(FVerseInputClientActionData_Launch) == 0x000020, "Wrong size on FVerseInputClientActionData_Launch");
static_assert(offsetof(FVerseInputClientActionData_Launch, Velocity) == 0x000008, "Member 'FVerseInputClientActionData_Launch::Velocity' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputClientActionData_PlayAnimation
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputClientActionData_PlayAnimation final : public FVerseInputClientActionBaseData
{
public:
	class FName                                   AssetPath;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputClientActionData_PlayAnimation) == 0x000008, "Wrong alignment on FVerseInputClientActionData_PlayAnimation");
static_assert(sizeof(FVerseInputClientActionData_PlayAnimation) == 0x000010, "Wrong size on FVerseInputClientActionData_PlayAnimation");
static_assert(offsetof(FVerseInputClientActionData_PlayAnimation, AssetPath) == 0x000008, "Member 'FVerseInputClientActionData_PlayAnimation::AssetPath' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputClientActionData_PlaySound
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputClientActionData_PlaySound final : public FVerseInputClientActionBaseData
{
public:
	class FName                                   AssetPath;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputClientActionData_PlaySound) == 0x000008, "Wrong alignment on FVerseInputClientActionData_PlaySound");
static_assert(sizeof(FVerseInputClientActionData_PlaySound) == 0x000010, "Wrong size on FVerseInputClientActionData_PlaySound");
static_assert(offsetof(FVerseInputClientActionData_PlaySound, AssetPath) == 0x000008, "Member 'FVerseInputClientActionData_PlaySound::AssetPath' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputClientActionData_SpawnParticleEffect
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputClientActionData_SpawnParticleEffect final : public FVerseInputClientActionBaseData
{
public:
	class FName                                   AssetPath;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputClientActionData_SpawnParticleEffect) == 0x000008, "Wrong alignment on FVerseInputClientActionData_SpawnParticleEffect");
static_assert(sizeof(FVerseInputClientActionData_SpawnParticleEffect) == 0x000010, "Wrong size on FVerseInputClientActionData_SpawnParticleEffect");
static_assert(offsetof(FVerseInputClientActionData_SpawnParticleEffect, AssetPath) == 0x000008, "Member 'FVerseInputClientActionData_SpawnParticleEffect::AssetPath' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputModifierBaseData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FVerseInputModifierBaseData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputModifierBaseData) == 0x000008, "Wrong alignment on FVerseInputModifierBaseData");
static_assert(sizeof(FVerseInputModifierBaseData) == 0x000008, "Wrong size on FVerseInputModifierBaseData");

// ScriptStruct VerseInput.VerseInputModifierData_DeadZone
// 0x0010 (0x0018 - 0x0008)
struct FVerseInputModifierData_DeadZone final : public FVerseInputModifierBaseData
{
public:
	float                                         LowerThreshold;                                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpperThreshold;                                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDeadZoneType                                 Type;                                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputModifierData_DeadZone) == 0x000008, "Wrong alignment on FVerseInputModifierData_DeadZone");
static_assert(sizeof(FVerseInputModifierData_DeadZone) == 0x000018, "Wrong size on FVerseInputModifierData_DeadZone");
static_assert(offsetof(FVerseInputModifierData_DeadZone, LowerThreshold) == 0x000008, "Member 'FVerseInputModifierData_DeadZone::LowerThreshold' has a wrong offset!");
static_assert(offsetof(FVerseInputModifierData_DeadZone, UpperThreshold) == 0x00000C, "Member 'FVerseInputModifierData_DeadZone::UpperThreshold' has a wrong offset!");
static_assert(offsetof(FVerseInputModifierData_DeadZone, Type) == 0x000010, "Member 'FVerseInputModifierData_DeadZone::Type' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputModifierData_Negate
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputModifierData_Negate final : public FVerseInputModifierBaseData
{
public:
	bool                                          bX;                                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bY;                                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bZ;                                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputModifierData_Negate) == 0x000008, "Wrong alignment on FVerseInputModifierData_Negate");
static_assert(sizeof(FVerseInputModifierData_Negate) == 0x000010, "Wrong size on FVerseInputModifierData_Negate");
static_assert(offsetof(FVerseInputModifierData_Negate, bX) == 0x000008, "Member 'FVerseInputModifierData_Negate::bX' has a wrong offset!");
static_assert(offsetof(FVerseInputModifierData_Negate, bY) == 0x000009, "Member 'FVerseInputModifierData_Negate::bY' has a wrong offset!");
static_assert(offsetof(FVerseInputModifierData_Negate, bZ) == 0x00000A, "Member 'FVerseInputModifierData_Negate::bZ' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputModifierData_Scalar
// 0x0018 (0x0020 - 0x0008)
struct FVerseInputModifierData_Scalar final : public FVerseInputModifierBaseData
{
public:
	struct FVector                                Scalar;                                            // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseInputModifierData_Scalar) == 0x000008, "Wrong alignment on FVerseInputModifierData_Scalar");
static_assert(sizeof(FVerseInputModifierData_Scalar) == 0x000020, "Wrong size on FVerseInputModifierData_Scalar");
static_assert(offsetof(FVerseInputModifierData_Scalar, Scalar) == 0x000008, "Member 'FVerseInputModifierData_Scalar::Scalar' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputModifierData_Smooth
// 0x0000 (0x0008 - 0x0008)
struct FVerseInputModifierData_Smooth final : public FVerseInputModifierBaseData
{
};
static_assert(alignof(FVerseInputModifierData_Smooth) == 0x000008, "Wrong alignment on FVerseInputModifierData_Smooth");
static_assert(sizeof(FVerseInputModifierData_Smooth) == 0x000008, "Wrong size on FVerseInputModifierData_Smooth");

// ScriptStruct VerseInput.VerseInputModifierData_ResponseCurveExponential
// 0x0018 (0x0020 - 0x0008)
struct FVerseInputModifierData_ResponseCurveExponential final : public FVerseInputModifierBaseData
{
public:
	struct FVector                                CurveExponent;                                     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVerseInputModifierData_ResponseCurveExponential) == 0x000008, "Wrong alignment on FVerseInputModifierData_ResponseCurveExponential");
static_assert(sizeof(FVerseInputModifierData_ResponseCurveExponential) == 0x000020, "Wrong size on FVerseInputModifierData_ResponseCurveExponential");
static_assert(offsetof(FVerseInputModifierData_ResponseCurveExponential, CurveExponent) == 0x000008, "Member 'FVerseInputModifierData_ResponseCurveExponential::CurveExponent' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputModifierData_Swizzle
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputModifierData_Swizzle final : public FVerseInputModifierBaseData
{
public:
	EInputAxisSwizzle                             Order;                                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputModifierData_Swizzle) == 0x000008, "Wrong alignment on FVerseInputModifierData_Swizzle");
static_assert(sizeof(FVerseInputModifierData_Swizzle) == 0x000010, "Wrong size on FVerseInputModifierData_Swizzle");
static_assert(offsetof(FVerseInputModifierData_Swizzle, Order) == 0x000008, "Member 'FVerseInputModifierData_Swizzle::Order' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputTriggerBaseData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FVerseInputTriggerBaseData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActuationThreshold;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputTriggerBaseData) == 0x000008, "Wrong alignment on FVerseInputTriggerBaseData");
static_assert(sizeof(FVerseInputTriggerBaseData) == 0x000010, "Wrong size on FVerseInputTriggerBaseData");
static_assert(offsetof(FVerseInputTriggerBaseData, ActuationThreshold) == 0x000008, "Member 'FVerseInputTriggerBaseData::ActuationThreshold' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputTriggerData_Down
// 0x0000 (0x0010 - 0x0010)
struct FVerseInputTriggerData_Down final : public FVerseInputTriggerBaseData
{
};
static_assert(alignof(FVerseInputTriggerData_Down) == 0x000008, "Wrong alignment on FVerseInputTriggerData_Down");
static_assert(sizeof(FVerseInputTriggerData_Down) == 0x000010, "Wrong size on FVerseInputTriggerData_Down");

// ScriptStruct VerseInput.VerseInputTriggerData_Pressed
// 0x0000 (0x0010 - 0x0010)
struct FVerseInputTriggerData_Pressed final : public FVerseInputTriggerBaseData
{
};
static_assert(alignof(FVerseInputTriggerData_Pressed) == 0x000008, "Wrong alignment on FVerseInputTriggerData_Pressed");
static_assert(sizeof(FVerseInputTriggerData_Pressed) == 0x000010, "Wrong size on FVerseInputTriggerData_Pressed");

// ScriptStruct VerseInput.VerseInputTriggerData_Released
// 0x0000 (0x0010 - 0x0010)
struct FVerseInputTriggerData_Released final : public FVerseInputTriggerBaseData
{
};
static_assert(alignof(FVerseInputTriggerData_Released) == 0x000008, "Wrong alignment on FVerseInputTriggerData_Released");
static_assert(sizeof(FVerseInputTriggerData_Released) == 0x000010, "Wrong size on FVerseInputTriggerData_Released");

// ScriptStruct VerseInput.VerseInputTriggerData_Hold
// 0x0008 (0x0018 - 0x0010)
struct FVerseInputTriggerData_Hold final : public FVerseInputTriggerBaseData
{
public:
	float                                         HoldTimeThreshold;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOneShot;                                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AffectedByTimeDilation;                            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputTriggerData_Hold) == 0x000008, "Wrong alignment on FVerseInputTriggerData_Hold");
static_assert(sizeof(FVerseInputTriggerData_Hold) == 0x000018, "Wrong size on FVerseInputTriggerData_Hold");
static_assert(offsetof(FVerseInputTriggerData_Hold, HoldTimeThreshold) == 0x000010, "Member 'FVerseInputTriggerData_Hold::HoldTimeThreshold' has a wrong offset!");
static_assert(offsetof(FVerseInputTriggerData_Hold, IsOneShot) == 0x000014, "Member 'FVerseInputTriggerData_Hold::IsOneShot' has a wrong offset!");
static_assert(offsetof(FVerseInputTriggerData_Hold, AffectedByTimeDilation) == 0x000015, "Member 'FVerseInputTriggerData_Hold::AffectedByTimeDilation' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputTriggerData_HoldAndRelease
// 0x0008 (0x0018 - 0x0010)
struct FVerseInputTriggerData_HoldAndRelease final : public FVerseInputTriggerBaseData
{
public:
	float                                         HoldTimeThreshold;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AffectedByTimeDilation;                            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputTriggerData_HoldAndRelease) == 0x000008, "Wrong alignment on FVerseInputTriggerData_HoldAndRelease");
static_assert(sizeof(FVerseInputTriggerData_HoldAndRelease) == 0x000018, "Wrong size on FVerseInputTriggerData_HoldAndRelease");
static_assert(offsetof(FVerseInputTriggerData_HoldAndRelease, HoldTimeThreshold) == 0x000010, "Member 'FVerseInputTriggerData_HoldAndRelease::HoldTimeThreshold' has a wrong offset!");
static_assert(offsetof(FVerseInputTriggerData_HoldAndRelease, AffectedByTimeDilation) == 0x000014, "Member 'FVerseInputTriggerData_HoldAndRelease::AffectedByTimeDilation' has a wrong offset!");

// ScriptStruct VerseInput.VerseInputTriggerData_Tap
// 0x0008 (0x0018 - 0x0010)
struct FVerseInputTriggerData_Tap final : public FVerseInputTriggerBaseData
{
public:
	float                                         TapReleaseTimeThreshold;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AffectedByTimeDilation;                            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVerseInputTriggerData_Tap) == 0x000008, "Wrong alignment on FVerseInputTriggerData_Tap");
static_assert(sizeof(FVerseInputTriggerData_Tap) == 0x000018, "Wrong size on FVerseInputTriggerData_Tap");
static_assert(offsetof(FVerseInputTriggerData_Tap, TapReleaseTimeThreshold) == 0x000010, "Member 'FVerseInputTriggerData_Tap::TapReleaseTimeThreshold' has a wrong offset!");
static_assert(offsetof(FVerseInputTriggerData_Tap, AffectedByTimeDilation) == 0x000014, "Member 'FVerseInputTriggerData_Tap::AffectedByTimeDilation' has a wrong offset!");

}

