#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery_0

#include "Basic.hpp"


namespace SDK
{

// VerseStruct VerseQuery.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseQuery_0::FTuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VerseQuery_0::FTuple_L_R) == 0x000001, "Wrong alignment on VerseQuery_0::FTuple_L_R");
static_assert(sizeof(VerseQuery_0::FTuple_L_R) == 0x000001, "Wrong size on VerseQuery_0::FTuple_L_R");
static_assert(offsetof(VerseQuery_0::FTuple_L_R, _StructPaddingDummy) == 0x000000, "Member 'VerseQuery_0::FTuple_L_R::_StructPaddingDummy' has a wrong offset!");

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mcomponent_R
// 0x0018 (0x0018 - 0x0000)
struct FTuple_Lentity_Mtuple_L_R_Mcomponent_R final
{
public:
	class UEntity_entity*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery_0::FTuple_L_R               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(FTuple_Lentity_Mtuple_L_R_Mcomponent_R) == 0x000008, "Wrong alignment on FTuple_Lentity_Mtuple_L_R_Mcomponent_R");
static_assert(sizeof(FTuple_Lentity_Mtuple_L_R_Mcomponent_R) == 0x000018, "Wrong size on FTuple_Lentity_Mtuple_L_R_Mcomponent_R");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mcomponent_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'FTuple_Lentity_Mtuple_L_R_Mcomponent_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mcomponent_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'FTuple_Lentity_Mtuple_L_R_Mcomponent_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mcomponent_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'FTuple_Lentity_Mtuple_L_R_Mcomponent_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mentity_R
// 0x0018 (0x0018 - 0x0000)
struct FTuple_Lentity_Mtuple_L_R_Mentity_R final
{
public:
	class UEntity_entity*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery_0::FTuple_L_R               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(FTuple_Lentity_Mtuple_L_R_Mentity_R) == 0x000008, "Wrong alignment on FTuple_Lentity_Mtuple_L_R_Mentity_R");
static_assert(sizeof(FTuple_Lentity_Mtuple_L_R_Mentity_R) == 0x000018, "Wrong size on FTuple_Lentity_Mtuple_L_R_Mentity_R");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mentity_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'FTuple_Lentity_Mtuple_L_R_Mentity_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mentity_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'FTuple_Lentity_Mtuple_L_R_Mentity_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mentity_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'FTuple_Lentity_Mtuple_L_R_Mentity_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mquery__shape_R
// 0x0018 (0x0018 - 0x0000)
struct FTuple_Lentity_Mtuple_L_R_Mquery__shape_R final
{
public:
	class UEntity_entity*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery_0::FTuple_L_R               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseQuery_query_shape*                __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(FTuple_Lentity_Mtuple_L_R_Mquery__shape_R) == 0x000008, "Wrong alignment on FTuple_Lentity_Mtuple_L_R_Mquery__shape_R");
static_assert(sizeof(FTuple_Lentity_Mtuple_L_R_Mquery__shape_R) == 0x000018, "Wrong size on FTuple_Lentity_Mtuple_L_R_Mquery__shape_R");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mquery__shape_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'FTuple_Lentity_Mtuple_L_R_Mquery__shape_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mquery__shape_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'FTuple_Lentity_Mtuple_L_R_Mquery__shape_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mquery__shape_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'FTuple_Lentity_Mtuple_L_R_Mquery__shape_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mtag_R
// 0x0018 (0x0018 - 0x0000)
struct FTuple_Lentity_Mtuple_L_R_Mtag_R final
{
public:
	class UEntity_entity*                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery_0::FTuple_L_R               __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTags_tag*                              __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};
static_assert(alignof(FTuple_Lentity_Mtuple_L_R_Mtag_R) == 0x000008, "Wrong alignment on FTuple_Lentity_Mtuple_L_R_Mtag_R");
static_assert(sizeof(FTuple_Lentity_Mtuple_L_R_Mtag_R) == 0x000018, "Wrong size on FTuple_Lentity_Mtuple_L_R_Mtag_R");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mtag_R, __verse_0x18E3F084_Elem0) == 0x000000, "Member 'FTuple_Lentity_Mtuple_L_R_Mtag_R::__verse_0x18E3F084_Elem0' has a wrong offset!");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mtag_R, __verse_0x7D844C3C_Elem1) == 0x000008, "Member 'FTuple_Lentity_Mtuple_L_R_Mtag_R::__verse_0x7D844C3C_Elem1' has a wrong offset!");
static_assert(offsetof(FTuple_Lentity_Mtuple_L_R_Mtag_R, __verse_0x932BF92E_Elem2) == 0x000010, "Member 'FTuple_Lentity_Mtuple_L_R_Mtag_R::__verse_0x932BF92E_Elem2' has a wrong offset!");

}

