#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQueryTestSuite

#include "Basic.hpp"

#include "Entity_0_classes.hpp"
#include "VerseGameplayTags_0_classes.hpp"


namespace SDK
{

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_tag_animal
// 0x0000 (0x0028 - 0x0028)
class UVerseQueryTestSuite_verse_query_tag_animal : public UTags_tag
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_tag_animal">();
	}
	static class UVerseQueryTestSuite_verse_query_tag_animal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_tag_animal>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_tag_animal) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_tag_animal");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_tag_animal) == 0x000028, "Wrong size on UVerseQueryTestSuite_verse_query_tag_animal");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_tag_cat
// 0x0000 (0x0028 - 0x0028)
class UVerseQueryTestSuite_verse_query_tag_cat : public UVerseQueryTestSuite_verse_query_tag_animal
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_tag_cat">();
	}
	static class UVerseQueryTestSuite_verse_query_tag_cat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_tag_cat>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_tag_cat) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_tag_cat");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_tag_cat) == 0x000028, "Wrong size on UVerseQueryTestSuite_verse_query_tag_cat");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_tag_jello_cat
// 0x0000 (0x0028 - 0x0028)
class UVerseQueryTestSuite_verse_query_tag_jello_cat final : public UVerseQueryTestSuite_verse_query_tag_cat
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_tag_jello_cat">();
	}
	static class UVerseQueryTestSuite_verse_query_tag_jello_cat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_tag_jello_cat>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_tag_jello_cat) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_tag_jello_cat");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_tag_jello_cat) == 0x000028, "Wrong size on UVerseQueryTestSuite_verse_query_tag_jello_cat");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_tag_cheddar_cat
// 0x0000 (0x0028 - 0x0028)
class UVerseQueryTestSuite_verse_query_tag_cheddar_cat final : public UVerseQueryTestSuite_verse_query_tag_cat
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_tag_cheddar_cat">();
	}
	static class UVerseQueryTestSuite_verse_query_tag_cheddar_cat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_tag_cheddar_cat>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_tag_cheddar_cat) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_tag_cheddar_cat");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_tag_cheddar_cat) == 0x000028, "Wrong size on UVerseQueryTestSuite_verse_query_tag_cheddar_cat");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_not_used_test_entity
// 0x0000 (0x0130 - 0x0130)
class UVerseQueryTestSuite_verse_query_not_used_test_entity final : public UEntity_entity
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_not_used_test_entity">();
	}
	static class UVerseQueryTestSuite_verse_query_not_used_test_entity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_not_used_test_entity>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_not_used_test_entity) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_not_used_test_entity");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_not_used_test_entity) == 0x000130, "Wrong size on UVerseQueryTestSuite_verse_query_not_used_test_entity");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_tag_dog
// 0x0000 (0x0028 - 0x0028)
class UVerseQueryTestSuite_verse_query_tag_dog : public UVerseQueryTestSuite_verse_query_tag_animal
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_tag_dog">();
	}
	static class UVerseQueryTestSuite_verse_query_tag_dog* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_tag_dog>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_tag_dog) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_tag_dog");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_tag_dog) == 0x000028, "Wrong size on UVerseQueryTestSuite_verse_query_tag_dog");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_tag_kimchi_dog
// 0x0000 (0x0028 - 0x0028)
class UVerseQueryTestSuite_verse_query_tag_kimchi_dog final : public UVerseQueryTestSuite_verse_query_tag_dog
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_tag_kimchi_dog">();
	}
	static class UVerseQueryTestSuite_verse_query_tag_kimchi_dog* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_tag_kimchi_dog>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_tag_kimchi_dog) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_tag_kimchi_dog");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_tag_kimchi_dog) == 0x000028, "Wrong size on UVerseQueryTestSuite_verse_query_tag_kimchi_dog");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_other_test_component
// 0x0000 (0x00B8 - 0x00B8)
class UVerseQueryTestSuite_verse_query_other_test_component final : public UEntity_component
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_other_test_component">();
	}
	static class UVerseQueryTestSuite_verse_query_other_test_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_other_test_component>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_other_test_component) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_other_test_component");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_other_test_component) == 0x0000B8, "Wrong size on UVerseQueryTestSuite_verse_query_other_test_component");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_tag_pollo_dog
// 0x0000 (0x0028 - 0x0028)
class UVerseQueryTestSuite_verse_query_tag_pollo_dog final : public UVerseQueryTestSuite_verse_query_tag_dog
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_tag_pollo_dog">();
	}
	static class UVerseQueryTestSuite_verse_query_tag_pollo_dog* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_tag_pollo_dog>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_tag_pollo_dog) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_tag_pollo_dog");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_tag_pollo_dog) == 0x000028, "Wrong size on UVerseQueryTestSuite_verse_query_tag_pollo_dog");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_test_component
// 0x0000 (0x00B8 - 0x00B8)
class UVerseQueryTestSuite_verse_query_test_component final : public UEntity_component
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_test_component">();
	}
	static class UVerseQueryTestSuite_verse_query_test_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_test_component>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_test_component) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_test_component");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_test_component) == 0x0000B8, "Wrong size on UVerseQueryTestSuite_verse_query_test_component");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_test_entity
// 0x0000 (0x0130 - 0x0130)
class UVerseQueryTestSuite_verse_query_test_entity final : public UEntity_entity
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_test_entity">();
	}
	static class UVerseQueryTestSuite_verse_query_test_entity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_test_entity>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_test_entity) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_test_entity");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_test_entity) == 0x000130, "Wrong size on UVerseQueryTestSuite_verse_query_test_entity");

// VerseClass VerseQueryTestSuite.VerseQueryTestSuite_verse_query_unused_test_component
// 0x0000 (0x00B8 - 0x00B8)
class UVerseQueryTestSuite_verse_query_unused_test_component final : public UEntity_component
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseQueryTestSuite_verse_query_unused_test_component">();
	}
	static class UVerseQueryTestSuite_verse_query_unused_test_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseQueryTestSuite_verse_query_unused_test_component>();
	}
};
static_assert(alignof(UVerseQueryTestSuite_verse_query_unused_test_component) == 0x000008, "Wrong alignment on UVerseQueryTestSuite_verse_query_unused_test_component");
static_assert(sizeof(UVerseQueryTestSuite_verse_query_unused_test_component) == 0x0000B8, "Wrong size on UVerseQueryTestSuite_verse_query_unused_test_component");

}

