#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseSimulationMetadata_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass VerseSimulationMetadata.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseSimulationMetadata_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseSimulationMetadata.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseSimulationMetadata_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseSimulationMetadata_0::U_SolarisSignatureFunctionOuter>();
	}
};
static_assert(alignof(VerseSimulationMetadata_0::U_SolarisSignatureFunctionOuter) == 0x000008, "Wrong alignment on VerseSimulationMetadata_0::U_SolarisSignatureFunctionOuter");
static_assert(sizeof(VerseSimulationMetadata_0::U_SolarisSignatureFunctionOuter) == 0x000028, "Wrong size on VerseSimulationMetadata_0::U_SolarisSignatureFunctionOuter");

// VerseClass VerseSimulationMetadata.Simulation
// 0x0008 (0x0030 - 0x0028)
class VerseSimulationMetadata_0::USimulation final : public UObject
{
public:
	class UVerse_message*                         __verse_0x231BDA57_editable_empty_message;         // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseSimulationMetadata.Simulation", true>();
	}
	static class VerseSimulationMetadata_0::USimulation* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseSimulationMetadata_0::USimulation>();
	}
};
static_assert(alignof(VerseSimulationMetadata_0::USimulation) == 0x000008, "Wrong alignment on VerseSimulationMetadata_0::USimulation");
static_assert(sizeof(VerseSimulationMetadata_0::USimulation) == 0x000030, "Wrong size on VerseSimulationMetadata_0::USimulation");
static_assert(offsetof(VerseSimulationMetadata_0::USimulation, __verse_0x231BDA57_editable_empty_message) == 0x000028, "Member 'VerseSimulationMetadata_0::USimulation::__verse_0x231BDA57_editable_empty_message' has a wrong offset!");

}

