#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseInput

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function VerseInput.VerseReplicatedInputDataComponent.OnInputActionTriggered
// 0x0060 (0x0060 - 0x0000)
struct VerseReplicatedInputDataComponent_OnInputActionTriggered final
{
public:
	struct FInputActionInstance                   ActionInstance;                                    // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseReplicatedInputDataComponent_OnInputActionTriggered) == 0x000008, "Wrong alignment on VerseReplicatedInputDataComponent_OnInputActionTriggered");
static_assert(sizeof(VerseReplicatedInputDataComponent_OnInputActionTriggered) == 0x000060, "Wrong size on VerseReplicatedInputDataComponent_OnInputActionTriggered");
static_assert(offsetof(VerseReplicatedInputDataComponent_OnInputActionTriggered, ActionInstance) == 0x000000, "Member 'VerseReplicatedInputDataComponent_OnInputActionTriggered::ActionInstance' has a wrong offset!");

// Function VerseInput.VerseReplicatedInputDataComponent.ServerInputActionTriggered
// 0x0028 (0x0028 - 0x0000)
struct VerseReplicatedInputDataComponent_ServerInputActionTriggered final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InputValue;                                        // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VerseReplicatedInputDataComponent_ServerInputActionTriggered) == 0x000008, "Wrong alignment on VerseReplicatedInputDataComponent_ServerInputActionTriggered");
static_assert(sizeof(VerseReplicatedInputDataComponent_ServerInputActionTriggered) == 0x000028, "Wrong size on VerseReplicatedInputDataComponent_ServerInputActionTriggered");
static_assert(offsetof(VerseReplicatedInputDataComponent_ServerInputActionTriggered, Guid) == 0x000000, "Member 'VerseReplicatedInputDataComponent_ServerInputActionTriggered::Guid' has a wrong offset!");
static_assert(offsetof(VerseReplicatedInputDataComponent_ServerInputActionTriggered, InputValue) == 0x000010, "Member 'VerseReplicatedInputDataComponent_ServerInputActionTriggered::InputValue' has a wrong offset!");

}

