#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VictoryCrownsReadRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class VictoryCrownsReadRuntime.FortVictoryCrownInterface
// 0x0000 (0x0028 - 0x0028)
class IFortVictoryCrownInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVictoryCrownInterface">();
	}
	static class IFortVictoryCrownInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortVictoryCrownInterface>();
	}
};
static_assert(alignof(IFortVictoryCrownInterface) == 0x000008, "Wrong alignment on IFortVictoryCrownInterface");
static_assert(sizeof(IFortVictoryCrownInterface) == 0x000028, "Wrong size on IFortVictoryCrownInterface");

// Class VictoryCrownsReadRuntime.FortCosmeticStatObject_HasCrown
// 0x0008 (0x0090 - 0x0088)
class UFortCosmeticStatObject_HasCrown : public UFortCosmeticStatObject
{
public:
	class UFortVictoryCrownAccountItemDefinition* VictoryCrownAccountItemDefinition;                 // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCosmeticStatObject_HasCrown">();
	}
	static class UFortCosmeticStatObject_HasCrown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticStatObject_HasCrown>();
	}
};
static_assert(alignof(UFortCosmeticStatObject_HasCrown) == 0x000008, "Wrong alignment on UFortCosmeticStatObject_HasCrown");
static_assert(sizeof(UFortCosmeticStatObject_HasCrown) == 0x000090, "Wrong size on UFortCosmeticStatObject_HasCrown");
static_assert(offsetof(UFortCosmeticStatObject_HasCrown, VictoryCrownAccountItemDefinition) == 0x000088, "Member 'UFortCosmeticStatObject_HasCrown::VictoryCrownAccountItemDefinition' has a wrong offset!");

// Class VictoryCrownsReadRuntime.FortCosmeticStatObject_TotalRoyalRoyales
// 0x0018 (0x00A0 - 0x0088)
class UFortCosmeticStatObject_TotalRoyalRoyales : public UFortCosmeticStatObject
{
public:
	class UFortVictoryCrownAccountItemDefinition* VictoryCrownAccountItemDefinition;                 // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCosmeticStatObject_TotalRoyalRoyales">();
	}
	static class UFortCosmeticStatObject_TotalRoyalRoyales* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticStatObject_TotalRoyalRoyales>();
	}
};
static_assert(alignof(UFortCosmeticStatObject_TotalRoyalRoyales) == 0x000008, "Wrong alignment on UFortCosmeticStatObject_TotalRoyalRoyales");
static_assert(sizeof(UFortCosmeticStatObject_TotalRoyalRoyales) == 0x0000A0, "Wrong size on UFortCosmeticStatObject_TotalRoyalRoyales");
static_assert(offsetof(UFortCosmeticStatObject_TotalRoyalRoyales, VictoryCrownAccountItemDefinition) == 0x000088, "Member 'UFortCosmeticStatObject_TotalRoyalRoyales::VictoryCrownAccountItemDefinition' has a wrong offset!");

// Class VictoryCrownsReadRuntime.FortCosmeticStatObject_TotalVictoryCrowns
// 0x0008 (0x0090 - 0x0088)
class UFortCosmeticStatObject_TotalVictoryCrowns : public UFortCosmeticStatObject
{
public:
	class UFortVictoryCrownAccountItemDefinition* VictoryCrownAccountItemDefinition;                 // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCosmeticStatObject_TotalVictoryCrowns">();
	}
	static class UFortCosmeticStatObject_TotalVictoryCrowns* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCosmeticStatObject_TotalVictoryCrowns>();
	}
};
static_assert(alignof(UFortCosmeticStatObject_TotalVictoryCrowns) == 0x000008, "Wrong alignment on UFortCosmeticStatObject_TotalVictoryCrowns");
static_assert(sizeof(UFortCosmeticStatObject_TotalVictoryCrowns) == 0x000090, "Wrong size on UFortCosmeticStatObject_TotalVictoryCrowns");
static_assert(offsetof(UFortCosmeticStatObject_TotalVictoryCrowns, VictoryCrownAccountItemDefinition) == 0x000088, "Member 'UFortCosmeticStatObject_TotalVictoryCrowns::VictoryCrownAccountItemDefinition' has a wrong offset!");

}

