#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterAdvanced

#include "Basic.hpp"

#include "WaterAdvanced_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class WaterAdvanced.ShallowWaterPhysicsAssetOverridesDataAsset
// 0x0050 (0x0080 - 0x0030)
class UShallowWaterPhysicsAssetOverridesDataAsset final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FShallowWaterPhysicsAssetOverride> Overrides;                                         // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShallowWaterPhysicsAssetOverridesDataAsset">();
	}
	static class UShallowWaterPhysicsAssetOverridesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShallowWaterPhysicsAssetOverridesDataAsset>();
	}
};
static_assert(alignof(UShallowWaterPhysicsAssetOverridesDataAsset) == 0x000008, "Wrong alignment on UShallowWaterPhysicsAssetOverridesDataAsset");
static_assert(sizeof(UShallowWaterPhysicsAssetOverridesDataAsset) == 0x000080, "Wrong size on UShallowWaterPhysicsAssetOverridesDataAsset");
static_assert(offsetof(UShallowWaterPhysicsAssetOverridesDataAsset, Overrides) == 0x000030, "Member 'UShallowWaterPhysicsAssetOverridesDataAsset::Overrides' has a wrong offset!");

// Class WaterAdvanced.ShallowWaterSettings
// 0x0090 (0x00C0 - 0x0030)
class UShallowWaterSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          DefaultShallowWaterNiagaraSimulation;              // 0x0030(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FShallowWaterSimParameters             ShallowWaterSimParameters;                         // 0x0050(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialParameterCollection> WaterMPC;                                          // 0x0060(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GridCenterMPCName;                                 // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WorldGridSizeMPCName;                              // 0x0084(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ResolutionMaxAxisMPCName;                          // 0x0088(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NormalRTMaterialName;                              // 0x008C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxActivePawnNum;                                  // 0x0090(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxImpulseForceNum;                                // 0x0094(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UShallowWaterPhysicsAssetOverridesDataAsset> PhysicsAssetOverridesDataAsset;                    // 0x0098(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualizeActivePawn;                              // 0x00B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShallowWaterSettings">();
	}
	static class UShallowWaterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShallowWaterSettings>();
	}
};
static_assert(alignof(UShallowWaterSettings) == 0x000008, "Wrong alignment on UShallowWaterSettings");
static_assert(sizeof(UShallowWaterSettings) == 0x0000C0, "Wrong size on UShallowWaterSettings");
static_assert(offsetof(UShallowWaterSettings, DefaultShallowWaterNiagaraSimulation) == 0x000030, "Member 'UShallowWaterSettings::DefaultShallowWaterNiagaraSimulation' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, ShallowWaterSimParameters) == 0x000050, "Member 'UShallowWaterSettings::ShallowWaterSimParameters' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, WaterMPC) == 0x000060, "Member 'UShallowWaterSettings::WaterMPC' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, GridCenterMPCName) == 0x000080, "Member 'UShallowWaterSettings::GridCenterMPCName' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, WorldGridSizeMPCName) == 0x000084, "Member 'UShallowWaterSettings::WorldGridSizeMPCName' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, ResolutionMaxAxisMPCName) == 0x000088, "Member 'UShallowWaterSettings::ResolutionMaxAxisMPCName' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, NormalRTMaterialName) == 0x00008C, "Member 'UShallowWaterSettings::NormalRTMaterialName' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, MaxActivePawnNum) == 0x000090, "Member 'UShallowWaterSettings::MaxActivePawnNum' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, MaxImpulseForceNum) == 0x000094, "Member 'UShallowWaterSettings::MaxImpulseForceNum' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, PhysicsAssetOverridesDataAsset) == 0x000098, "Member 'UShallowWaterSettings::PhysicsAssetOverridesDataAsset' has a wrong offset!");
static_assert(offsetof(UShallowWaterSettings, bVisualizeActivePawn) == 0x0000B8, "Member 'UShallowWaterSettings::bVisualizeActivePawn' has a wrong offset!");

// Class WaterAdvanced.ShallowWaterSubsystem
// 0x00E8 (0x0128 - 0x0040)
class UShallowWaterSubsystem : public UTickableWorldSubsystem
{
public:
	class UNiagaraComponent*                      ShallowWaterNiagaraSimulation;                     // 0x0040(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 WaterInfoTexture;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 NormalRT;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UShallowWaterSettings*                  Settings;                                          // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialParameterCollection*           MPC;                                               // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class APawn*>                          ActivePawns;                                       // 0x0068(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x20];                                      // 0x0078(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterBody*                             LatestValidWaterBody_Internal;                     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FShallowWaterCollisionContext>  PreviousContexts;                                  // 0x00A8(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FShallowWaterCollisionContext>  PendingContexts;                                   // 0x00B8(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<struct FShallowWaterCollisionContext, class USkeletalMeshComponent*> VehicleCollisionProxies;                           // 0x00C8(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLocalPlayerControllerBecomesValid(class APlayerController* InPlayerController);
	void OnLocalPlayerPawnBecomesValid(class APawn* OldPawn, class APawn* NewPawn);
	void OnWaterInfoTextureCreatedOrChanged(const class UTextureRenderTarget2D* WaterInfoTexture_0);
	void RegisterImpact(const struct FVector& ImpactPosition, const struct FVector& ImpactVelocity, float ImpactRadius);
	void ResetImpacts();
	bool SetRecentValidWaterBody(class AWaterBody* InWaterBody, bool bOnlyReplaceIfNoValidWaterBodyFound);

	class AWaterBody* GetCurrentWaterBody() const;
	class AWaterBody* GetRecentValidWaterBody() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ShallowWaterSubsystem">();
	}
	static class UShallowWaterSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShallowWaterSubsystem>();
	}
};
static_assert(alignof(UShallowWaterSubsystem) == 0x000008, "Wrong alignment on UShallowWaterSubsystem");
static_assert(sizeof(UShallowWaterSubsystem) == 0x000128, "Wrong size on UShallowWaterSubsystem");
static_assert(offsetof(UShallowWaterSubsystem, ShallowWaterNiagaraSimulation) == 0x000040, "Member 'UShallowWaterSubsystem::ShallowWaterNiagaraSimulation' has a wrong offset!");
static_assert(offsetof(UShallowWaterSubsystem, WaterInfoTexture) == 0x000048, "Member 'UShallowWaterSubsystem::WaterInfoTexture' has a wrong offset!");
static_assert(offsetof(UShallowWaterSubsystem, NormalRT) == 0x000050, "Member 'UShallowWaterSubsystem::NormalRT' has a wrong offset!");
static_assert(offsetof(UShallowWaterSubsystem, Settings) == 0x000058, "Member 'UShallowWaterSubsystem::Settings' has a wrong offset!");
static_assert(offsetof(UShallowWaterSubsystem, MPC) == 0x000060, "Member 'UShallowWaterSubsystem::MPC' has a wrong offset!");
static_assert(offsetof(UShallowWaterSubsystem, ActivePawns) == 0x000068, "Member 'UShallowWaterSubsystem::ActivePawns' has a wrong offset!");
static_assert(offsetof(UShallowWaterSubsystem, LatestValidWaterBody_Internal) == 0x000098, "Member 'UShallowWaterSubsystem::LatestValidWaterBody_Internal' has a wrong offset!");
static_assert(offsetof(UShallowWaterSubsystem, PreviousContexts) == 0x0000A8, "Member 'UShallowWaterSubsystem::PreviousContexts' has a wrong offset!");
static_assert(offsetof(UShallowWaterSubsystem, PendingContexts) == 0x0000B8, "Member 'UShallowWaterSubsystem::PendingContexts' has a wrong offset!");
static_assert(offsetof(UShallowWaterSubsystem, VehicleCollisionProxies) == 0x0000C8, "Member 'UShallowWaterSubsystem::VehicleCollisionProxies' has a wrong offset!");

}

