#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterAdvanced

#include "Basic.hpp"


namespace SDK
{

// Enum WaterAdvanced.EShallowWaterCollisionContextType
// NumValues: 0x0004
enum class EShallowWaterCollisionContextType : uint8
{
	Pawn                                     = 0,
	Vehicle                                  = 1,
	Custom                                   = 2,
	EShallowWaterCollisionContextType_MAX    = 3,
};

// ScriptStruct WaterAdvanced.ShallowWaterSimParameters
// 0x000C (0x000C - 0x0000)
struct FShallowWaterSimParameters final
{
public:
	float                                         WorldGridSize;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResolutionMaxAxis;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxImpactsPerFrame;                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FShallowWaterSimParameters) == 0x000004, "Wrong alignment on FShallowWaterSimParameters");
static_assert(sizeof(FShallowWaterSimParameters) == 0x00000C, "Wrong size on FShallowWaterSimParameters");
static_assert(offsetof(FShallowWaterSimParameters, WorldGridSize) == 0x000000, "Member 'FShallowWaterSimParameters::WorldGridSize' has a wrong offset!");
static_assert(offsetof(FShallowWaterSimParameters, ResolutionMaxAxis) == 0x000004, "Member 'FShallowWaterSimParameters::ResolutionMaxAxis' has a wrong offset!");
static_assert(offsetof(FShallowWaterSimParameters, MaxImpactsPerFrame) == 0x000008, "Member 'FShallowWaterSimParameters::MaxImpactsPerFrame' has a wrong offset!");

// ScriptStruct WaterAdvanced.ShallowWaterPhysicsAssetOverride
// 0x0020 (0x0020 - 0x0000)
struct FShallowWaterPhysicsAssetOverride final
{
public:
	TSoftObjectPtr<class UPhysicsAsset>           PhysicsAsset;                                      // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FShallowWaterPhysicsAssetOverride) == 0x000008, "Wrong alignment on FShallowWaterPhysicsAssetOverride");
static_assert(sizeof(FShallowWaterPhysicsAssetOverride) == 0x000020, "Wrong size on FShallowWaterPhysicsAssetOverride");
static_assert(offsetof(FShallowWaterPhysicsAssetOverride, PhysicsAsset) == 0x000000, "Member 'FShallowWaterPhysicsAssetOverride::PhysicsAsset' has a wrong offset!");

// ScriptStruct WaterAdvanced.ShallowWaterCollisionContext
// 0x0018 (0x0018 - 0x0000)
struct FShallowWaterCollisionContext final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Component;                                         // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FShallowWaterCollisionContext) == 0x000008, "Wrong alignment on FShallowWaterCollisionContext");
static_assert(sizeof(FShallowWaterCollisionContext) == 0x000018, "Wrong size on FShallowWaterCollisionContext");
static_assert(offsetof(FShallowWaterCollisionContext, Component) == 0x000008, "Member 'FShallowWaterCollisionContext::Component' has a wrong offset!");

}

