#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Backplate_Base

#include "Basic.hpp"

#include "E_UI_BackplateBrightness_structs.hpp"
#include "Engine_structs.hpp"
#include "S_UI_BackplateCornerRadiusValues_structs.hpp"
#include "E_UI_BackplateCornerRadius_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Backplate_Base.WBP_UIKit_Backplate_Base_C
// 0x0078 (0x0338 - 0x02C0)
class UWBP_UIKit_Backplate_Base_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Backplate;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_UI_BackplateBrightness                      Brightness;                                        // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateCornerRadius                    CornerRadius;                                      // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      BackplateMaterial;                                 // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_BackplateCornerRadiusValues      Corners;                                           // 0x02E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_BackplateCornerRadiusValues      MobileCorners;                                     // 0x0308(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackplateMID;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Backplate_Base(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RefreshBackplateMID();
	void SetBackplateMaterial(class UMaterialInstance* Material_Instance);
	void SetBrightness(E_UI_BackplateBrightness Brightness_0);
	void SetCornerRadius(E_UI_BackplateCornerRadius Corner_Radius);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Backplate_Base_C">();
	}
	static class UWBP_UIKit_Backplate_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Backplate_Base_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Backplate_Base_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Backplate_Base_C");
static_assert(sizeof(UWBP_UIKit_Backplate_Base_C) == 0x000338, "Wrong size on UWBP_UIKit_Backplate_Base_C");
static_assert(offsetof(UWBP_UIKit_Backplate_Base_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UIKit_Backplate_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Backplate_Base_C, Backplate) == 0x0002C8, "Member 'UWBP_UIKit_Backplate_Base_C::Backplate' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Backplate_Base_C, Brightness) == 0x0002D0, "Member 'UWBP_UIKit_Backplate_Base_C::Brightness' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Backplate_Base_C, CornerRadius) == 0x0002D1, "Member 'UWBP_UIKit_Backplate_Base_C::CornerRadius' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Backplate_Base_C, BackplateMaterial) == 0x0002D8, "Member 'UWBP_UIKit_Backplate_Base_C::BackplateMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Backplate_Base_C, Corners) == 0x0002E0, "Member 'UWBP_UIKit_Backplate_Base_C::Corners' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Backplate_Base_C, MobileCorners) == 0x000308, "Member 'UWBP_UIKit_Backplate_Base_C::MobileCorners' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Backplate_Base_C, BackplateMID) == 0x000330, "Member 'UWBP_UIKit_Backplate_Base_C::BackplateMID' has a wrong offset!");

}

