#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildsetDialog_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuildsetDialog_Entry.WBP_BuildsetDialog_Entry_C
// 0x0060 (0x0320 - 0x02C0)
class UWBP_BuildsetDialog_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Name;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         FortLazyImage_Icon;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_All;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Rarity;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Image;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_All;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Name;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ResourceAmount;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Text;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortRarity                                   PreviewRarity;                                     // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_BuildsetDialog_Entry(int32 EntryPoint);
	void InitializeIngredient(const struct FJunoShopBuildResourceRequirement& Resource);
	void Is_Arabic_Language(bool* IsArabic);
	void PreConstruct(bool IsDesignTime);
	void SetIngredientRarity(EFortRarity Rarity);
	void SetMobileSizing();
	void UpdateCultureFlow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuildsetDialog_Entry_C">();
	}
	static class UWBP_BuildsetDialog_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuildsetDialog_Entry_C>();
	}
};
static_assert(alignof(UWBP_BuildsetDialog_Entry_C) == 0x000008, "Wrong alignment on UWBP_BuildsetDialog_Entry_C");
static_assert(sizeof(UWBP_BuildsetDialog_Entry_C) == 0x000320, "Wrong size on UWBP_BuildsetDialog_Entry_C");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_BuildsetDialog_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, Border_Name) == 0x0002C8, "Member 'UWBP_BuildsetDialog_Entry_C::Border_Name' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, FortLazyImage_Icon) == 0x0002D0, "Member 'UWBP_BuildsetDialog_Entry_C::FortLazyImage_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, HorizontalBox_All) == 0x0002D8, "Member 'UWBP_BuildsetDialog_Entry_C::HorizontalBox_All' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, Image_BG) == 0x0002E0, "Member 'UWBP_BuildsetDialog_Entry_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, Image_Rarity) == 0x0002E8, "Member 'UWBP_BuildsetDialog_Entry_C::Image_Rarity' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, Overlay_Image) == 0x0002F0, "Member 'UWBP_BuildsetDialog_Entry_C::Overlay_Image' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, SizeBox_All) == 0x0002F8, "Member 'UWBP_BuildsetDialog_Entry_C::SizeBox_All' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, Text_Name) == 0x000300, "Member 'UWBP_BuildsetDialog_Entry_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, Text_ResourceAmount) == 0x000308, "Member 'UWBP_BuildsetDialog_Entry_C::Text_ResourceAmount' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, VerticalBox_Text) == 0x000310, "Member 'UWBP_BuildsetDialog_Entry_C::VerticalBox_Text' has a wrong offset!");
static_assert(offsetof(UWBP_BuildsetDialog_Entry_C, PreviewRarity) == 0x000318, "Member 'UWBP_BuildsetDialog_Entry_C::PreviewRarity' has a wrong offset!");

}

