#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Juno_CustomBanner

#include "Basic.hpp"

#include "E_CustomBannerViewType_structs.hpp"
#include "WBP_MPItemShop_CustomBanner_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Juno_CustomBanner.WBP_Juno_CustomBanner_C
// 0x0078 (0x0338 - 0x02C0)
class UWBP_Juno_CustomBanner_C final : public UWBP_MPItemShop_CustomBanner_C
{
public:
	class UFortItemShopOfferVM*                   FortItemShopOfferVM;                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Items;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_ViewType;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Usable;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, int32>                    ItemAmountsMap;                                    // 0x02E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_CustomBannerViewType                        CurrentView;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BuildEntry(int32 Index_0);
	void IncrementMapValue(const class FText& Key, const int32 AmountToAdd);
	void ParseGrantedItems(TArray<class UFortItemVM*>& Items);
	void ParseItem(class UFortItemVM* Item);
	void SetFortItemShopOfferVM(class UFortItemShopOfferVM* ViewModel);
	void SetOfferViewModel(class UFortItemShopOfferVM* OfferVM);
	void SetViewType(E_CustomBannerViewType ViewType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Juno_CustomBanner_C">();
	}
	static class UWBP_Juno_CustomBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Juno_CustomBanner_C>();
	}
};
static_assert(alignof(UWBP_Juno_CustomBanner_C) == 0x000008, "Wrong alignment on UWBP_Juno_CustomBanner_C");
static_assert(sizeof(UWBP_Juno_CustomBanner_C) == 0x000338, "Wrong size on UWBP_Juno_CustomBanner_C");
static_assert(offsetof(UWBP_Juno_CustomBanner_C, FortItemShopOfferVM) == 0x0002C0, "Member 'UWBP_Juno_CustomBanner_C::FortItemShopOfferVM' has a wrong offset!");
static_assert(offsetof(UWBP_Juno_CustomBanner_C, FortDynamicEntryBox_Items) == 0x0002C8, "Member 'UWBP_Juno_CustomBanner_C::FortDynamicEntryBox_Items' has a wrong offset!");
static_assert(offsetof(UWBP_Juno_CustomBanner_C, Switcher_ViewType) == 0x0002D0, "Member 'UWBP_Juno_CustomBanner_C::Switcher_ViewType' has a wrong offset!");
static_assert(offsetof(UWBP_Juno_CustomBanner_C, Text_Usable) == 0x0002D8, "Member 'UWBP_Juno_CustomBanner_C::Text_Usable' has a wrong offset!");
static_assert(offsetof(UWBP_Juno_CustomBanner_C, ItemAmountsMap) == 0x0002E0, "Member 'UWBP_Juno_CustomBanner_C::ItemAmountsMap' has a wrong offset!");
static_assert(offsetof(UWBP_Juno_CustomBanner_C, CurrentView) == 0x000330, "Member 'UWBP_Juno_CustomBanner_C::CurrentView' has a wrong offset!");

}

