#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Expandable_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Expandable_Base.WBP_Expandable_Base_C
// 0x0050 (0x15E0 - 0x1590)
class UWBP_Expandable_Base_C : public UUIKitHoldableModularButton
{
public:
	uint8                                         Pad_1588[0x8];                                     // 0x1588(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x1598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Outline_C*             Block_Outline;                                     // 0x15A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Content;                                 // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_LeftInnerTooltip;                        // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_LeftInnerTooltip;                          // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Content;                                   // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortHabaneroDisplayData*               RankInfo;                                          // 0x15C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandler;                                      // 0x15D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExtPartCollapsed;                               // 0x15D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollapseException;                                 // 0x15D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnFocusLost();
	void BP_OnFocusReceived();
	struct FEventReply BP_OnHoldTriggered(ECommonInputType CurrentInputType);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void CollapseExtPart();
	void ExecuteUbergraph_WBP_Expandable_Base(int32 EntryPoint);
	void ExpandExtPart();
	void HideExpandableBox();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Expandable_Base_C">();
	}
	static class UWBP_Expandable_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Expandable_Base_C>();
	}
};
static_assert(alignof(UWBP_Expandable_Base_C) == 0x000010, "Wrong alignment on UWBP_Expandable_Base_C");
static_assert(sizeof(UWBP_Expandable_Base_C) == 0x0015E0, "Wrong size on UWBP_Expandable_Base_C");
static_assert(offsetof(UWBP_Expandable_Base_C, UberGraphFrame) == 0x001590, "Member 'UWBP_Expandable_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, Hovered) == 0x001598, "Member 'UWBP_Expandable_Base_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, Block_Outline) == 0x0015A0, "Member 'UWBP_Expandable_Base_C::Block_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, NamedSlot_Content) == 0x0015A8, "Member 'UWBP_Expandable_Base_C::NamedSlot_Content' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, NamedSlot_LeftInnerTooltip) == 0x0015B0, "Member 'UWBP_Expandable_Base_C::NamedSlot_LeftInnerTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, Overlay_LeftInnerTooltip) == 0x0015B8, "Member 'UWBP_Expandable_Base_C::Overlay_LeftInnerTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, SizeBox_Content) == 0x0015C0, "Member 'UWBP_Expandable_Base_C::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, RankInfo) == 0x0015C8, "Member 'UWBP_Expandable_Base_C::RankInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, TimerHandler) == 0x0015D0, "Member 'UWBP_Expandable_Base_C::TimerHandler' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, bIsExtPartCollapsed) == 0x0015D8, "Member 'UWBP_Expandable_Base_C::bIsExtPartCollapsed' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Base_C, CollapseException) == 0x0015D9, "Member 'UWBP_Expandable_Base_C::CollapseException' has a wrong offset!");

}

