#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Backplate_Base

#include "Basic.hpp"

#include "E_UI_BackplateBrightness_structs.hpp"
#include "E_UI_BackplateCornerRadius_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Backplate_Base.WBP_UIKit_Backplate_Base_C.ExecuteUbergraph_WBP_UIKit_Backplate_Base
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_Backplate_Base_C_ExecuteUbergraph_WBP_UIKit_Backplate_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Backplate_Base_C_ExecuteUbergraph_WBP_UIKit_Backplate_Base) == 0x000004, "Wrong alignment on WBP_UIKit_Backplate_Base_C_ExecuteUbergraph_WBP_UIKit_Backplate_Base");
static_assert(sizeof(WBP_UIKit_Backplate_Base_C_ExecuteUbergraph_WBP_UIKit_Backplate_Base) == 0x000008, "Wrong size on WBP_UIKit_Backplate_Base_C_ExecuteUbergraph_WBP_UIKit_Backplate_Base");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_ExecuteUbergraph_WBP_UIKit_Backplate_Base, EntryPoint) == 0x000000, "Member 'WBP_UIKit_Backplate_Base_C_ExecuteUbergraph_WBP_UIKit_Backplate_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_ExecuteUbergraph_WBP_UIKit_Backplate_Base, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UIKit_Backplate_Base_C_ExecuteUbergraph_WBP_UIKit_Backplate_Base::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_Backplate_Base.WBP_UIKit_Backplate_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Backplate_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Backplate_Base_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UIKit_Backplate_Base_C_PreConstruct");
static_assert(sizeof(WBP_UIKit_Backplate_Base_C_PreConstruct) == 0x000001, "Wrong size on WBP_UIKit_Backplate_Base_C_PreConstruct");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UIKit_Backplate_Base_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UIKit_Backplate_Base.WBP_UIKit_Backplate_Base_C.RefreshBackplateMID
// 0x0010 (0x0010 - 0x0000)
struct WBP_UIKit_Backplate_Base_C_RefreshBackplateMID final
{
public:
	class UMaterialInstanceDynamic*               NewMID;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Backplate_Base_C_RefreshBackplateMID) == 0x000008, "Wrong alignment on WBP_UIKit_Backplate_Base_C_RefreshBackplateMID");
static_assert(sizeof(WBP_UIKit_Backplate_Base_C_RefreshBackplateMID) == 0x000010, "Wrong size on WBP_UIKit_Backplate_Base_C_RefreshBackplateMID");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_RefreshBackplateMID, NewMID) == 0x000000, "Member 'WBP_UIKit_Backplate_Base_C_RefreshBackplateMID::NewMID' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_RefreshBackplateMID, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UIKit_Backplate_Base_C_RefreshBackplateMID::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UIKit_Backplate_Base.WBP_UIKit_Backplate_Base_C.SetBackplateMaterial
// 0x0008 (0x0008 - 0x0000)
struct WBP_UIKit_Backplate_Base_C_SetBackplateMaterial final
{
public:
	class UMaterialInstance*                      Material_Instance;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Backplate_Base_C_SetBackplateMaterial) == 0x000008, "Wrong alignment on WBP_UIKit_Backplate_Base_C_SetBackplateMaterial");
static_assert(sizeof(WBP_UIKit_Backplate_Base_C_SetBackplateMaterial) == 0x000008, "Wrong size on WBP_UIKit_Backplate_Base_C_SetBackplateMaterial");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetBackplateMaterial, Material_Instance) == 0x000000, "Member 'WBP_UIKit_Backplate_Base_C_SetBackplateMaterial::Material_Instance' has a wrong offset!");

// Function WBP_UIKit_Backplate_Base.WBP_UIKit_Backplate_Base_C.SetBrightness
// 0x0018 (0x0018 - 0x0000)
struct WBP_UIKit_Backplate_Base_C_SetBrightness final
{
public:
	E_UI_BackplateBrightness                      Brightness_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateBrightness                      Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Backplate_Base_C_SetBrightness) == 0x000004, "Wrong alignment on WBP_UIKit_Backplate_Base_C_SetBrightness");
static_assert(sizeof(WBP_UIKit_Backplate_Base_C_SetBrightness) == 0x000018, "Wrong size on WBP_UIKit_Backplate_Base_C_SetBrightness");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetBrightness, Brightness_0) == 0x000000, "Member 'WBP_UIKit_Backplate_Base_C_SetBrightness::Brightness_0' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetBrightness, Temp_byte_Variable) == 0x000001, "Member 'WBP_UIKit_Backplate_Base_C_SetBrightness::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetBrightness, Temp_real_Variable) == 0x000004, "Member 'WBP_UIKit_Backplate_Base_C_SetBrightness::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetBrightness, Temp_real_Variable_1) == 0x000008, "Member 'WBP_UIKit_Backplate_Base_C_SetBrightness::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetBrightness, Temp_real_Variable_2) == 0x00000C, "Member 'WBP_UIKit_Backplate_Base_C_SetBrightness::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetBrightness, Temp_real_Variable_3) == 0x000010, "Member 'WBP_UIKit_Backplate_Base_C_SetBrightness::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetBrightness, K2Node_Select_Default) == 0x000014, "Member 'WBP_UIKit_Backplate_Base_C_SetBrightness::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UIKit_Backplate_Base.WBP_UIKit_Backplate_Base_C.SetCornerRadius
// 0x0060 (0x0060 - 0x0000)
struct WBP_UIKit_Backplate_Base_C_SetCornerRadius final
{
public:
	E_UI_BackplateCornerRadius                    Corner_Radius;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateCornerRadius                    Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateCornerRadius                    Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateCornerRadius                    Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_2;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_3;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UIKit_Backplate_Base_C_SetCornerRadius) == 0x000008, "Wrong alignment on WBP_UIKit_Backplate_Base_C_SetCornerRadius");
static_assert(sizeof(WBP_UIKit_Backplate_Base_C_SetCornerRadius) == 0x000060, "Wrong size on WBP_UIKit_Backplate_Base_C_SetCornerRadius");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Corner_Radius) == 0x000000, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Corner_Radius' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Temp_bool_Variable) == 0x000001, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Temp_byte_Variable) == 0x000002, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Temp_bool_Variable_2) == 0x000006, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Temp_bool_Variable_3) == 0x000007, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Temp_bool_Variable_4) == 0x000008, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, Temp_bool_Variable_5) == 0x000009, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, CallFunc_IsMobileGame_ReturnValue) == 0x00000A, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, K2Node_Select_Default) == 0x000010, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, K2Node_Select_Default_1) == 0x000018, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000020, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, K2Node_Select_Default_2) == 0x000028, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, K2Node_Select_Default_3) == 0x000030, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, K2Node_MakeStruct_LinearColor) == 0x000038, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000048, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, K2Node_MakeStruct_R_ImplicitCast) == 0x00004C, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, K2Node_MakeStruct_G_ImplicitCast) == 0x000050, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, K2Node_MakeStruct_B_ImplicitCast) == 0x000054, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_UIKit_Backplate_Base_C_SetCornerRadius, K2Node_MakeStruct_A_ImplicitCast) == 0x000058, "Member 'WBP_UIKit_Backplate_Base_C_SetCornerRadius::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");

}

