#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Tabs_Categories_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Tabs_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Tabs_Categories_Base.WBP_UIKit_Tabs_Categories_Base_C
// 0x0150 (0x0790 - 0x0640)
#pragma pack(push, 0x1)
class alignas(0x10) UWBP_UIKit_Tabs_Categories_Base_C : public UWBP_UIKit_Tabs_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Tabs_Categories_Base_C;   // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 CategoryClass;                                     // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CategoryButtonClass;                               // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CategoryTabGroupClass;                             // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIKitTabGroupCategoryViewModel*> Local_Categories_View_Models;                      // 0x0660(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ExpandAnimationDuration;                           // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_UIKit_TabCategory_Base_C*>  CategoryContainers;                                // 0x0678(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Skip_Expand_Animation;                             // 0x0688(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowMultipleExpandedCategories;                   // 0x0689(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68A[0x6];                                      // 0x068A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            TabGroupBackground;                                // 0x0690(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnCategoryButtonClicked;                           // 0x0750(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCategoryTabSelected;                             // 0x0760(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCategoryTabClicked;                              // 0x0770(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          AllowEmptyCategories;                              // 0x0780(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Previous_Selected_Category;                        // 0x0784(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddButtonToGrid(class UWidget* Widget, int32 Index_0);
	void CheckCategoryChanged(class FName CategoryID);
	void ClearCategorySelection(class FName CategoryID);
	void CollapseOthers(class FName ExceptCategoryID);
	void Construct();
	void CopyTabsProps(class UWBP_UIKit_Tabs_Base_C* Target);
	void CreateCategoryContainer(class UWBP_UIKit_TabCategory_Base_C** Container);
	void Destruct();
	void Event_On_Input_Method_Changed(ECommonInputType bNewInputType);
	void Event_OnCategoryExpandedStateChanged(class FName CategoryID, bool IsExpanded);
	void Event_OnCategoryTabClicked(class FName CategoryID, class FName TabID, class UUIKitTabGroupButtonViewModel* TabVM);
	void Event_OnCategoryTabSelected(class FName CategoryID, class FName TabID, class UUIKitTabGroupButtonViewModel* TabVM);
	void Event_OnCategoryTabsInitialised(class UWBP_UIKit_Tabs_Base_C* Tabs);
	void Event_OnTabClicked(class FName TabID);
	void Event_OnTabSelected(class FName TabID);
	void ExecuteUbergraph_WBP_UIKit_Tabs_Categories_Base(int32 EntryPoint);
	void ExpandCategory(class FName CategoryID);
	void HandleCategoryClick(class FName CategoryID);
	void HandleCategoryExpandedStateChanged(class FName CategoryID, bool IsExpanded);
	void LatentDeselectAllCategories();
	void NotifyCategoryClicked(class FName TabID);
	void OnCategoryButtonClicked__DelegateSignature(class UCommonButtonBase* Button, class FName CategoryID, bool IsCategoryExpanded_0);
	void OnCategoryTabClicked__DelegateSignature(class FName CategoryID, class FName TabID, class UUIKitTabGroupButtonViewModel* TabVM);
	void OnCategoryTabSelected__DelegateSignature(class FName CategoryID, class FName TabID, class UUIKitTabGroupButtonViewModel* TabVM);
	void PreConstruct(bool IsDesignTime);
	void RefreshCategorySelectableState(class FName CategoryID, ECommonInputType InputType);
	void RefreshFocusOnSelectionState(ECommonInputType InputType);
	void SetCategoriesData(TArray<class UUIKitTabGroupCategoryViewModel*>& Categories);

	void GetCategoryContainer(class FName CategoryID, class UWBP_UIKit_TabCategory_Base_C** Container) const;
	class UCommonButtonBase* GetCategorySelectedTabButton(class FName CategoryID) const;
	class UCommonButtonBase* GetCategoryTabButton(class FName CategoryID, class FName TabNameID) const;
	void GetCategoryViewModelByID(class FName CategoryID, class UUIKitTabGroupCategoryViewModel** Category) const;
	void GetCategoryViewModelByIndex(int32 Index_0, class UUIKitTabGroupCategoryViewModel** Category) const;
	void IsCategoryExpanded(class FName CategoryID, bool* IsExpanded) const;
	void IsCategoryViewModelValid(class UUIKitTabGroupCategoryViewModel* CategoryVM, bool* IsValid) const;
	bool ShouldDisplaySelectionOnCollapsedCategory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Tabs_Categories_Base_C">();
	}
	static class UWBP_UIKit_Tabs_Categories_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Tabs_Categories_Base_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(UWBP_UIKit_Tabs_Categories_Base_C) == 0x000010, "Wrong alignment on UWBP_UIKit_Tabs_Categories_Base_C");
static_assert(sizeof(UWBP_UIKit_Tabs_Categories_Base_C) == 0x000790, "Wrong size on UWBP_UIKit_Tabs_Categories_Base_C");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, UberGraphFrame_WBP_UIKit_Tabs_Categories_Base_C) == 0x000640, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::UberGraphFrame_WBP_UIKit_Tabs_Categories_Base_C' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, CategoryClass) == 0x000648, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::CategoryClass' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, CategoryButtonClass) == 0x000650, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::CategoryButtonClass' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, CategoryTabGroupClass) == 0x000658, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::CategoryTabGroupClass' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, Local_Categories_View_Models) == 0x000660, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::Local_Categories_View_Models' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, ExpandAnimationDuration) == 0x000670, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::ExpandAnimationDuration' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, CategoryContainers) == 0x000678, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::CategoryContainers' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, Skip_Expand_Animation) == 0x000688, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::Skip_Expand_Animation' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, AllowMultipleExpandedCategories) == 0x000689, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::AllowMultipleExpandedCategories' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, TabGroupBackground) == 0x000690, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::TabGroupBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, OnCategoryButtonClicked) == 0x000750, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::OnCategoryButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, OnCategoryTabSelected) == 0x000760, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::OnCategoryTabSelected' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, OnCategoryTabClicked) == 0x000770, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::OnCategoryTabClicked' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, AllowEmptyCategories) == 0x000780, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::AllowEmptyCategories' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Tabs_Categories_Base_C, Previous_Selected_Category) == 0x000784, "Member 'UWBP_UIKit_Tabs_Categories_Base_C::Previous_Selected_Category' has a wrong offset!");

}

