#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildSet_PartsList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_BuildSet_PartsList.WBP_BuildSet_PartsList_C.HandleScroll
// 0x0088 (0x0088 - 0x0000)
struct WBP_BuildSet_PartsList_C_HandleScroll final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Max_ImplicitCast;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildSet_PartsList_C_HandleScroll) == 0x000008, "Wrong alignment on WBP_BuildSet_PartsList_C_HandleScroll");
static_assert(sizeof(WBP_BuildSet_PartsList_C_HandleScroll) == 0x000088, "Wrong size on WBP_BuildSet_PartsList_C_HandleScroll");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, Direction) == 0x000000, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::Direction' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, Temp_real_Variable) == 0x000008, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, Temp_real_Variable_1) == 0x000010, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, Temp_real_Variable_2) == 0x000018, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, Temp_real_Variable_3) == 0x000020, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, Temp_real_Variable_4) == 0x000028, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, Temp_real_Variable_5) == 0x000030, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, Temp_real_Variable_6) == 0x000038, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, Temp_byte_Variable) == 0x000040, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000044, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, K2Node_Select_Default) == 0x000048, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, CallFunc_GetScrollOffset_ReturnValue) == 0x000060, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, CallFunc_FClamp_ReturnValue) == 0x000070, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, CallFunc_FClamp_Max_ImplicitCast) == 0x000078, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::CallFunc_FClamp_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_HandleScroll, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'WBP_BuildSet_PartsList_C_HandleScroll::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_BuildSet_PartsList.WBP_BuildSet_PartsList_C.SetAnimatedScrollValue
// 0x0028 (0x0028 - 0x0000)
struct WBP_BuildSet_PartsList_C_SetAnimatedScrollValue final
{
public:
	double                                        Lerp_Value;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_A_ImplicitCast;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildSet_PartsList_C_SetAnimatedScrollValue) == 0x000008, "Wrong alignment on WBP_BuildSet_PartsList_C_SetAnimatedScrollValue");
static_assert(sizeof(WBP_BuildSet_PartsList_C_SetAnimatedScrollValue) == 0x000028, "Wrong size on WBP_BuildSet_PartsList_C_SetAnimatedScrollValue");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetAnimatedScrollValue, Lerp_Value) == 0x000000, "Member 'WBP_BuildSet_PartsList_C_SetAnimatedScrollValue::Lerp_Value' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetAnimatedScrollValue, CallFunc_GetScrollOffset_ReturnValue) == 0x000008, "Member 'WBP_BuildSet_PartsList_C_SetAnimatedScrollValue::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetAnimatedScrollValue, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'WBP_BuildSet_PartsList_C_SetAnimatedScrollValue::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetAnimatedScrollValue, CallFunc_Lerp_A_ImplicitCast) == 0x000018, "Member 'WBP_BuildSet_PartsList_C_SetAnimatedScrollValue::CallFunc_Lerp_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetAnimatedScrollValue, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000020, "Member 'WBP_BuildSet_PartsList_C_SetAnimatedScrollValue::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_BuildSet_PartsList.WBP_BuildSet_PartsList_C.SetPartsList
// 0x0058 (0x0058 - 0x0000)
struct WBP_BuildSet_PartsList_C_SetPartsList final
{
public:
	TArray<class FText>                           PartsListEntries;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Buildset_PartsEntry_C*             K2Node_DynamicCast_AsWBP_Buildset_Parts_Entry;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildSet_PartsList_C_SetPartsList) == 0x000008, "Wrong alignment on WBP_BuildSet_PartsList_C_SetPartsList");
static_assert(sizeof(WBP_BuildSet_PartsList_C_SetPartsList) == 0x000058, "Wrong size on WBP_BuildSet_PartsList_C_SetPartsList");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, PartsListEntries) == 0x000000, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::PartsListEntries' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, CallFunc_TextIsEmpty_ReturnValue) == 0x000030, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, CallFunc_BP_CreateEntry_ReturnValue) == 0x000040, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::CallFunc_BP_CreateEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, K2Node_DynamicCast_AsWBP_Buildset_Parts_Entry) == 0x000048, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::K2Node_DynamicCast_AsWBP_Buildset_Parts_Entry' has a wrong offset!");
static_assert(offsetof(WBP_BuildSet_PartsList_C_SetPartsList, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_BuildSet_PartsList_C_SetPartsList::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_BuildSet_PartsList.WBP_BuildSet_PartsList_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildSet_PartsList_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildSet_PartsList_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_BuildSet_PartsList_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_BuildSet_PartsList_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_BuildSet_PartsList_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_BuildSet_PartsList_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_BuildSet_PartsList_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

