#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Expandable_Level

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "WBP_Expandable_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Expandable_Level.WBP_Expandable_Level_C
// 0x0050 (0x1630 - 0x15E0)
class UWBP_Expandable_Level_C final : public UWBP_Expandable_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Expandable_Level_C;             // 0x15E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortPassLevelViewModel*                FortPassLevelViewModel;                            // 0x15E8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UImage*                                 LevelProgress;                                     // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Level;                                        // 0x1600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_NumBattleStars;                               // 0x1608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_XpToNextLevel;                                // 0x1610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_LevelInfo;                             // 0x1618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Parameter_Name;                                    // 0x1620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnFocusReceived();
	void BP_OnHovered();
	void BP_OnInputMethodChanged(ECommonInputType CurrentInputType);
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_WBP_Expandable_Level(int32 EntryPoint);
	void OnInitialized();
	void SetFortPassLevelViewModel(class UFortPassLevelViewModel* ViewModel);
	void SetLevelCircleProgress(double XPProgress);

	void __1c8202ecMinus4ecaMinus8d23Minus4efeMinuse8a2531506f0_SourceToDest(class FText* RemainingXP) const;
	class FText __1eeaf5a8Minus4db5Minus3f28Minusa106Minus9ea69cae3560_SourceToDest() const;
	class FText __77da8dafMinus4852Minuscb93Minus27ceMinuscbb33b3ed865_SourceToDest() const;
	void __9c7cb99dMinus4a57Minus4531Minusf37eMinusedadfa5cc878_SourceToDest(double* ProgressXP) const;
	void ProgressXP(int32 CurrentXP, int32 XpToNextLevel, double* ProgressXP_0) const;
	void RemainingXP(int32 XpToNextLevel, int32 CurrentXP, class FText* RemainingXP_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Expandable_Level_C">();
	}
	static class UWBP_Expandable_Level_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Expandable_Level_C>();
	}
};
static_assert(alignof(UWBP_Expandable_Level_C) == 0x000010, "Wrong alignment on UWBP_Expandable_Level_C");
static_assert(sizeof(UWBP_Expandable_Level_C) == 0x001630, "Wrong size on UWBP_Expandable_Level_C");
static_assert(offsetof(UWBP_Expandable_Level_C, UberGraphFrame_WBP_Expandable_Level_C) == 0x0015E0, "Member 'UWBP_Expandable_Level_C::UberGraphFrame_WBP_Expandable_Level_C' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Level_C, FortPassLevelViewModel) == 0x0015E8, "Member 'UWBP_Expandable_Level_C::FortPassLevelViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Level_C, LevelProgress) == 0x0015F0, "Member 'UWBP_Expandable_Level_C::LevelProgress' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Level_C, Separator) == 0x0015F8, "Member 'UWBP_Expandable_Level_C::Separator' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Level_C, Text_Level) == 0x001600, "Member 'UWBP_Expandable_Level_C::Text_Level' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Level_C, Text_NumBattleStars) == 0x001608, "Member 'UWBP_Expandable_Level_C::Text_NumBattleStars' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Level_C, Text_XpToNextLevel) == 0x001610, "Member 'UWBP_Expandable_Level_C::Text_XpToNextLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Level_C, VerticalBox_LevelInfo) == 0x001618, "Member 'UWBP_Expandable_Level_C::VerticalBox_LevelInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Expandable_Level_C, Parameter_Name) == 0x001620, "Member 'UWBP_Expandable_Level_C::Parameter_Name' has a wrong offset!");

}

