#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_Tab_CollapsibleSub_Enhanced

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_UIKit_Button_Tab_Collapsible_Base_classes.hpp"
#include "SlateCore_structs.hpp"
#include "E_UI_Alignment_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_Tab_CollapsibleSub_Enhanced.WBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C
// 0x0090 (0x18D0 - 0x1840)
class UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C final : public UWBP_UIKit_Button_Tab_Collapsible_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C; // 0x1838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnSelected;                                        // 0x1840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnCollapsed;                                       // 0x1848(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Pip;                                         // 0x1850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Block_Outline_C*             UIKit_Block_Outline;                               // 0x1858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                TopAlignmentPadding;                               // 0x1860(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                BottomAlignmentPadding;                            // 0x1870(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                LeftAlignmentPadding;                              // 0x1880(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                RightAlignmentPadding;                             // 0x1890(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_UI_Alignment                                SelectedBarPosition;                               // 0x18A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A1[0x3];                                     // 0x18A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WrapTextAt;                                        // 0x18A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CollapsedAnimValue;                                // 0x18A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                CachedTextMargin;                                  // 0x18B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   TypefaceCollapsed;                                 // 0x18C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceExpanded;                                  // 0x18C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Category_Expanded;                              // 0x18C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnFocusLost();
	void BP_OnFocusReceived();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void BP_OnWidgetStyled();
	void ExecuteUbergraph_WBP_UIKit_Button_Tab_CollapsibleSub_Enhanced(int32 EntryPoint);
	void InitializeLayout();
	void InitializeText();
	void On_Collapsed();
	void On_Expanded();
	void OnCategoryExpandedStateChanged(bool IsCategoryExpanded);
	void PreConstruct(bool IsDesignTime);
	void ResetAnimations();
	void SequenceEvent__ENTRYPOINTWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced();
	void SequencerEventToggleTextWrap();
	void SetCollapsedAnimValue(double Value);
	void SetSelectionAlignment(E_UI_Alignment Selection_Alignment);
	void UpdateAlignment(E_UI_Alignment Selection_Alignment);
	void UpdatePadding(E_UI_Alignment SelectionAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C">();
	}
	static class UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C) == 0x000010, "Wrong alignment on UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C");
static_assert(sizeof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C) == 0x0018D0, "Wrong size on UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, UberGraphFrame_WBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C) == 0x001838, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::UberGraphFrame_WBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, OnSelected) == 0x001840, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, OnCollapsed) == 0x001848, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::OnCollapsed' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, Image_Pip) == 0x001850, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::Image_Pip' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, UIKit_Block_Outline) == 0x001858, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::UIKit_Block_Outline' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, TopAlignmentPadding) == 0x001860, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::TopAlignmentPadding' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, BottomAlignmentPadding) == 0x001870, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::BottomAlignmentPadding' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, LeftAlignmentPadding) == 0x001880, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::LeftAlignmentPadding' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, RightAlignmentPadding) == 0x001890, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::RightAlignmentPadding' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, SelectedBarPosition) == 0x0018A0, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::SelectedBarPosition' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, WrapTextAt) == 0x0018A4, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::WrapTextAt' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, CollapsedAnimValue) == 0x0018A8, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::CollapsedAnimValue' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, CachedTextMargin) == 0x0018B0, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::CachedTextMargin' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, TypefaceCollapsed) == 0x0018C0, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::TypefaceCollapsed' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, TypefaceExpanded) == 0x0018C4, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::TypefaceExpanded' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C, Is_Category_Expanded) == 0x0018C8, "Member 'UWBP_UIKit_Button_Tab_CollapsibleSub_Enhanced_C::Is_Category_Expanded' has a wrong offset!");

}

