#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildSet_PartsList

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuildSet_PartsList.WBP_BuildSet_PartsList_C
// 0x0030 (0x0430 - 0x0400)
class UWBP_BuildSet_PartsList_C final : public UCommonActivatableWidget
{
public:
	class UWidgetAnimation*                       Scroll;                                            // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Entries;                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Text;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ScrollOffsetStep;                                  // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScrollTarget;                                      // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimatedScrollValue;                               // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void HandleScroll(EUINavigation Direction);
	void SetAnimatedScrollValue(double Lerp_Value);
	void SetPartsList(TArray<class FText>& PartsListEntries);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuildSet_PartsList_C">();
	}
	static class UWBP_BuildSet_PartsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuildSet_PartsList_C>();
	}
};
static_assert(alignof(UWBP_BuildSet_PartsList_C) == 0x000008, "Wrong alignment on UWBP_BuildSet_PartsList_C");
static_assert(sizeof(UWBP_BuildSet_PartsList_C) == 0x000430, "Wrong size on UWBP_BuildSet_PartsList_C");
static_assert(offsetof(UWBP_BuildSet_PartsList_C, Scroll) == 0x000400, "Member 'UWBP_BuildSet_PartsList_C::Scroll' has a wrong offset!");
static_assert(offsetof(UWBP_BuildSet_PartsList_C, FortDynamicEntryBox_Entries) == 0x000408, "Member 'UWBP_BuildSet_PartsList_C::FortDynamicEntryBox_Entries' has a wrong offset!");
static_assert(offsetof(UWBP_BuildSet_PartsList_C, ScrollBox_Text) == 0x000410, "Member 'UWBP_BuildSet_PartsList_C::ScrollBox_Text' has a wrong offset!");
static_assert(offsetof(UWBP_BuildSet_PartsList_C, ScrollOffsetStep) == 0x000418, "Member 'UWBP_BuildSet_PartsList_C::ScrollOffsetStep' has a wrong offset!");
static_assert(offsetof(UWBP_BuildSet_PartsList_C, ScrollTarget) == 0x000420, "Member 'UWBP_BuildSet_PartsList_C::ScrollTarget' has a wrong offset!");
static_assert(offsetof(UWBP_BuildSet_PartsList_C, AnimatedScrollValue) == 0x000428, "Member 'UWBP_BuildSet_PartsList_C::AnimatedScrollValue' has a wrong offset!");

}

