#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Juno_CustomBanner_Entry

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Juno_CustomBanner_Entry.WBP_Juno_CustomBanner_Entry_C.SetAmount
// 0x0020 (0x0020 - 0x0000)
struct WBP_Juno_CustomBanner_Entry_C_SetAmount final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_Juno_CustomBanner_Entry_C_SetAmount) == 0x000008, "Wrong alignment on WBP_Juno_CustomBanner_Entry_C_SetAmount");
static_assert(sizeof(WBP_Juno_CustomBanner_Entry_C_SetAmount) == 0x000020, "Wrong size on WBP_Juno_CustomBanner_Entry_C_SetAmount");
static_assert(offsetof(WBP_Juno_CustomBanner_Entry_C_SetAmount, Amount) == 0x000000, "Member 'WBP_Juno_CustomBanner_Entry_C_SetAmount::Amount' has a wrong offset!");
static_assert(offsetof(WBP_Juno_CustomBanner_Entry_C_SetAmount, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_Juno_CustomBanner_Entry_C_SetAmount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Juno_CustomBanner_Entry.WBP_Juno_CustomBanner_Entry_C.SetName
// 0x0018 (0x0018 - 0x0000)
struct WBP_Juno_CustomBanner_Entry_C_SetName final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Juno_CustomBanner_Entry_C_SetName) == 0x000008, "Wrong alignment on WBP_Juno_CustomBanner_Entry_C_SetName");
static_assert(sizeof(WBP_Juno_CustomBanner_Entry_C_SetName) == 0x000018, "Wrong size on WBP_Juno_CustomBanner_Entry_C_SetName");
static_assert(offsetof(WBP_Juno_CustomBanner_Entry_C_SetName, Text) == 0x000000, "Member 'WBP_Juno_CustomBanner_Entry_C_SetName::Text' has a wrong offset!");

}

