#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Scrim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Scrim.WBP_UIKit_Scrim_C
// 0x0040 (0x0300 - 0x02C0)
class UWBP_UIKit_Scrim_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOut;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_FadeIn;                                       // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ClickCatcher;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayBlur;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPostBufferUpdate*                      PostBufferUpdate;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Blur;                                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseClickCatcher;                                   // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Scrim(int32 EntryPoint);
	void FadeIn();
	void FadeOut();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetBlur(float Blur_Strength);
	void SetClickCatch(bool Enable);
	void SetDimColor(const struct FLinearColor& Color);
	void SetDimMaterial(class UMaterialInstance* Material_Instance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Scrim_C">();
	}
	static class UWBP_UIKit_Scrim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Scrim_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Scrim_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Scrim_C");
static_assert(sizeof(UWBP_UIKit_Scrim_C) == 0x000300, "Wrong size on UWBP_UIKit_Scrim_C");
static_assert(offsetof(UWBP_UIKit_Scrim_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UIKit_Scrim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Scrim_C, Anim_FadeOut) == 0x0002C8, "Member 'UWBP_UIKit_Scrim_C::Anim_FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Scrim_C, Anim_FadeIn) == 0x0002D0, "Member 'UWBP_UIKit_Scrim_C::Anim_FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Scrim_C, ClickCatcher) == 0x0002D8, "Member 'UWBP_UIKit_Scrim_C::ClickCatcher' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Scrim_C, OverlayBlur) == 0x0002E0, "Member 'UWBP_UIKit_Scrim_C::OverlayBlur' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Scrim_C, PostBufferUpdate) == 0x0002E8, "Member 'UWBP_UIKit_Scrim_C::PostBufferUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Scrim_C, Blur) == 0x0002F0, "Member 'UWBP_UIKit_Scrim_C::Blur' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Scrim_C, UseClickCatcher) == 0x0002F8, "Member 'UWBP_UIKit_Scrim_C::UseClickCatcher' has a wrong offset!");

}

