#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BottomBarDecoyButton

#include "Basic.hpp"

#include "WBP_UIKit_Button_Quiet_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BottomBarDecoyButton.WBP_BottomBarDecoyButton_C
// 0x0020 (0x1990 - 0x1970)
class UWBP_BottomBarDecoyButton_C final : public UWBP_UIKit_Button_Quiet_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_BottomBarDecoyButton_C;         // 0x1968(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FDataTableRowHandle                    BottomButtonInputAction;                           // 0x1970(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    No_Input_Action_Row;                               // 0x1980(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void CacheInputAction();
	void Construct();
	void ExecuteUbergraph_WBP_BottomBarDecoyButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBottomButtonVisibility(bool ShouldButtonBeVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BottomBarDecoyButton_C">();
	}
	static class UWBP_BottomBarDecoyButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BottomBarDecoyButton_C>();
	}
};
static_assert(alignof(UWBP_BottomBarDecoyButton_C) == 0x000010, "Wrong alignment on UWBP_BottomBarDecoyButton_C");
static_assert(sizeof(UWBP_BottomBarDecoyButton_C) == 0x001990, "Wrong size on UWBP_BottomBarDecoyButton_C");
static_assert(offsetof(UWBP_BottomBarDecoyButton_C, UberGraphFrame_WBP_BottomBarDecoyButton_C) == 0x001968, "Member 'UWBP_BottomBarDecoyButton_C::UberGraphFrame_WBP_BottomBarDecoyButton_C' has a wrong offset!");
static_assert(offsetof(UWBP_BottomBarDecoyButton_C, BottomButtonInputAction) == 0x001970, "Member 'UWBP_BottomBarDecoyButton_C::BottomButtonInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_BottomBarDecoyButton_C, No_Input_Action_Row) == 0x001980, "Member 'UWBP_BottomBarDecoyButton_C::No_Input_Action_Row' has a wrong offset!");

}

