#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_Regular

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_UI_CTAButtonType_structs.hpp"
#include "WBP_UIKit_ButtonCTA_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_Regular.WBP_UIKit_Button_Regular_C
// 0x0050 (0x1960 - 0x1910)
class UWBP_UIKit_Button_Regular_C final : public UWBP_UIKit_ButtonCTA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_Regular_C;         // 0x1908(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	E_UI_CTAButtonType                            ButtonType;                                        // 0x1910(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1911[0x7];                                     // 0x1911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      RegularFontMaterial;                               // 0x1918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularSecondaryFontMaterial;                      // 0x1920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularBackgroundMaterial;                         // 0x1928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularOutlineMaterial;                            // 0x1930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietFontMaterial;                                 // 0x1938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietSecondaryFontMaterial;                        // 0x1940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietBackgroundMaterial;                           // 0x1948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietOutlineMaterial;                              // 0x1950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnWidgetStyled();
	void ExecuteUbergraph_WBP_UIKit_Button_Regular(int32 EntryPoint);
	void OverrideFontMaterials(class UMaterialInstance* PrimaryFontMaterial, class UMaterialInstance* SecondaryFontMaterial);
	void PreConstruct(bool IsDesignTime);
	void SetButtonType(E_UI_CTAButtonType ButtonType_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_Regular_C">();
	}
	static class UWBP_UIKit_Button_Regular_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_Regular_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Button_Regular_C) == 0x000010, "Wrong alignment on UWBP_UIKit_Button_Regular_C");
static_assert(sizeof(UWBP_UIKit_Button_Regular_C) == 0x001960, "Wrong size on UWBP_UIKit_Button_Regular_C");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, UberGraphFrame_WBP_UIKit_Button_Regular_C) == 0x001908, "Member 'UWBP_UIKit_Button_Regular_C::UberGraphFrame_WBP_UIKit_Button_Regular_C' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, ButtonType) == 0x001910, "Member 'UWBP_UIKit_Button_Regular_C::ButtonType' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, RegularFontMaterial) == 0x001918, "Member 'UWBP_UIKit_Button_Regular_C::RegularFontMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, RegularSecondaryFontMaterial) == 0x001920, "Member 'UWBP_UIKit_Button_Regular_C::RegularSecondaryFontMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, RegularBackgroundMaterial) == 0x001928, "Member 'UWBP_UIKit_Button_Regular_C::RegularBackgroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, RegularOutlineMaterial) == 0x001930, "Member 'UWBP_UIKit_Button_Regular_C::RegularOutlineMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, QuietFontMaterial) == 0x001938, "Member 'UWBP_UIKit_Button_Regular_C::QuietFontMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, QuietSecondaryFontMaterial) == 0x001940, "Member 'UWBP_UIKit_Button_Regular_C::QuietSecondaryFontMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, QuietBackgroundMaterial) == 0x001948, "Member 'UWBP_UIKit_Button_Regular_C::QuietBackgroundMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Button_Regular_C, QuietOutlineMaterial) == 0x001950, "Member 'UWBP_UIKit_Button_Regular_C::QuietOutlineMaterial' has a wrong offset!");

}

