#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_FilteredInputField

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_UI_BoolFloat_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_FilteredInputField.WBP_UIKit_FilteredInputField_C
// 0x0180 (0x0580 - 0x0400)
class UWBP_UIKit_FilteredInputField_C final : public UFortEditableFilteredCountedTextBox
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Error;                                             // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Label;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_Prompt;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorText;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Header;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_WrongTextFrame;                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Info;                                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_InputField_C*                InputField;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CharCount;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          HideValidationInfo;                                // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ETextJustify                                  Justification;                                     // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowTextPrompt;                                    // 0x0452(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_453[0x5];                                      // 0x0453(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PromptText;                                        // 0x0458(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnTextChanged;                                     // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          UseHintText;                                       // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HintText;                                          // 0x0488(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnSanitizedTextReady;                              // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnTextCommitByEnter;                               // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          SanitizedTextReady;                                // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTextCommitted;                                   // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   PersistentIDValidationErrorText;                   // 0x04D8(0x0018)(Edit, BlueprintVisible)
	bool                                          Is_Bad_Text;                                       // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LabelText;                                         // 0x04F8(0x0018)(Edit, BlueprintVisible)
	bool                                          HideLabel;                                         // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DefaultColor;                                      // 0x0514(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ErrorColor;                                        // 0x0524(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ValidColor;                                        // 0x0534(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSearchField;                                     // 0x0544(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    Input_Action_Row;                                  // 0x0548(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FS_UI_BoolFloat                        Width_Override;                                    // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_BoolFloat                        Height_Override;                                   // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__FilteredTextEntryWidget_WBP_UIKit_InputField_K2Node_ComponentBoundEvent_1_OnTextChanged__DelegateSignature(const class FText& Text);
	void BndEvt__FilteredTextEntryWidget_WBP_UIKit_InputField_K2Node_ComponentBoundEvent_3_OnTextCommited__DelegateSignature(const class FText& Text, ETextCommit Commit_method);
	void ExecuteUbergraph_WBP_UIKit_FilteredInputField(int32 EntryPoint);
	void GetCurrentText(class FText* Text);
	void GetErrorText(bool Additional_Validator_Failed, class FText* Appropriate_Text);
	void HandleShowPrompt();
	void OnCharCountTextChanged(const class FText& Text);
	void OnDirtyTextAttempted(bool bIsBadText, bool bAdditionalValidationFailed);
	void OnEditableTextChanged(const class FText& Text);
	void OnEditableTextHintChanged(const class FText& Text);
	void OnSanitizedTextReady__DelegateSignature(const class FText& Text, bool BadText);
	void OnTextChanged__DelegateSignature(const class FText& Text);
	void OnTextCommitByEnter__DelegateSignature();
	void OnTextCommitted__DelegateSignature(ETextCommit CommitMethod);
	void PreConstruct(bool IsDesignTime);
	void SetInputFieldText(const class FText& Text);
	void SetMinWidth(double InWidth);
	void SetReadOnly(bool IsReadOnly);
	void SetTextFocus();
	void UpdateColors();
	void UpdateConfiguration(bool bHideValidation, ETextJustify TextJustification, bool bShouldShowTextPrompt, const class FText& PromptDisplayText);
	void ValidatePersistentID(const class FText& Text);

	class FText GetEditedText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_FilteredInputField_C">();
	}
	static class UWBP_UIKit_FilteredInputField_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_FilteredInputField_C>();
	}
};
static_assert(alignof(UWBP_UIKit_FilteredInputField_C) == 0x000010, "Wrong alignment on UWBP_UIKit_FilteredInputField_C");
static_assert(sizeof(UWBP_UIKit_FilteredInputField_C) == 0x000580, "Wrong size on UWBP_UIKit_FilteredInputField_C");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, UberGraphFrame) == 0x000400, "Member 'UWBP_UIKit_FilteredInputField_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Error) == 0x000408, "Member 'UWBP_UIKit_FilteredInputField_C::Error' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, CommonText_Label) == 0x000410, "Member 'UWBP_UIKit_FilteredInputField_C::CommonText_Label' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, CommonTextBlock_Prompt) == 0x000418, "Member 'UWBP_UIKit_FilteredInputField_C::CommonTextBlock_Prompt' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, ErrorText) == 0x000420, "Member 'UWBP_UIKit_FilteredInputField_C::ErrorText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Header) == 0x000428, "Member 'UWBP_UIKit_FilteredInputField_C::Header' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Image_WrongTextFrame) == 0x000430, "Member 'UWBP_UIKit_FilteredInputField_C::Image_WrongTextFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Info) == 0x000438, "Member 'UWBP_UIKit_FilteredInputField_C::Info' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, InputField) == 0x000440, "Member 'UWBP_UIKit_FilteredInputField_C::InputField' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Text_CharCount) == 0x000448, "Member 'UWBP_UIKit_FilteredInputField_C::Text_CharCount' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, HideValidationInfo) == 0x000450, "Member 'UWBP_UIKit_FilteredInputField_C::HideValidationInfo' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Justification) == 0x000451, "Member 'UWBP_UIKit_FilteredInputField_C::Justification' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, ShowTextPrompt) == 0x000452, "Member 'UWBP_UIKit_FilteredInputField_C::ShowTextPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, PromptText) == 0x000458, "Member 'UWBP_UIKit_FilteredInputField_C::PromptText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, OnTextChanged) == 0x000470, "Member 'UWBP_UIKit_FilteredInputField_C::OnTextChanged' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, UseHintText) == 0x000480, "Member 'UWBP_UIKit_FilteredInputField_C::UseHintText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, HintText) == 0x000488, "Member 'UWBP_UIKit_FilteredInputField_C::HintText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, OnSanitizedTextReady) == 0x0004A0, "Member 'UWBP_UIKit_FilteredInputField_C::OnSanitizedTextReady' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, OnTextCommitByEnter) == 0x0004B0, "Member 'UWBP_UIKit_FilteredInputField_C::OnTextCommitByEnter' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, SanitizedTextReady) == 0x0004C0, "Member 'UWBP_UIKit_FilteredInputField_C::SanitizedTextReady' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, OnTextCommitted) == 0x0004C8, "Member 'UWBP_UIKit_FilteredInputField_C::OnTextCommitted' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, PersistentIDValidationErrorText) == 0x0004D8, "Member 'UWBP_UIKit_FilteredInputField_C::PersistentIDValidationErrorText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Is_Bad_Text) == 0x0004F0, "Member 'UWBP_UIKit_FilteredInputField_C::Is_Bad_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, LabelText) == 0x0004F8, "Member 'UWBP_UIKit_FilteredInputField_C::LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, HideLabel) == 0x000510, "Member 'UWBP_UIKit_FilteredInputField_C::HideLabel' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, DefaultColor) == 0x000514, "Member 'UWBP_UIKit_FilteredInputField_C::DefaultColor' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, ErrorColor) == 0x000524, "Member 'UWBP_UIKit_FilteredInputField_C::ErrorColor' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, ValidColor) == 0x000534, "Member 'UWBP_UIKit_FilteredInputField_C::ValidColor' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, IsSearchField) == 0x000544, "Member 'UWBP_UIKit_FilteredInputField_C::IsSearchField' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Input_Action_Row) == 0x000548, "Member 'UWBP_UIKit_FilteredInputField_C::Input_Action_Row' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Width_Override) == 0x000558, "Member 'UWBP_UIKit_FilteredInputField_C::Width_Override' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_FilteredInputField_C, Height_Override) == 0x000568, "Member 'UWBP_UIKit_FilteredInputField_C::Height_Override' has a wrong offset!");

}

