#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemDetails_PropBundle

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemDetails_PropBundle.WBP_ItemDetails_PropBundle_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_ItemDetails_PropBundle_C final : public UUserWidget
{
public:
	class UFortItemSelectionVM*                   FortItemSelectionVM;                               // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UJunoShopPropBundleItemDetailsVM*       JunoShopPropBundleItemDetailsVM;                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_VariantLegalText_1;                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ItemDetails_Buildset;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BuildSet_PartsList_C*              PartsList;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_InteractiveDecor;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Legal_Details_Buildset;                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UWidget* CustomScroll(EUINavigation Navigation_0);
	void OnPropsUpdated(TArray<struct FJunoShopPropInfo>& Props);
	void SetJunoShopPropBundleItemDetailsVM(class UJunoShopPropBundleItemDetailsVM* ViewModel);
	void SetPropBundleVM(class UFortItemVM* ItemVM);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemDetails_PropBundle_C">();
	}
	static class UWBP_ItemDetails_PropBundle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemDetails_PropBundle_C>();
	}
};
static_assert(alignof(UWBP_ItemDetails_PropBundle_C) == 0x000008, "Wrong alignment on UWBP_ItemDetails_PropBundle_C");
static_assert(sizeof(UWBP_ItemDetails_PropBundle_C) == 0x0002F8, "Wrong size on UWBP_ItemDetails_PropBundle_C");
static_assert(offsetof(UWBP_ItemDetails_PropBundle_C, FortItemSelectionVM) == 0x0002C0, "Member 'UWBP_ItemDetails_PropBundle_C::FortItemSelectionVM' has a wrong offset!");
static_assert(offsetof(UWBP_ItemDetails_PropBundle_C, JunoShopPropBundleItemDetailsVM) == 0x0002C8, "Member 'UWBP_ItemDetails_PropBundle_C::JunoShopPropBundleItemDetailsVM' has a wrong offset!");
static_assert(offsetof(UWBP_ItemDetails_PropBundle_C, HorizontalBox_VariantLegalText_1) == 0x0002D0, "Member 'UWBP_ItemDetails_PropBundle_C::HorizontalBox_VariantLegalText_1' has a wrong offset!");
static_assert(offsetof(UWBP_ItemDetails_PropBundle_C, ItemDetails_Buildset) == 0x0002D8, "Member 'UWBP_ItemDetails_PropBundle_C::ItemDetails_Buildset' has a wrong offset!");
static_assert(offsetof(UWBP_ItemDetails_PropBundle_C, PartsList) == 0x0002E0, "Member 'UWBP_ItemDetails_PropBundle_C::PartsList' has a wrong offset!");
static_assert(offsetof(UWBP_ItemDetails_PropBundle_C, Text_InteractiveDecor) == 0x0002E8, "Member 'UWBP_ItemDetails_PropBundle_C::Text_InteractiveDecor' has a wrong offset!");
static_assert(offsetof(UWBP_ItemDetails_PropBundle_C, Text_Legal_Details_Buildset) == 0x0002F0, "Member 'UWBP_ItemDetails_PropBundle_C::Text_Legal_Details_Buildset' has a wrong offset!");

}

