#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buildset_Ingredients_Dialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Buildset_Ingredients_Dialog.WBP_Buildset_Ingredients_Dialog_C
// 0x0070 (0x0470 - 0x0400)
class UWBP_Buildset_Ingredients_Dialog_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UJunoShopBuildSetItemDetailsVM*         JunoShopBuildSetItemDetailsVM;                     // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       Scroll;                                            // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCloseButton_C*                         Button_CloseTouch;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_Dialog_Base_C*               Dialog_Base;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Ingredients;                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Ingredients;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUIKitDialogButtonViewModel*>    TouchDialogButtons;                                // 0x0438(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<class UUIKitDialogButtonViewModel*>    PC_ConsoleDialogButtons;                           // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ScrollOffsetStep;                                  // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScrollTarget;                                      // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimatedScrollValue;                               // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Buildset_Ingredients_Dialog_Button_CloseTouch_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	class UWidget* CustomScroll(EUINavigation Direction);
	void ExecuteUbergraph_WBP_Buildset_Ingredients_Dialog(int32 EntryPoint);
	void GetDialogButtonsBasedOnInput(ECommonInputType NewInputMethod, TArray<class UUIKitDialogButtonViewModel*>* Dialog_Buttons);
	void HandleInputTypeChange(ECommonInputType bNewInputType);
	void HandleScroll(EUINavigation Direction);
	void OnButtonClicked(int32 ButtonIndex);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Set_Custom_Scroll();
	void SetAnimatedScrollValue(double LerpValue);
	void SetIngredientsList(TArray<struct FJunoShopBuildResourceRequirement>& Array);
	void SetJunoShopBuildSetItemDetailsVM(class UJunoShopBuildSetItemDetailsVM* ViewModel);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Buildset_Ingredients_Dialog_C">();
	}
	static class UWBP_Buildset_Ingredients_Dialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Buildset_Ingredients_Dialog_C>();
	}
};
static_assert(alignof(UWBP_Buildset_Ingredients_Dialog_C) == 0x000008, "Wrong alignment on UWBP_Buildset_Ingredients_Dialog_C");
static_assert(sizeof(UWBP_Buildset_Ingredients_Dialog_C) == 0x000470, "Wrong size on UWBP_Buildset_Ingredients_Dialog_C");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Buildset_Ingredients_Dialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, JunoShopBuildSetItemDetailsVM) == 0x000408, "Member 'UWBP_Buildset_Ingredients_Dialog_C::JunoShopBuildSetItemDetailsVM' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, Scroll) == 0x000410, "Member 'UWBP_Buildset_Ingredients_Dialog_C::Scroll' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, Button_CloseTouch) == 0x000418, "Member 'UWBP_Buildset_Ingredients_Dialog_C::Button_CloseTouch' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, Dialog_Base) == 0x000420, "Member 'UWBP_Buildset_Ingredients_Dialog_C::Dialog_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, FortDynamicEntryBox_Ingredients) == 0x000428, "Member 'UWBP_Buildset_Ingredients_Dialog_C::FortDynamicEntryBox_Ingredients' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, ScrollBox_Ingredients) == 0x000430, "Member 'UWBP_Buildset_Ingredients_Dialog_C::ScrollBox_Ingredients' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, TouchDialogButtons) == 0x000438, "Member 'UWBP_Buildset_Ingredients_Dialog_C::TouchDialogButtons' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, PC_ConsoleDialogButtons) == 0x000448, "Member 'UWBP_Buildset_Ingredients_Dialog_C::PC_ConsoleDialogButtons' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, ScrollOffsetStep) == 0x000458, "Member 'UWBP_Buildset_Ingredients_Dialog_C::ScrollOffsetStep' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, ScrollTarget) == 0x000460, "Member 'UWBP_Buildset_Ingredients_Dialog_C::ScrollTarget' has a wrong offset!");
static_assert(offsetof(UWBP_Buildset_Ingredients_Dialog_C, AnimatedScrollValue) == 0x000468, "Member 'UWBP_Buildset_Ingredients_Dialog_C::AnimatedScrollValue' has a wrong offset!");

}

