#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Badge_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_UI_BadgeIndicatorType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_UI_BadgeType_structs.hpp"
#include "E_UI_BadgeSize_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "E_UI_StatusIndicator_Type_structs.hpp"
#include "E_UI_StatusIndicator_Configuration_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Badge_Base.WBP_UIKit_Badge_Base_C
// 0x01E8 (0x04A8 - 0x02C0)
class UWBP_UIKit_Badge_Base_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GP_Content;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_Content;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UIKit_StatusIndicator_C*           StatusIndicator;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBadge;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BadgeText;                                         // 0x02F0(0x0018)(Edit, BlueprintVisible)
	E_UI_BadgeType                                BadgeType;                                         // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         TextFont;                                          // 0x0310(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         NumericFont;                                       // 0x0368(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	E_UI_BadgeIndicatorType                       IndicatorConfig;                                   // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Type                     Indicator_Type;                                    // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x6];                                      // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                IndicatorIcon;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_UI_BadgeSize                                BadgeSize;                                         // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                BadgePadding_Compact;                              // 0x03D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                                BadgePadding_Default;                              // 0x03E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         NumericFont_Compact;                               // 0x03F8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         TextFont_Compact;                                  // 0x0450(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Badge_Base(int32 EntryPoint);
	void InitializeBadge();
	void PreConstruct(bool IsDesignTime);
	void RefreshBadge();
	void SetBadgeSize(E_UI_BadgeSize BadgeSize_0);
	void SetBadgeText(const class FText& Text);
	void SetBadgeType(E_UI_BadgeType Type);
	void SetIndicatorConfiguration(E_UI_BadgeIndicatorType Config);
	void SetIndicatorIcon(class UObject* IconAsset);
	void SetIndicatorType(E_UI_StatusIndicator_Type IndicatorType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Badge_Base_C">();
	}
	static class UWBP_UIKit_Badge_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Badge_Base_C>();
	}
};
static_assert(alignof(UWBP_UIKit_Badge_Base_C) == 0x000008, "Wrong alignment on UWBP_UIKit_Badge_Base_C");
static_assert(sizeof(UWBP_UIKit_Badge_Base_C) == 0x0004A8, "Wrong size on UWBP_UIKit_Badge_Base_C");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UIKit_Badge_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, BG) == 0x0002C8, "Member 'UWBP_UIKit_Badge_Base_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, GP_Content) == 0x0002D0, "Member 'UWBP_UIKit_Badge_Base_C::GP_Content' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, SB_Content) == 0x0002D8, "Member 'UWBP_UIKit_Badge_Base_C::SB_Content' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, StatusIndicator) == 0x0002E0, "Member 'UWBP_UIKit_Badge_Base_C::StatusIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, TextBadge) == 0x0002E8, "Member 'UWBP_UIKit_Badge_Base_C::TextBadge' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, BadgeText) == 0x0002F0, "Member 'UWBP_UIKit_Badge_Base_C::BadgeText' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, BadgeType) == 0x000308, "Member 'UWBP_UIKit_Badge_Base_C::BadgeType' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, TextFont) == 0x000310, "Member 'UWBP_UIKit_Badge_Base_C::TextFont' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, NumericFont) == 0x000368, "Member 'UWBP_UIKit_Badge_Base_C::NumericFont' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, IndicatorConfig) == 0x0003C0, "Member 'UWBP_UIKit_Badge_Base_C::IndicatorConfig' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, Indicator_Type) == 0x0003C1, "Member 'UWBP_UIKit_Badge_Base_C::Indicator_Type' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, IndicatorIcon) == 0x0003C8, "Member 'UWBP_UIKit_Badge_Base_C::IndicatorIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, BadgeSize) == 0x0003D0, "Member 'UWBP_UIKit_Badge_Base_C::BadgeSize' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, BadgePadding_Compact) == 0x0003D4, "Member 'UWBP_UIKit_Badge_Base_C::BadgePadding_Compact' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, BadgePadding_Default) == 0x0003E4, "Member 'UWBP_UIKit_Badge_Base_C::BadgePadding_Default' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, NumericFont_Compact) == 0x0003F8, "Member 'UWBP_UIKit_Badge_Base_C::NumericFont_Compact' has a wrong offset!");
static_assert(offsetof(UWBP_UIKit_Badge_Base_C, TextFont_Compact) == 0x000450, "Member 'UWBP_UIKit_Badge_Base_C::TextFont_Compact' has a wrong offset!");

}

