#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActivityBrowserTile_JoinableParty_RoundedCorners

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_ActivityBrowserTile_JoinableParty_RoundedCorners.WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C.BndEvt__WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BndEvt__WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_WBP_CTA_ButtonPrimary_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty_RoundedCorners.WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C.BP_OnSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_OnSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_OnSelectionChanged) == 0x000001, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_OnSelectionChanged");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_OnSelectionChanged) == 0x000001, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_OnSelectionChanged");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_OnSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_OnSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty_RoundedCorners.WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C.BP_PartyInformationUpdated
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_PartyInformationUpdated final
{
public:
	bool                                          bInIsTileSelected;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_PartyInformationUpdated) == 0x000001, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_PartyInformationUpdated");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_PartyInformationUpdated) == 0x000001, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_PartyInformationUpdated");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_PartyInformationUpdated, bInIsTileSelected) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_BP_PartyInformationUpdated::bInIsTileSelected' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty_RoundedCorners.WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C.ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners
// 0x02F8 (0x02F8 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUIKitContextMenuActionInfo            K2Node_MakeStruct_UIKitContextMenuActionInfo;      // 0x0020(0x0050)(ContainsInstancedReference)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTexture*                         K2Node_Event_ThumbnailTexture_1;                   // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_RichPresence;                         // 0x0090(0x0018)(ConstParm)
	class FText                                   K2Node_Event_Names;                                // 0x00A8(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_SingleFriendName;                     // 0x00E0(0x0018)(ConstParm)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_2;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_LastInteraction;                      // 0x0108(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x014C(0x0014)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsTileSelected;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture*                         K2Node_Event_ThumbnailTexture;                     // 0x01D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_OtherPlayersSubText;                  // 0x01E0(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsTileActive;                        // 0x01F9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FE[0x2];                                      // 0x01FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InteractionText;                      // 0x0200(0x0018)(ConstParm)
	bool                                          K2Node_Event_bInteractionFound;                    // 0x0218(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInteractionEnabled;                // 0x021B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFortGameActivity*                      K2Node_Event_GameActivity;                         // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0234(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue_1;               // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_1;               // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_3;                           // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_4;                           // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_5;                           // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_6;                           // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_2;               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_3;               // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_7;                           // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Select_Default_8;                           // 0x02C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_9;                           // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners) == 0x000008, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners) == 0x0002F8, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, EntryPoint) == 0x000000, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable) == 0x000010, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_IsUsingTouch_ReturnValue) == 0x000011, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable_1) == 0x000012, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable_2) == 0x000013, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000018, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_MakeStruct_UIKitContextMenuActionInfo) == 0x000020, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_MakeStruct_UIKitContextMenuActionInfo' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetCurrentInputType_ReturnValue) == 0x000070, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000080, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_ThumbnailTexture_1) == 0x000088, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_ThumbnailTexture_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_RichPresence) == 0x000090, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_RichPresence' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_Names) == 0x0000A8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_Names' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_TextIsEmpty_ReturnValue) == 0x0000C0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_byte_Variable) == 0x0000C1, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_byte_Variable_1) == 0x0000C2, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable_3) == 0x0000C3, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x0000D0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetCurrentInputType_ReturnValue_1) == 0x0000D8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetCurrentInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_SingleFriendName) == 0x0000E0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_SingleFriendName' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x0000F8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetCurrentInputType_ReturnValue_2) == 0x000100, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetCurrentInputType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_LastInteraction) == 0x000108, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_LastInteraction' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000120, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_struct_Variable) == 0x000128, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_struct_Variable_1) == 0x000138, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable_4) == 0x000148, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_MakeStruct_SlateColor) == 0x00014C, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_PlayAnimation_ReturnValue) == 0x000160, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_PlayAnimation_ReturnValue_1) == 0x000168, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_bIsSelected) == 0x000170, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_bInIsTileSelected) == 0x000171, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_bInIsTileSelected' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_struct_Variable_2) == 0x000178, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable_5) == 0x000188, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_struct_Variable_3) == 0x000190, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_struct_Variable_4) == 0x0001A0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable_6) == 0x0001B0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_struct_Variable_5) == 0x0001B8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable_7) == 0x0001C8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_byte_Variable_2) == 0x0001C9, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001CA, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_ThumbnailTexture) == 0x0001D0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_ThumbnailTexture' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_byte_Variable_3) == 0x0001D8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_OtherPlayersSubText) == 0x0001E0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_OtherPlayersSubText' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_TextIsEmpty_ReturnValue_2) == 0x0001F8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_TextIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_bIsTileActive) == 0x0001F9, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_bIsTileActive' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default) == 0x0001FA, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable_8) == 0x0001FB, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_byte_Variable_4) == 0x0001FC, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default_1) == 0x0001FD, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_InteractionText) == 0x000200, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_InteractionText' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_bInteractionFound) == 0x000218, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_bInteractionFound' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_IsDesignTime) == 0x000219, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_byte_Variable_5) == 0x00021A, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_bIsInteractionEnabled) == 0x00021B, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_bIsInteractionEnabled' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_ComponentBoundEvent_Button) == 0x000220, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Event_GameActivity) == 0x000228, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Event_GameActivity' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_IsValid_ReturnValue) == 0x000230, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, Temp_bool_Variable_9) == 0x000231, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_CreateDelegate_OutputDelegate_1) == 0x000234, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default_2) == 0x000240, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_CustomEvent_bNewInputType) == 0x000241, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_IsMobileGame_ReturnValue) == 0x000242, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000248, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_IsMobileGame_ReturnValue_1) == 0x000250, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_IsMobileGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_IsUsingTouch_ReturnValue_1) == 0x000251, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_IsUsingTouch_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_BooleanAND_ReturnValue) == 0x000252, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_BooleanAND_ReturnValue_1) == 0x000253, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default_3) == 0x000258, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default_4) == 0x000268, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_SelectFloat_ReturnValue) == 0x000278, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default_5) == 0x000280, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_SelectFloat_ReturnValue_1) == 0x000290, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default_6) == 0x000298, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0002A8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x0002B0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_IsUsingTouch_ReturnValue_2) == 0x0002B8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_IsUsingTouch_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_IsUsingTouch_ReturnValue_3) == 0x0002B9, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_IsUsingTouch_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default_7) == 0x0002C0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default_8) == 0x0002C8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0002D0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetEndTime_ReturnValue) == 0x0002D8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_GetStartTime_ReturnValue) == 0x0002DC, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_PlayAnimationForward_ReturnValue) == 0x0002E0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, K2Node_Select_Default_9) == 0x0002E8, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x0002EC, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1) == 0x0002F0, "Member 'WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_ExecuteUbergraph_WBP_ActivityBrowserTile_JoinableParty_RoundedCorners::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1' has a wrong offset!");

// Function WBP_ActivityBrowserTile_JoinableParty_RoundedCorners.WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C.InputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_InputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_InputMethodChanged) == 0x000001, "Wrong alignment on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_InputMethodChanged");
static_assert(sizeof(WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_InputMethodChanged) == 0x000001, "Wrong size on WBP_ActivityBrowserTile_JoinableParty_RoundedCorners_C_InputMethodChanged");
